{
	"title": "壮志酬筹>业务被裁>副业转正>收入回正。一个前黑马程序员老师的2023",
	"author": "程序员Sunday",
	"publishTime": "2023-12-30",
	"readTime": "阅读8分钟",
	"tags": "[\"前端\",\"程序员\",\"年终总结\"]",
	"description": "仅以这篇文章记录我，一个普通程序猿的2023~~~~~~~~~~~~~~~~~~~~~~~~~~~",
	"article": "> 从年初时的踌躇满志，到年中时整个业务线被砍。全职做前端训练营，四个多月的时间帮助100多名同学拿到了满意的offer，同时也让我的收入重归正轨。仅以这个视频记录我，一个普通程序员的 2023 。\n\n> [视频版可直接访问](https://link.juejin.cn?target=https%3A%2F%2Fwww.bilibili.com%2Fvideo%2FBV1hN4y1B7vL%2F%3Fvd_source%3D391a8dc379e0da60c77490e3221f097a \"https://www.bilibili.com/video/BV1hN4y1B7vL/?vd_source=391a8dc379e0da60c77490e3221f097a\")\n\nHello，大家好，我是 Sunday。\n\n对我来说，2023 年真的是非常魔幻的一年。年初的时候疫情结束，大家都想着经济复苏，2023 肯定可以大干一场。结果没撑半年，业务线没啦，校区都快关门了。真的是：**众望所归皆浮云，一朝风雨尽成空**。\n\n回首自己在 2023 所经历的事情，就是一个典型的普通程序员缩影。所以这一次的内容，就用来记录我的 2023，也希望我的经历可以给大家带来一些启发。毕竟老话说得好：**以史为鉴可以知兴衰，以人为鉴可以明得失。**\n\n整个视频我会以月份来进行划分，不会涉及到所有的月份，会挑重要的事件来说，在 7 月份的时候达到了高潮。前半年主要是在黑马程序员的工作经历，中间会涉及到很多培训机构的工作日常。后半年主要是自己的一些“创业”经历，以及一些心态上的变化历程。\n\n01月：前往总部，誓师大会\n-------------\n\n一月份的时候，我代表济南校区的前端团队跟校长一起去北京总部参加年会。\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/57eec300b30a41ff83aaa4193d487eb0~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=3024&h=4032&s=1875872&e=heic&b=6c7479)\n\n说是年会，其实本质上更像是一个誓师大会。这种年会其实参与过的小伙伴都知道，唯一的营养就是饭好不好吃了。我依稀还记得当时集团老大在台上跟我们说：“2022 我们取得了不错的成绩，这都是大家共同努力的结果，2023 将会更好~~”。\n\n这个故事告诉我们：“行情与经济的发展真的是不可预测的。哪怕你找了再多的精算师和经济专家，到最后依然可能会发现预测的结果和实际的情况南辕北辙”。\n\n02 - 03月：精简团队，去除就业\n------------------\n\n很多的机构，在一开始都会为一个班级是配置 4 个老师：班主任（不负责技术，负责班级日常事务）、就业指导（负责班级就业的事情）、助教（配合授课老师）、授课老师（主要负责授课）。\n\n后来随着行情的发展，这些岗位都会发生变化\n\n先是去除了助教岗位，说是为了：提升老师对班级的掌控力。\n\n然后是一个班主任负责多个班级，最多的时候一个班主任应该是带了 4 个班。\n\n再往后就是去除就业指导岗位，说法是：老师完全可以带学生就业。并且就业的情况与老师的绩效挂钩。\n\n这导致的一个结果就是，在课程最后的一个月到一个半月的时间里面，几乎就不会再讲课了，而是全部用来处理就业的问题。毕竟只要你入职过，就算到就业率里面，很多机构也就有了可以宣传的资本了。\n\n不过学生也不是傻子，就业成什么样大家心里是清楚的。所以这就导致口碑下降，又因为口碑下降引起招生下滑，招生下滑引起持续裁员，从而产生恶性循环。\n\n这个故事告诉我们：“做教育，做的就是良心活，立身的根本就是口碑。如果说做大之后，一切都像利益看齐的话，那么最后可能口碑也留不住，利润也就留不住了。”\n\n04 - 06月：关班关班、裁员裁员\n------------------\n\n4月份到6月份，如果用两个词来描述，那就是：关班、裁员。\n\n我没有记错的话，年初的时候，我看企业微信全国前端老师群是 150 多人，等到 7 月初的时候是还剩下 90 多人，现在根据之前的同事透露，还有 30 多人。相当于裁员 80%， 恐怖如斯啊。\n\n这个时候就有小伙伴会说了：“被裁掉的，都是工作能力差的，你自己不行，裁你不活该吗？”\n\n这个还真不是。说这种话的小伙伴，一看就是没有经历过社会的毒打的。\n\n作为职场人，我们首先要认清的一点是：**所有的公司，都是以盈利为目的而存在的。** 那么当公司某一个业务线盈利能力下降的时候，开猿节流就是最有效，最直接的手段。\n\n既然，开猿的目的是为了节流，那么开掉什么样的人就比较有讲究了。\n\n前两天，一个同学来找我，说：“他们公司有几个同事被裁了。可是这几个同事，他们技术很好啊，平时沟通也都不错。他们走了之后，大家一起吃饭，聊起了工资，才发现，个个工资都比我多一倍。这才知道，我这个小卡米拉没被裁，不是因为我能力强，仅仅是因为我工资低，性价比高”。\n\n**性价比高**。这个词放到商品上应该是一个褒义词，但是放在个人身上就是一个贬义词了。当一个人说我是因为性价比高，所以才没有被裁的时候，得有多么自嘲啊。\n\n07月：离开黑马、做共学会\n-------------\n\n整个裁员运动在 7 月份的时候达到了高潮，至少对我来说是这样的。\n\n我是在7月4号被约谈离职的。当时还发了一个视频，闹得沸沸扬扬。\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/16bc430b12ee4e2ea442e8a50c169232~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=819&h=1130&s=187257&e=jpg&b=f6f1f0)\n\n第二天，我到公司，同事跟我说：“栋哥，全班都在看你发的视频，各个手机上都是你的脑袋”。领导也急了，直接找我谈，说让我把视频删了，说是对校区影响不好。\n\n我心想，你们都不干了，有啥影响不好的？跟我说离职赔偿砍半的时候，你怎么没想到影响不好？真是不当人啊。\n\n不过这个视频也是刷新了我的播放记录，到最后下架视频的时候，播放量应该是接近 50 万了，只不过最后没有截图，这是在 37 万播放量时候的截图。\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/10344b99211c4bb8acdec09928852efd~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=1048&h=900&s=619244&e=png&b=fefefe)\n\n当时我还自嘲：“十年编程无人知，一朝离职天下闻”。\n\n至于视频为什么会下架，大家也就别问了，应该和你心里想的差不多。\n\n从某马离开之后，也有不少的公司抛出了橄榄枝，不过当时我都一一谢绝了。原因其实也很简单：打工嘛，时间长了之后，就不再想打工了。\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/ebe5678986f24e999306cea56b035f6c~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=828&h=1792&s=129095&e=jpg&b=ece1de)\n\n从某马离开后的第一件事，我就先做了 **共学会**。共学会是一个高质量的学习圈子，为了避免广告嫌疑，这里就不去细说了。\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/1d159e11bd444364a2d76e13810ed3ca~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=2852&h=1532&s=1034370&e=png&a=1&b=fefefe)\n\n我是在 2013年7月 开始工作，在 2023年的7月离职做自由职业。7月份是我工作的整十年，真的是感触颇深。\n\n在这里我也奉劝各位小伙伴：把自己当成一家公司来经营，你现在的老板只是你的一个客户而已。而你要做的是要尽快找到更多的客户，也就是大家所说的副业。只有这样，当你的现任老板凉了之后，你才可以把这种影响降到最低。\n\n我庆幸的是，在工作期间我一直有自己的其他副业，并且副业收入也远远超过了主业收入。这才会让我在离职后不至于一下子变得窘迫起来。\n\n详细的，大家可以看下之前录制的这个视频，这里就不再细说了\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/14da5d462fd840b59a9b732be50c3981~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=1344&h=360&s=172918&e=png&a=1&b=fcfafa)\n\n08 - 12月：AllIn 副业、全职训练营\n-----------------------\n\n我在今年2月份的时候，就在做私教的服务了。只不过那个时候没有去进行任何的宣传。再加上做共学会的经验。所以我从八月份开始就正式全职训练营了，主打的就是个：1v1的私教服务。\n\n截止到目前为止，4个多月的时间，训练营一共有了 138 位同学。这是同学数量刚过百时候的统计数据：\n\n![](https://p3-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/498926bb7b594d0b9ae6d4521f3494d9~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=1614&h=610&s=146170&e=png&a=1&b=fefefe)\n\n在这里非常感谢各位同学对我的信任，同时训练营也算是交出来了一个满意的答卷。\n\n同时，我需要澄清的是，这里的数据指的是 **大家拿到的满意的 offer 数据**，可不是什么数据都往里放的。\n\n这四个月的时间，主要就是全职做训练营的日常，为了避免太多的广告嫌疑，这里就不再细说了。\n\n总结\n--\n\n目前，我很享受现在的工作。因为我可以完全按照我的想法来去做我想要做的事情。并且，到目前为止，我的想法和建议大多数的时候都是正确的。\n\n2023 并不容易，愿大家都可以砥砺前行。\n\n我是 Sunday，咱们下一次再见，拜拜~~"
}