{
	"title": "39岁前端程序员的年终总结",
	"author": "陈佬昔的编程人生",
	"publishTime": "2021-12-31",
	"readTime": "阅读7分钟",
	"tags": "[\"前端\"]",
	"description": "好多年都没写过个人年终总结了。以前会在QQ空间写。现在看起来都觉得挺有意思的。没想到突然间就到了39岁。从3字头跨越到4字头，总觉得还是有必要写点什么的。",
	"article": "好多年都没写过个人年终总结（非公司要求的工作年终总结）了。以前会在 QQ 空间写，或年少轻狂，或逗逼搞怪。现在看起来都觉得挺有意思的。\n\n不写的原因，是因为有朋友说计划是赶不上变化，不如顺其自然。于是，我也跟着不再做任何的总结、计划了。\n\n这样一放就好多年了，没想到突然间就到了 39 岁。如果以自然年来算，明天我就 40 了。从 3 字头跨越到 4 字头，总觉得还是有必要写点什么的。\n\n关于健康\n----\n\n意料之外，情理之中。我的体检报告出现了 6-7 项异常指标。\n\n其中的“肾囊肿”是最严重的了，需要每隔 3-6 个月就去体检。也是因为这个，我去买保险的时候，保险公司反而会犹豫。\n\n肾囊肿很奇怪的病，不知道如何预防，也没法医治，只能等待其长大，然后再做刺穿手术。医生只在病例上留下了“注意饮食，注意休息”8个大字，除此之外没有任何有建设性的建议。朋友说，这就像你得了水痘，不过这水痘长在肾上。我才略有释怀。\n\n即便如此，这应该也是衰老的一种表现吧。看来，还是很有必要做好养生保健了。\n\n当然，今年在健康上，也做了很大的改变的。年中参加了公司举办的 21 天的跑步比赛，每天跑步 3 公里。我从刚开始的半跑半走，到最后一周 2 次完整 5 公里，21天坚持了下来。\n\n为什么是 21 天？因为科学验证 21 天能养成一个好习惯。\n\n那最后我有没有养成天天跑步的习惯？并没有。哈哈。\n\n不过我的确养成了跑步的习惯。后面休息一段时间之后，我开始了每周 2 次跑步时间，也一直坚持到年末。\n\n![Screenshot_20211231_111816_com.gotokeep.keep.jpg](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/83857e19a4544dcca7d848e9f3cf2716~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp?)\n\n全年总跑步数 208 + 30（11 月后未在 Keep 统计）\n\n大家可以在图上看到我的平均配速其实才 7:53，除了我开始半跑半走的情况，后续我的速度也是不快的。\n\n对比速度而言，我更希望能突破距离，**期望明年能突破 10 km**。\n\n关于阅读与学习\n-------\n\n首先在读书方面，今年年初定了 10 本书的计划，没有完成。\n\nkindle 上完成了 3 本书的阅读《未来世界的幸存者》、《爱的博弈》、《少有人走的路》；纸质书则有 3 本《专注力》、《Javascript 设计模式》、《凤凰项目-一个IT运维的传奇故事》；掘金小册有《[前端工程师进阶 10 日谈](/book/6891929939616989188/section \"/book/6891929939616989188/section\")》\n\n《未来世界的幸存者》是阮一峰大佬的写作集，有不少有意思的观点。比如对工作的思考，**人们困在一个地方工作也才 200-300 年的时间，为什么人们却如此依赖一份稳定的工作呢**？感兴趣的同学可以去读读。\n\n《爱的博弈》、《少有人走的路》是半佛仙人的推荐，虽然可能有些观点不符合现在的世界观，但是还是值得一看。比如：《少有人走的路》讲到对个人成长来说，养育猫狗是完全无法与养育小孩相比的。养育小孩才能让你心智更成熟。\n\n![IMG_7651.heic](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/118b5498fc7849a19f57d917c1bdc29c~tplv-k3u1fbpfcp-zoom-in-crop-mark:1512:0:0:0.awebp?)\n\n感受最深的还是《凤凰项目》，书中描述的情况跟我所在的公司实在太像了，读着读着就深陷其中。互联网行业的从业人员未必会有这样的感触，但是在传统行业做数字化转型的人几乎会碰到书中的所有情况，每一个场景都如此熟悉。而本书后半部分的解决方案，也可以做为参考。\n\n学习上，也买了很多课程，但是最后学完的也就 3 个：《Serverless 入门课》、《技术管理实战36讲》、《一个草根创业者的40岁人生》。\n\n《Serverless 入门课》这门课程有很多实操案例，跟着一起操作，能很快上手 Serverless。它是我前公司同部门的前端同事开的课程，不由感慨，几年不见，我们的差距越来越大了。\n\n《技术管理实战 36 讲》也是前同事的课程。里面有很多对技术团队的思考，写得非常接地气，非常有实操性，非常适合从技术人员成长为管理者的人员阅读。这个课程的书籍也出版了，书名叫做《**知行——技术人的管理之路**》，也是非常值得一读的。\n\n总结下来，今年看了很多书，定了很多课程，但是完成的并不多。很多书读一读，就放在一边了，下次可能也想不起来要去阅读了。\n\n都说**专注力才是真正的稀缺资源**。目前这种比较随性的读书、学习方法能收到的成效应该是很少的。可能也只是比碎片化学习略好一点而已。\n\n明年可以尝试做如下改变：\n\n1.  **做好读书计划**。每月做一次本月的读书计划。\n2.  **读完一本再一本，或者两本交替读**。每次在读的书，不应超过 2 本，以此来增加自己的专注力。\n3.  **做好读书笔记**，只读书不做笔记，这本书很可能就仅仅是读过而已。\n4.  **对程序类书籍，要写代码实践**。\n\n另外也切记自己有买书成癖的陋习。\n\n关于工作\n----\n\n今年的工作，大部分的时间都在怼人上。平时怼怼产品，年初怼领导，年中怼隔壁领导。\n\n老实说，**我也想做一个柔软的人**，我也不想做一个摇滚中年，有棱有角的，到处惹恼他人。\n\n但是也许是受了这几年社会风气的影响，不表达态度其实很难生存。尤其是我还带着 30 号人的小团队。作为一个开发人员，我内心也希望躲在大佬后面默默地敲代码就好。但是总有那么一些时刻，我觉得还是很有必要发声的。\n\n当然，最后还是争取到了一些权利。比如，技术人员更多的岗位，给外包的同事外网访问的权利。\n\n在这里还是很感谢我的领导，还有各技术团队的负责人，他们大部分都是愿意聆听他人的。看到技术团队整体的改变，个人还是挺开心的。\n\n关于技术\n----\n\n今年，推动了 Vue3 项目落地。其实个人的贡献是比较有限的。因为想干掉 IE 的是微软，我们只是顺水推舟而已。\n\n对于明年技术的思考，首先 “**Web Component + 适配器**” 来做 UI 组件开发已经成为主流。如果明年要做更先进的 UI 组件库开发，我也会更推崇这种方式进行构建项目。\n\n另外一个就是“**图像识别输出 HTML**”。这项技术也开始趋向成熟了。\n\n我们如果打败不了他们，就应该加入他们。现在的前端开发人员，其实已经很少写 CSS 了。那我们不如顺应这个趋势，用工具去生成页面。\n\n至于**低代码、无代码**。说到底，也是给我们提供效率的一种方式，我们作为前端开发人员，也不需要排斥。\n\n总结\n--\n\n写到这里，忽然发现，自己心里默默地给上面几个事情排了个序。\n\n也许这就是我，一个中年程序员，对重要的事情排序的真实想法吧。\n\n明天，我就 40 岁了。换个新的开始，过好自己的下半生吧。"
}