{
	"title": "程序员副业|2024年8月复盘",
	"author": "嘟嘟MD",
	"publishTime": "2024-09-04",
	"readTime": "阅读12分钟",
	"tags": "[\"后端\",\"创业\"]",
	"description": "我是嘟嘟MD，一个10年程序员，现在离职创业，8月份结束了，继续做一次复盘，让大家可以近距离看看一个离职程序员都在干什么，大概4000字，有空可以看看~",
	"article": "![必看大字最新消息重磅公众号首图(2) (1).jpg](https://p9-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/2557cd7a86814ef8af74fe2f6ba77795~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.jpg#?w=900&h=383&s=91599&e=jpg&b=64a5ef)\n\n> 本文首发于公众号：[嘟爷创业日记](https://link.juejin.cn?target=https%3A%2F%2Fmp.weixin.qq.com%2Fs%2FCTaABJLGmtbMCc4q9hDZfA \"https://mp.weixin.qq.com/s/CTaABJLGmtbMCc4q9hDZfA\") 。 我已经坚持日更280天+，欢迎过来追剧~\n\n> 大家好，我是嘟嘟MD，一个10年程序员，现在离职创业，有314天了，我每个月都会写一篇总结复盘，让大家可以近距离看看一个离职程序员都在干什么，今天这篇是8月份的总结，大概4000字，略长，有空的可以翻翻，希望对大家有一丢丢的借鉴作用！\n\n一、月度大事\n------\n\n8月份结束了，继续做一次复盘，这个月看了下，我在这个号上写内容的篇幅更少了，感觉有点变懒了，坚持果然比较难啊，我把晚上写公众号的时间都拿去玩黑神话了，在抖音直播。\n\n![image.png](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/f3c66eceba3942e7b113ab93fd2f2039~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=GYgXxBEfSMw8pTMLTl0ENG30JNI%3D)\n\n**1：8月坚持跑步20天，减脂目的达到**\n\n这个月跑了20天，比上个月少了几天，不过这个进度也还行，我的体重大概保持在130-131斤了，挺稳定，算是达标了，后面的话增加一些力量训练，练一下上半身肌肉。本来想早上跑的，但是晚上作息太晚睡觉，早上很难早起，后面大部分时间又变回晚上跑步，这让我有点懊恼，还是想尝试早上去跑步，这个月再试试看能否调整过来。\n\n![图片](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/aae869c6c1a34078973e6e238cefef8c~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=gIxAV86cF0k%2F3xIwLybVZTwciNw%3D)\n\n**2：小红书商广项目**\n\n到目前为止，小红书粉丝5795人，继续朝着万粉进军，不过这个月广告就接了2个，才变现几百块，万粉后好像单价会高一些，不然的话中介群里面报价都是很低了，基本都是150-200以内，所以现在我只好继续先涨粉了，每天发3篇内容进度也调整了下，变成1-2篇了。还有就是感觉这个月接了广告后整体涨粉进度变慢了，才涨了1200多粉，估计是广告发多了，标签变乱了，今天刚在破局看到其他人分享的小红书做AIP的经验，别人是3个月涨粉10万，真是羡慕啊。继续坚持发吧，反正每天投入时间不到1小时，倒是可以坚持住。做的内容还可以发公众号，也不亏。\n\n**3：公众号运营**\n\n这个月主要精力应该是放在AI绘画公众号的运营上，每天投入至少3-4小时，算下了绘画公众号更新了16篇内容，然后B站也发了4-5个教程视频，好的也有几千播放，配套的还有发一些工作流到lib网站，算是把整体流程打通了，目前主要精力也是放在这块，夸克网盘那边也赚了70多，都是靠AI绘画这块模型分享网盘拉新，让我看到了一个新的副业方向，等我后面分享的资料越来越多，这块也算一个积累吧。\n\nliblib上也有发工作流，这个也是可以赚钱的，还没结算，上个月是2号才推送收益信息，回头结算出来了再看看收益，这也是长期积累的一种，虽然现在还没有赚到大钱，让我放下我也不甘心，所以还是继续投入时间钻研，后续提高变现能力。\n\n![图片](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/3c7aead7bb4b43e5929b7a5879a21347~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=wdmLzbvsXokrOMCtgxHFkP4jekA%3D)\n\n另外我七月底放弃的头像公众号，这个月20号又开始更新了，改了个赛道，换成发十二生肖的，原本坚持发了一个月一直没有入池，制作又很花时间我就放弃了。\n\n之所以又拿起来是两个原因，一个是社群里面其他小伙伴的刺激，有几个每天发收益，几十到几百都有，最优秀的一个人十几天都是500-600收益，把大家刺激的不行，他是做文案号的，所以大家最近都鼓足了干劲也要冲一波。\n\n另外就是我一个同事给我发了对标账号过来，我看了下我也可以参考对方做类似的，而且还不花时间，说干就干，大概8月20号开始发，最近发了10几天，我发现开始慢慢入池了，最高的时候有200多播放，这可把我开心坏了，有了正反馈就继续发。\n\n![图片](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/fdb4348078b147c5b2612fb11e2c8511~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=pzoo0WXj5ndDayDnVkcnr5%2BRJoI%3D)\n\n**4：副业社群运营**\n\n这算第8个月吧，目前人数已经增加到243人了，有这么一个社群作为交流我感觉还是很不错的，有时候想摆烂的时候，看到群里大家发的收益截图，就又被刺激到，别人行自己怎么可能不行，所以又支棱起来。\n\n这个月可能这边更新的内容不多，所以过来入群的人也变少了，所以做IP，还是要多写，不断的曝光才有源源不断的流量，这也给我提了个醒。要相信坚持的力量。\n\n今年还剩下4个月，不足半年，所以要入社群的话，我是直接到25年12月31号来算的，费用是199，有做副业兴趣的可以加我聊聊。\n\n**5：直播黑悟空**\n\n这个月最火的应该就是《黑神话：悟空》了吧，我没有第一时间玩，我是第二天才去买的，因为太火爆了，没忍住，然后看到抖音上面有直播活动，我就去报名了，拿了一个老号，有直播权限的就开干，但是嘛，场观人数不行哈哈。\n\n刚才看了下，竟然玩了54小时，平均每天4-5小时，难怪都没空写公众号，都拿去玩游戏了。罪过罪过，但是这游戏真的好玩，手残党用轮椅打法，也玩到第五章了。我还特意去B站创建了个号发黑神话的内容，发了2篇，有一篇也有3000多播放数据。\n\n![图片](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/17abe208604349bc84b23c5e7e34dce8~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=NliI1IPN9Ip1t8bo6Zp3ZUJCG5w%3D)\n\n二、有什么收获\n-------\n\n### 【认知方面】\n\n**1：新人做项目，降低成本很重要**\n\n说这个，其实有2个感悟，一个是自身体会到的，一个是从社群里面看到的。\n\n新人做项目的时候，0-1阶段是最难的，一个是正反馈来的慢，一些人等不到那个时候就放弃了，这时候如果你能降低做这个项目的成本，那你可能坚持的就会长一些，可能就能收到正反馈，这里的成本可以是时间成本，也可以是金钱成本。\n\n我自己那个头像公众号，坚持了1个多月一直没有入池，正反馈很低，人就烦了，因为制作时间成本太高了，在优先级的安排下，每次都放到最后去处理，久而久之我就放弃了，后来改了个赛道，时间成本直接缩小了4倍，每天很快就处理完，反而可以坚持，就算没有正反馈我也没关系，就当顺手做一做。\n\n另外一个金钱成本，是昨天听到群里一个群友说的，报名了一个抖音小店航海，没赚到钱不说，反而亏了5000多，估计憋在心里不好受，大家闲聊的时候才吐露心声，太想赚钱反而亏欠的故事很多，越努力越亏钱，我之前做外卖cps亏了几十万也就是这样，这种真的很打击人，所以后面我的认知里面，就是要做轻资产的副业，我可以投入时间去研究，但是我绝对不做前期需要投入大把金钱的。\n\n每个项目都是可以赚钱的，但是不是每个项目都适合你，执行力都拉满的情况，还是有人赚不到钱。\n\n尊重二八原则，降低预期、降低成本，执行力拉满，才是我们要做的事情。\n\n**2：黄金圈思维**\n\n最近晚上跑步的时候，我都是打开微信读书听书的，最近一直听的是成甲老师的《好好学习》，里面有个黄金圈思维是我很喜欢的，也很受用。\n\n黄金思维圈的最基本应用便是：你遇到每一件事情，首先问“为什么”，也就是，问自己为什么要做这件事。\n\n所谓黄金思维圈，其实是我们认知世界的方式。我们看问题的方式可以分为三个层面——第一个层面是what层面，也就是事情的表象，我们具体做的每一件事；第二个层面是how层面，也就是我们如何实现我们想要做的事情；第三个层面是why层面，也就是我们为什么做这样的事情。\n\n![图片](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/493831479d534e02a5d0e01992672997~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=Fv9ntvPC151Sbv%2BzOxC0yruYlPA%3D)\n\n绝大多数人思考问题的时候，是从what的角度出发，很少有人能够从how的角度去思考问题。而站在why的角度思考问题的人，就少之又少了。\n\n我推荐大家都来学学黄金圈思维，这是很简单但是又很强大的思考方法。\n\n### 【收入方面】\n\n上个月外卖cps少给我提现的那部分这个月可以提了，瞬间让我开心了不少，其他的还是老样子，我目前的最大问题还是收益分散，新投入的还没有形成稳定的收益，这也是我焦虑的地方，只能继续努力啦。\n\n*   1：旧的几个副业稳定收益\n*   2：程序员副业社群\n*   3：小红书广告和朋友圈广告\n*   4：其他一些零散的CPS产品分销收益\n*   5：网盘拉新\n*   6：零散的AI绘画商单变现\n\n### 【技能方面】\n\n**1:ComfyUI深入学习**\n\n这个月大部分还是研究ComfyUI，写文章做视频，不过我发现商单方向我确实没有成体系，我目前做的更多像是技术博主，而不是商业变现方向，昨天看了一篇别人分享的帖子，对方做ComfyUI电商产品方向，就是聚焦做电商场景，每个视频都是迭代这套工作流，一套电商工作流卖999-1200，靠这个也赚了3万+，是我接下来要学习的方向。\n\n**抖音直播学习**\n\n最近因为黑神话又去折腾了下抖音直播，怎么挂商品怎么让视频不卡顿之类的，又重新学了一遍，其实去年刚离职那会我也试过抖音游戏直播，但是嘛也是一窍不通，瞎弄，这次每次玩都开直播，练一下自己直播方向的技能，总之不能白玩。\n\n三、问题\n----\n\n这个月问题也有，继续罗列一下，督促自己改正：\n\n**1：说好的小报童没出来**\n\n本来说好这个月要出至少30篇小报童，但结果是就第一天列了要写的提纲后就丢一边了，连手册申请也是问了下小报童客服就忘了，感觉自己不是很上心，老是把这块内容丢到最后处理，然后会随着日常时间不够就自动延期，很奇怪，明明这块是可以赚钱的，也是我绘画体系里面很重要的一环，今天把问题同步给GPT4，他的答复给了我一些中肯的建议，感觉还不错，9月份就按这个整改看看。\n\n![图片](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/3f86c0460d264b52ba7abb1c91370d36~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Zif5ZifTUQ=:q75.awebp?rk3s=f64ab15b&x-expires=1728433691&x-signature=FZ1q6QGrTWoWW%2FX%2FPulx%2FJI%2FIrc%3D)\n\n**2：个人产品体系也没出来**\n\n做个人商业IP，很重要的一个环节就是按时出摊，这个概念前几天也分享过，就是不管赚没赚到钱，你总要按时出摊，让别人知道你这里卖什么，而不是让别人来问你和猜，受到这点启发，我本来是想好8月份要写一篇飞书文档，把我个人拥有的产品全部整理一篇，然后每个月月初发到朋友圈，让大家都知道我这里有什么服务和产品的，但是我无数次想写，最后都没写，也是匪夷所思。\n\n人有时候就是这样，各种理由，就是不去做正确的事情，然后最后又后悔为啥没早点做，这个问题在我身上挺严重的，这里提出来再刺激自己一下，能不能明天就写出来。\n\n四、下月计划\n------\n\n9月份，我罗列了一下重要的计划：\n\n**1：跑步，养身体**\n\n这个月继续保持跑步第一优先级，目前计划打底18天，然后有几天做一些力量训练，上半身肌肉可以练练了。\n\n**2：AI绘画公众号以及B站视频继续运作**\n\n上个月其实达标了，写了16篇，平均一周4篇了，原本计划是一周3篇，如果能再狠一点，一周5篇不懂行不行。试试看吧，提前把这周要写的素材想好，然后每天4小时开整看看。\n\n**3：《ComfyUI优质工作流100篇》小报童手册出30篇**\n\n这个是上个月欠下没完成的，这个月把目标拆分一下，缩小一些，每天完成很小的目标就行，每天就写一篇简单的，时间利用率再提高一些。\n\n**4：爆文系列研究**\n\n这次有个航海，打算报一下公众号爆文编写的，之前一直苦于没有账号，就没有弄，但是现在感觉这不是借口，想要弄可以找亲戚弄2个号开始写，公众号爆文系列上限其实很高，群友里面也有人出了很好的成绩，所以这次自己也花时间研究一下，认真学习下爆文的写作技巧。\n\n五、总结\n----\n\n上面算是我这个月的一些重要事情的总结，我分享出来也是给大家可以近距离看看一个离职的程序员的日常，有做的不好的地方也有做的可取的地方，我也是个普通人，一直在尝试和挣扎，我写这篇月度总结，是去翻我这个月发的公众号文章，然后提取出来的，不然我早忘记了，以后年度总结也可以回看月度总结，也能提炼！所以，我写的东西务必是要真实，不能自己骗自己！\n\n我是嘟嘟，一个10年全栈程序员，现在离职创业，需要你的三连~"
}