{
	"title": "一个30岁老前端的人生经历（学习+工作+婚姻+孩子），给迷茫的朋友一点激励。",
	"author": "前端小付",
	"publishTime": "2023-12-10",
	"readTime": "阅读9分钟",
	"tags": "[\"前端\"]",
	"description": "我93年的，还差几天就到30周岁生日了。做前端开发大概也有6、7年，算是老前端了。和大家分享一下我的人生经历，与君共勉。",
	"article": "前言\n==\n\n我93年的，还差几天就到30周岁生日。做前端开发大概也有6、7年，算是老前端了。\n\n2023\n====\n\n写作\n--\n\n在掘金看文章已经很多年了，学到了很多东西。今年三月份在掘金写下了第一篇文章，开始的想法是把自己的开发笔记整理一下写成文章，来巩固一下自己的知识，没想到在写文章分享的过程中帮助了很多人，也得到了很多人认可，让我写文章分享的动力也越来越强，基本每周都会写一篇，闲在没事的时候基本都是在构思下一篇文章写什么。希望明年能写更多的文章，帮助更多的人。\n\n写作给我带来了什么\n\n1.  巩固知识。把自己学到的东西，分享出去，印象更深刻了。\n    \n2.  更多的机会。写作过程中，有大厂私信我，给我一些面试机会，这个时候的面试机会还是很宝贵的，不过因为一些原因都拒绝了。\n    \n3.  快乐。很多人私信我说很感谢我分享的东西，让他们学到了很多东西。看到这些感谢的话，自己得到认可，还是很开心的。\n    \n4.  钱。写文章参与掘金的金石计划活动，陆陆续续差不多获得了接近1000的收入，每次拿到钱，带着老婆孩子去吃顿好的，还是不错的。\n    \n\n降薪\n--\n\n今年公司受大环境影响，裁了一部分人，留下来的人也都降薪了。开始有点接受不了，想跑，但是因为是在上海嘉定郊区，附近找不到好的工作，最近的也要1个小时的地铁，并且小孩刚上一年级，上海基本不可能跨区转校，所以打消了换工作的念头，只能在公司了干下去，相信公司会好起来的。\n\n家庭\n--\n\n看了上面肯定有倔友怀疑，30岁小孩怎么能上一年级？不错我大四结的婚，还是奉子成婚，所以早早的有了孩子。\n\n因为自己小时候是留守儿童，不想让自己孩子过留守儿童的生活，所以孩子一直是和我们在一起，记得我刚出来工作的时候，一个月才3500，我老婆全职带孩子，这些薪资刚够花销，生活过的比较拮据，有时候还要靠我父母接济。\n\n现在收入稍微好了一些，但是我们还没有买房子，存款也不多，在别人看来压力可能会有点大，但是我心比较大，平时消费欲望也比较低，对钱不是那么渴望，一家人在一起也是开开心心的，不过还是想给老婆孩子一个自己的家，努力奋斗吧。\n\n孩子今年上一年级了，再上一年级后，作业明显变多了，每天都要写到很晚，看着孩子很累，也没办法，不写好作业，第二天老师就会在群里点名说。\n\n孩子比较调皮，经常在学校里和同学打架，最多的时候，一周被班主任叫了三次家长，有时候是他的错，有时候是别人的错。因为老婆全职在家带孩子，这些都是我老婆处理的，她最近有点焦虑，每天都担惊受怕的，害怕孩子在学校又闯祸，整的我也有点焦虑，工作状态有点差。\n\n关于孩子打架的事，我和老婆猜测可能是学习压力太大了，每天放学回来就开始写作业，一直写到睡觉，平时还有一些兴趣班要上，玩的时间太少了，积累了很多怨气没地方发泄，所以比较暴躁。现在每天放学后先让他玩半个小时再写作业，并且和他多次沟通，告诉他暴力解决问题是不对的，目前稍微好了一些。有这方面经验的兄弟，可以在评论区指点一下。\n\n健康\n--\n\n今年五月份的时候，身体有点不舒服，平时熬夜比较多，人也比较胖，就想着去体检一下，体检结果肝功能有一项转氨酶比正常高三倍，然后到医院做了一次全身体检，抽了9管血，结果还好没啥大问题，可能是脂肪肝导致的转氨酶很高，医生建议要减肥。\n\n因为平时比较忙，没有时间健身，就搞了个自行车上下班骑，公司离家大概5公里左右，上下班每天骑10公里左右，从6月份买车到现在基本没断过，虽然体重没有降下来，但是精神状态和体力好了不少，以前稍微有点运动量，就气喘吁吁全身冒汗，现在好多了。\n\n希望倔友们多注意健康，少熬夜，身体才是最重要的。\n\n2024展望\n======\n\n关于2024，立几个flag吧\n\n1.  最少分享40篇文章\n    \n2.  完善fluxy-admin平台，把前后端低代码平台集成进来，做出一个企业级低代码平台开源出去。\n    \n3.  看react源码，并做个专栏分享。每次面试，被面试官问react底层一些东西的时候，回答的都不是很好，就是因为没有彻底了解底层，所以回答的都很片面，明年一定要把react吃透。今年年初买了卡颂大佬的react设计原理书籍，现在在床头吃灰呢。\n    \n4.  减肥\n    \n\n个人真实经历分享\n========\n\n给大家分享一下我的个人真实经历，与君共勉。\n\n我出生在一个很普通的农村家庭，有点小聪明，但是贪玩，高中三年基本都是看电子书度过，天天上课把手机放在书下面，装作看书，实际上都是在看小说，现在回想起来，想不通老师为啥重来没有发现过。\n\n开始决定好好学习是高三上学期，有次上课和同桌说话，被老师说你自己不学，不要影响别人学习，还说了一些很难听的话（当时我在班里大概倒数10几名的样子，同桌10几名左右。），虽然我贪玩，但是我自尊心比较强，我就不服气，然后上课开始好好听课，后面一次月考竟然考到了10几名，和同桌成绩差不多，然后就开始飘了，上课又开始看小说，下次月考又考的很差，然后难受，又开始好好听课，就这样成绩一会好一会坏，不过拿了几次进步奖，同学笑话我是不是为了拿进去奖，故意退步的。\n\n真正让我决定好好学习的是高三下学期开学的前一天晚上，我家庭条件不是特别好，而我当时因为中考考的很差，只能上一个学费比较贵的私立高中，高三下学期开学前一天晚上我爸还在为我筹学费（家里没有穷到付不起学费的地步，只是当前家里钱被其他地方占用了，拿不出来。），最终从亲戚那里借了点钱，然后我爸把钱交到我手里，让我明天交学费，看着我爸粗糙的手（我爸是干工地的），这一刻我决定好好学习，不然都对不起这学费。高三下学期上课就没看过手机了，由于底子太差，高考离二本线差了几分，最终上了个三本。\n\n高考结束，暑假期间迷上了英雄联盟。大学的时候，室友也玩，经常和室友一块包夜，第二天要么旷课在宿舍睡觉，要么在教室最后一排睡觉，导致第一学期就挂了三科，不过后面补考都过了。后面还是继续玩，大二下学期突然觉得不能这样浑浑噩噩了，还不如出去打工，给家里省点学费还能挣点钱（不知道当时为啥有这想法），然后就和父母说了一下，不上学了出去打工，当时是想退学的，还好我好朋友和我说先休学吧，以后后悔还有机会。\n\n在苏州找了一个工厂，干了一个星期干不下去了，身体上的劳累倒是其次，主要是看不到生活的希望，每天就像一个机器一样，后面就回去上学了，然后学习非常努力，后面还得了奖学金，毕业论文也被评上了优秀论文，也是优秀毕业生，但是毕业学校没有给学位证，只给了毕业证，因为挂科超过5门（补考过了也没用，只要挂科超过5门，就完了，我们那一届有不少没有学位证的。），这个政策最开始都不知道，没有学位证后问学校，学校才说的，也不能怨学校，算是自食其果吧。没有学位证对找工作还是有很大影响的，后面有几次面试通过大厂了，因为没有学位证而被拒。\n\n实习的时候，实习单位和学校是有合作的，学校知道我的事迹也知道我在实习单位表现的不错，所以就邀请我回去给学弟学妹们分享我的经历。当时分享完后，有几个学弟加我微信说，他们现在也是这个状态，我的经历让他们有了重新开始的信心。\n\n后面的工作之旅也是一路坎坷，不过最后的结果是好的，目前在公司里做前端负责人，收入还不错。工作之旅明年年终总结再和大家分享吧。\n\n和大家分享我的经历，就是想告诉大家永远不要放弃，只要坚持，就会有希望，同时也想告诉大家每个人都要为自己做过的事负责，因为贪玩我没考上好一点的大学，因为贪玩我没有学位证，但是我后面迷途知返，通过自己的努力，还是得到了一份不错的工作，一个美满的家庭。\n\n最后\n==\n\n很喜欢deft在夺冠时说的一句话：我唯一会的仅剩英雄联盟，如果在这条路上我不能成功，那我的人生将没有任何意义。\n\n而我唯一会的就是写代码，我不一定能成功，但是我想努力做到更好。"
}