{
	"title": "电话背调，我给他打了8分",
	"author": "程序新视界",
	"publishTime": "2023-08-12",
	"readTime": "阅读5分钟",
	"tags": "[\"面试\",\"求职\"]",
	"description": "前段时间招聘的一位开发，待了两三周，拿到了京东的offer，离职了。在离职的后一天，接到了他新公司的背调电话，几乎每项都给他打了8分。这个分数打的有点虚，单纯只是为了不影响他下家的入职。离职之前，收",
	"article": "前段时间招聘的一位开发，待了两三周，拿到了京东的offer，离职了。在离职的后一天，接到了他新公司的背调电话，几乎每项都给他打了8分。这个分数打的有点虚，单纯只是为了不影响他下家的入职。\n\n离职之前，收到他在飞书上查看电话号码的消息，大概也猜到是在填写背调人信息，但自始至终，他也没打一声招呼，让给个好评。\n\n离职最后一天，办完手续，没跟任何人打一个招呼，不知什么时候就消失了。\n\n当初他刚入职一周时，其实大家都已经看出他在沟通上有很大问题，还想着如何对他有针对性的安排工作和调整，发挥他的长处，避免他的短处。但没想到这么快就离职了。在他提离职时，虽没过多挽留，但给了一些过来人的建议，很明显也听不进去。\n\n站在旁观者的角度来看，他的职业生涯或即将面临到的事几乎能看得清清楚楚，但他有自己的坚持，别人是没办法的。\n\n就着这事，聊聊最近对职场上关于沟通的一些思考：\n\n**第一，忌固执己见**\n\n职场中最怕遇到的一种人就是固执己见的人。大多数聪明人，在遇到固执己见的人时，基本上都会在三言两语之后停止与其争辩。因为，人一旦在自己的思维层次形成思维闭环，是很难被说服的。\n\n而对于固执己见的人，失去的是新的思维、新的思想、纠错学习的机会，甚至是贵人的相助。试想一下，本来别人好像给你提建议，指出一条更好的路，结果换来的是争辩，是抬杠，聪明人都会敬而远之，然后默默地在旁边看着你掉坑里。\n\n真正牛的人，基本上都是兼听则明，在获得各类信息、建议之后，综合分析，为己所用。\n\n**第二，不必说服，尊重就好**\n\n站在另外一个方面，如果一件事与己无关，别人有不同的意见，或者这事本身就是别人负责，那么尊重就好，不必强行说服对方，不必表现自己。\n\n曾看到两个都很有想法的人，为一件事争论好几天，谁也无法说服谁。一方想用权力压另一方，另一方也不care，把简单的事情激化，急赤白脸的。\n\n其实争论的核心只是展现形式不同而已，最终只是在争情绪、争控制感、争存在感而已，大可不必。\n\n对于成年人，想说服谁都非常难的。而工作中的事，本身就没有对错，只有优劣，大多数时候试一下就知道了。\n\n有句话说的非常好，“成年人的世界只做筛选，不做教育”。如果说还能做点什么，那就是潜移默化的影响别人而已。\n\n**第三，不懂的领域多听少说**\n\n如果自己对一个领域不懂，最好少发表意见，多虚心学习、请教即可。任正非辞退写《万言书》的员工的底层逻辑就是这个，不懂，不了解情况，还草率提建议，只是哗众取宠、浪费别人时间。\n\n如果你不懂一个领域，没有丰富的背景知识和基础理论支撑，在与别人沟通的过程中，强行提建议，不仅露怯，还会惹人烦。即便是懂，也需要先听听别人的看法和视角解读。\n\n站在另一个角度，如果一个不懂的人来挑战你的权威，质疑你的决定，笑一笑就好，不必与其争辩。\n\n郭德纲的一段相声说的好：如果你跟火箭专家说，发射火箭得先抱一捆柴，然后用打火机把柴点着，发射火箭。如果火箭专家看你一眼，就算他输。\n\n**第四，没事多夸夸别人**\n\n在新公司，学到的最牛的一招就是夸人。之前大略知道夸人的效果，但没有太多的去实践。而在新公司，团队中的几个大佬，身体力行的在夸人。\n\n当你完成一件事时，夸“XXX，真牛逼！”，当你解决一个问题时，夸“还得是XXX，不亏是这块的专家”。总之，每当别人有好的表现时，总是伴随着夸赞和正面响应。于是整个团队的氛围就非常好。\n\n这事本身也不需要花费什么成本，就是随口一句话的事，而效果却非常棒。与懂得“人捧人，互相成就彼此，和气生财”的人相处，是一种非常愉悦的体验。\n\n前两天看到一条视频，一位六七岁的小姑娘指派正在玩游戏的父亲去做饭，父亲答应了。她妈妈问：你是怎么做到的？她说：夸他呀。\n\n看看，这么小的小孩儿都深谙的人性，我们很多成人却不懂，或不愿。曾经以为开玩笑很好，现在发现“夸”才是利器，同时一定不要开贬低性的玩笑。\n\n其实，职场中还有很多基本的沟通规则，比如：分清无效沟通并且及时终止谈话、适当示弱、认真倾听，积极反馈、少用反问等等。\n\n当你留意和思考这些成型的规则时，你会发现它们都是基于社会学和心理学的外在呈现。很有意思，也很有用。"
}