{
	"title": "30岁，我开启了人生副业",
	"author": "白哥学前端",
	"publishTime": "2024-06-06",
	"readTime": "阅读6分钟",
	"tags": "[\"创业\",\"前端\"]",
	"description": "大家好，我是朽木白，一名非常普通的前端程序员，在前端这条路上淌七年的浑水，毫无建树。曾经我的年薪也达到过46w，后来在互联网泡沫的末法时代，不得已换了一份工作，自降6k去了一家教育公司",
	"article": "大家好，我是`朽木白`，一名非常普通的前端程序员，在前端这条路上淌七年的浑水，毫无建树。在互联网泡沫的末法时代，不得已换了一份工作，自降6k去了一家教育公司，由于个人原因，在今年的三月份我决定辞职。当时辞职后的第一想法是再换个公司继续干前端，正好是金三银四，可能行情好一点。很显然，现实给了我狠狠的一个大逼兜。在我辞职之前，我粉丝群的500个道友们都劝我苟住，不要任性，我没听劝，非要看看怎么个事。准备好了面试题，写好了简历，开始投递，结果一投一个不吱声。要么是未读，要么是已读不回，要么是不合适（岗位是资深、专家、架构师），唯一回复的都是外包，薪资只有十几k，心高气傲的我也是一口回绝。找了半个月，心气彻底凉了。这时候我想着打工已经不是很好的选择了，心里落差很大，于是决定创业。\n\n在之前，我也在创业的路上进行过尝试。主要是面试辅导。在职的时候我就给粉丝修改简历，辅导面试，因此也收获了很多粉丝，大家给面子，都亲切的叫一声`白哥`。至于现在为什么放弃了呢？当时白天上班，抽空给粉丝看看简历，晚上回家腾讯会议一对一的指导如何修改简历，并且一直都是免费的。后面我又在某音开直播，在直播间连线粉丝，有任何问题都可以问的那种。还有一个收费的就是面试辅导，针对每个人不同的情况进行辅导，给他们指导项目，修改简历，每天晚上讲解面试题，划重点，面试复盘等等。如果不在公司加班（加班一般都是11点才能下班，到家都12点多了），晚上回家的任务就是看简历，辅导学员。因为当时全部都是我自己一个人干，没有任何团队，也没有和任何人合作过，也没有接过任何第三方广告。干了一个月，我遭不住了，身心疲惫。除了收获了一批忠实的粉丝，钱基本没有挣到多少。这时候我已经陷入了一种困境和迷茫的状态。我到底要不要继续坚持下去，我的这种付出到底能给我带来啥，更多的是给我带来的一些焦虑和内耗，尤其是一些粉丝找工作的现状，惨不忍睹，我看着也跟着心急。后来我就索性不干了，在群里活跃气氛，跟大家扯扯皮，聊聊八卦（我摆烂了），创业宣告失败。\n\n接下来就是第二次创业了，在失业的这两月当中，我合伙跟别人开了一家眼镜店，目前已经正常运营。因为我媳妇是内行，所以开起来非常的顺利。我的身份也从一名前端程序员转变成了一名眼镜从业人员。跨度非常大，因为此前我从未接触过这个行业。简单讲讲开店的过程吧。涉及到金额方面的我就不提了。\n\n第一选开店的地址，在北京的这四九城里转悠了一周多，看了好多地方，地段有好有坏，房租有高有低。我选择店铺的依据根据这几个方面来，交通方便，周围上班族、学校多，人流大，周围2KM没有同行，租金一万左右的底商为主。最终我选择了靠近霍营地铁站的一个商铺，距离不过500m。\n\n![image.png](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/3649f440c6e540cebb680cf753b94a60~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=2252&h=1130&s=531288&e=png&b=e5edf5)\n\n第二店铺装修，找熟人，省了不少钱。装修也是要考虑很多，眼镜柜的各种尺寸要测量标准，因为上面要加装玻璃柜，严丝合缝，不能有偏差。还有柜台的设计，各个机器的摆放要合理的腾出位置，因为店铺的面积不是很大，空间要合理利用起来。还有其他的一些柜子，眼镜的摆放等等都是有学问的，没有经验的人来根本干不了一点。 这是装修完完刚收拾的样子\n\n![image.png](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/8ec152c69ee54340bd2bb396301a8d7a~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=1080&h=1920&s=321495&e=jpg&b=878674) 这是柜台\n\n![image.png](https://p6-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/0a1ebb0f69a6481aba6840a1305600b9~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=4032&h=2268&s=2029819&e=jpg&b=c8c7bf)\n\n第三进货，货主要有三种，镜片，镜框，仪器。这些都是在潘家园眼镜城那边有厂家可以拿货。因为我媳妇之前是开店的，她有认识的人脉资源，进货的时候都是她带着去挑。进货花钱是大头，尤其是那些机器，更先进了，也更贵了。机器会有专门的安装人员上门安装调试。眼镜摆好了，机器调试好了，差不多就可以开业，我的店是`05.17`正式开业的，在没有开业之前就已经有人来配眼镜了，所以我开业提前了几天。 开业了\n\n![image.png](https://p1-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/66699ff5fba846b8a2782da676a79b3a~tplv-k3u1fbpfcp-jj-mark:3024:0:0:0:q75.awebp#?w=2183&h=2295&s=4692801&e=jpg&b=1253ea)\n\n现在开了差不多半个多月了，差不多每天都能开张，时不时也能来个大单，虽然没有我上班每个月挣的多了，但是没有那么累了，因为眼镜店一天人流量没那么大，一天能进店五六个人就够了，所以我有很多时间干自己想干的事情，比如拍拍短视频，写写技术文章，学学自己之前没有来得及学的技术，我依然热爱代码。当然开眼镜店最重要的是为顾客配一副戴着舒适的眼镜，人家才会信任你，帮你带新，回购，因为眼镜这个东西很多人一旦配了一次很舒服的，下次就认准你了，别的店他不信任。\n\n希望我的这个店能一直开下去，红红火火，也许哪一天有好的机会我还会选择继续去干前端，我现在每天没事也会看看招聘软件，看看现在的行情。\n\n> 如果你也正在找工作，我有个渡劫群，作者目前有两个渡劫群，一群500人，二群160人，如果你也在渡劫，可以加我wx：`xiumubai01`（朽木白，是不是很好记），无需验证，私信`加群`即可，我拉你进群，一起交流，感受一下现在的死亡渡劫场面。\n\n> *   想看白哥最新面试进展的可以移步[juejin.cn/post/738541…](https://juejin.cn/post/7385410225828544512 \"https://juejin.cn/post/7385410225828544512\")\n>     \n> *   更多后续请看这里：[juejin.cn/post/741325…](https://juejin.cn/post/7413255139890315299 \"https://juejin.cn/post/7413255139890315299\")\n>"
}