{
	"title": "阶层必然会分化，但维度不只有金钱",
	"author": "东东拿铁",
	"publishTime": "2024-08-23",
	"readTime": "阅读13分钟",
	"tags": "[\"程序员\"]",
	"description": "先问大家一个问题，如果阶层分化是必然的，你还会有玩下去人生这个“无限游戏”的动力吗？让我们从一个游戏说起。",
	"article": "前言\n--\n\nHi 你好，我是东东拿铁，一个在“玩游戏”的后端程序员。\n\n先问大家一个问题，如果阶层分化是必然的，你还会有玩下去人生这个“无限游戏”的动力吗？\n\n让我们从一个游戏说起。\n\n1996年，通过计算机建模理解社会演化的思潮在学术界正兴，美国布鲁金斯学会的艾伯斯坦和阿克斯特尔设计了一个关于财富分配的游戏，命名为“糖人世界”(Sugarscape)。 ![](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/348cfcaed81a40718d2f1434ef6f1616~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Lic5Lic5ou_6ZOB:q75.awebp?rk3s=f64ab15b&x-expires=1728598643&x-signature=jaUx2I1OeGfN%2FyqFKlH5JZOd9wI%3D)\n\n他们设计出一个模拟的地形图，深色区域含糖量高，浅色区域含糖量少，而白色区域则不产糖，对应资源富裕区、有限区、贫困区和沙漠区。\n\n糖在被吃掉以后过一段时间会再长出来。然后他们会随机丢一些小糖人上去——这些小糖人遵循几个简单规则：\n\n1.  看四周6个方格，找到含糖量最高的区域，移动过去吃糖；\n2.  每天会消耗一定的糖（新陈代谢），如果消耗大于产出，则会死掉出局；\n3.  每个糖人的天赋、视力和新陈代谢是随机的。有人天生视力好，别人看1格，自己看4格，比较占优势；有人则比别人消耗少，别人每天消耗2格，他只要1格，可理解为体力好。还有一些天生富二代，携带更多糖出生。\n\n一开始的时候，大家都差不多，最富裕的24个人有10块糖；但跑着跑着，不均衡开始出现。在第189回合以后，贫富差距出现了，最富裕的2人有225块糖，而有131个人只有1块。\n\n![](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/d8226405b8784c508acb7eb313c7e8ec~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Lic5Lic5ou_6ZOB:q75.awebp?rk3s=f64ab15b&x-expires=1728598643&x-signature=2bupTK%2B%2FIzYgw1jIrQu0iWxfsAw%3D) 注：横轴为财富数，纵轴为人数。\n\n具体细节大家可以自行了解，但游戏告诉我们一个结论：在一个流动、开放的社会里，**阶层分化**是稳定且可预期的。\n\n**游戏如此，现实世界也如此。**\n\n阶级分化\n----\n\n我看过一部分书，比如《皮囊》、《活着》、《许三观卖血记》、《兄弟》，也听过很多耳熟能详的作品比如《平凡的世界》、《人世间》，我特别喜欢类似的作品。\n\n虽然自己出生在城市，生活的时代早已和历史上的时代有所不同，也不需要为物质、精神需求所忧虑，但在某些时候，却又能感同身受。\n\n因为这些优秀的作品背后有一个共性，就是关注普通人的生活与命运。\n\n投射现实，我们大概率属于拥有更少糖的那部分小糖人。\n\n比如，出生时拥有的糖不够多，又或者生在离糖山更远的地方。\n\n当然，现实生活比游戏复杂的多，但我们能做的事情，也比小糖人能做的多。\n\n比如\n\n*   小糖人无法学习，我们可以\n*   小糖人走到糖山，需要走很多步，但是我们有网络，交通工具\n*   游戏中的糖山，是不会移动的，但是我们时代和机会是在不断变化的\n\n**所以，阶层固化是必然的，但是个体的命运却不是。**\n\n阶级分化，到底是分化了什么。\n\n我之前肤浅的认为，阶级分化，无非就是财富的分化。\n\n我有一个很有钱的阿姨，她的女儿比我小一些，之前一起吃饭的时候，聊起买衣服的话题。有一个服装品牌叫“优衣库”，大家应该都听过。经济实惠，质量虽然赶不上大品牌，但也还可以，我现在去商场也会习惯性的去优衣库逛逛。\n\n有一次一起吃饭，我记着我们聊到优衣库的时候，她面露难色的说了一句：“优衣库的衣服能穿吗。”\n\n毕竟平常接触到的非常有钱的人的机会不多，即使十年过去了，这件事给正在上学的我留下的印象非常深刻。\n\n毕竟我们就是要让一部分人先富起来，先富带动后富，所以分化就是财富的分化。\n\n心智\n--\n\n最近在看古典老师的书《跃迁》，这本书里举的一个例子，让我对分化，有了不一样的看法。\n\n原文如下：\n\n> 我在当GRE老师的时候，曾经教过收费很高的一对一英语私教班，学生家长一般分成两种：一种是真的很有钱，不在乎钱的家长；有一些则是收入中等，希望孩子有出息，一咬牙花大价钱的家长。对于前者，我倾尽全力让自己对得起这个价格；对于后者，我则更加苦口婆心，小心谨慎，偶尔还开个小灶，我知道这些钱对这个家庭意味着什么。\n> \n> 每次，我都会跟接孩子的家长聊聊孩子的学习进度。我会说“你们家孩子词汇量还不够，要把这6000词汇尽快背完，然后阅读分才会好。”这个时候，我经常收到两种回答。那些中产阶层家庭的家长会说：“听到没有！要听古典老师的话！回去好好背，好不好？”孩子温顺地点头。而有些真正聪明的家长则会笑着说：“古典老师，我们家孩子就是不爱背单词，但是他喜欢阅读。我们进度不需要那么赶，你能不能陪他多读点儿有趣的英文书？”后面这种回答，震撼了我。\n\n这段描述给我了非常大的冲击，毕竟教育是每一个人都会经历的，我不禁回忆起了我上学的时候，想想看，如果当我们遇到单词量不够的时候，父母怎么面对这个问题，我们又是如何面对这个问题呢？\n\n无论是初中、高中、还是大学，在我想提高单词量的时候，我会选择打开常用词汇的小册子，打开当时很流行的什么“百词斩”等app，开始背单词。\n\n父母应该会问，单词背的怎么样了，老师布置的任务都完成了吗？\n\n所以最后我印象最深的词汇就是“abandon”。\n\n我从初中开始便开始住校，直到大学毕业，住校的时间足足有十年。初中、高中寄宿制的生活，接受的是军事化、填鸭式的教育，我们只管上课、做题，如果你表示不满，老师就会让你去操场跑几圈。\n\n直到近几年我才明白，我才知道住校期间的那段学习，有多么的低效。\n\n现在我也当了父亲，有了孩子后，我时常在考虑，相比于我们这一代的放养式教育，我应该如何把我学会的技巧、方法和道理传递给孩子，让他更高效的成长。\n\n比如我教会他100种背单词的技巧，告诉他艾宾浩斯遗忘曲线记忆法？还是便利贴贴满冰箱让他实时看到，利用碎片化时间记忆？还是让他像我一样借助一些APP辅助记忆？\n\n在我眼里这些技巧确实是对的，也都是有一定效果的，但是孩子真的能够听进去，学会这些吗？我总是感觉到，这并不是父母能做到最好的。\n\n我之前肤浅的认为，阶级分化，无非就是财富的分化，毕竟我们就是要让一部分人先富起来，带动后富，所以分化的就是分化的财富。\n\n而古典老师的这个例子，让我看到了不同阶级的家庭，对于背单词这件事情不一样的选择。\n\n前者，被动接受，按部就班，最后成长成为一个优秀的员工。\n\n后者，主动选择，试图寻找最高效的方式，创造一些传统教育教不会的学习思维。\n\n父母在做，孩子在看。\n\n教育与学习，不同家庭会有如此大的差异，那么个人成长呢，工作、甚至人生选择呢，不同的思维又会对我们产生多大的影响呢？\n\n看到这里，你是否对阶级分化有了不一样的看法，我发现分化的不仅是财富，还有**心智**。\n\n影响心智的因素\n-------\n\n是什么导致了心智的分化？看了许多书，也看过很多大佬给出的建议和方法，我想从两个方面来聊聊，一个是自控力，一个是思维带宽。\n\n### 自控力\n\n先从自控力说起，自控力是什么，《自控力》中是这样定义的：\n\n> 自控力是控制自己的注意力、情绪和欲望的能力，由 “我要做”“我不要”“我想要” 这三种力量组成。\n> \n> 我要做：是为了更好的未来做自己不喜欢的事情的能力，比如坚持学习、完成工作任务等；\n> \n> 我不要：是即使面对诱惑也能说 “不” 的能力，像抵制美食、视频的诱惑等；\n> \n> 我想要：是记住自己真正想要的东西的能力，它能让我们在面对短期诱惑时，不忘长期目标。\n\n你如果白天面临较多需要自控的事情，比如美食、工作、阅读等，下班回到家一旦自控力耗尽，就很容易放纵，开始打游戏、刷视频。\n\n一次放纵对于富人来说也许不算是损失，对于穷人来说则会浪费很多宝贵的机会。\n\n普通人并非不懂得延迟满足，只是他们对自己延迟满足的肌肉的操控力，早就被诱惑消耗得所剩无几。\n\n> 刚刚在我写着这篇文章，不自觉地拿起了手机刷小红书，幸亏写的是这个主题，我及时的意识到又把我拉了回来。\n\n但是，《自控力》书中还提到了“自控力肌肉”这个概念，的角度解释过这个问题。自控力如肌肉，用多了会疲劳。\n\n说一个最近的例子，上周孩子睡觉一直很晚，几乎要到晚上十点多才能入睡，为了保证阅读时间，晚上收拾完看书，睡觉的时候几乎都在十二点以后了。\n\n但实际上，我能够看书的时间依然很少，我总会用“我都这么晚看书了，不如先放松一下”的心态，开始去刷视频或者一些别的东西，然而回过神来，一个小时就过去了。\n\n### 思维带宽\n\n《稀缺》这本书中提出了“**思维带宽**”的概念，思维带宽是指心智的容量，它由认知能力和执行控制力构成。\n\n当你处于稀缺状态时，无论是时间稀缺、金钱稀缺还是其他资源稀缺，你的注意力会高度集中在稀缺的事物上，这就导致心智容量被过度占据。\n\n这种情况下，你用于处理其他事务的认知能力和执行控制力就会减弱。\n\n例如，普通人可能会因过于关注当下的金钱问题，而在做决策时忽视了对未来的投资和规划；工作忙碌的人可能因专注于眼前的紧急任务，而忽略了重要但不紧急的事情，如锻炼身体、陪伴家人等。\n\n如果总想着怎么换个大房子，怎么换个好车子，哪里有时间思考什么个人发展、儿女教育呢？发展战略显然才是核心。如果说贫穷是一种“思维带宽”的稀缺，注意力资源就变得非常重要，提升认知时大部分都是反人性的，需要巨大的带宽。\n\n所以，如果你注意力稀缺，即使你知道要做些什么，也会陷入战术勤奋、战略懒惰的困局。\n\n在《贫穷的本质》这本书里，作者阿比吉特和埃斯特观察到很多捐赠者的本意，是希望穷人将捐款用在教育、健康上，实际却往往被花在了消费品、奢侈品上，因为穷人和富人处于不同的自控力和心智资源层面。\n\n如果把这种根据社会学尺度观察到的贫富现象平移到我们身边，就会发现，其实贫穷早就不是一个财富数字，而是一种稀缺的心理状态。\n\n### 正视自控力，提升思维带宽\n\n幸运的是，上面的两种能力，都是可以通过训练来提升的。\n\n对于**自控力**，我们可以通过如下方式训练我们的自控力肌肉：\n\n1.  训练大脑，比如冥想、深呼吸等方式\n2.  调整生活方式，比如充足的睡眠、健康的饮食、充足的锻炼\n3.  改变思维方式，比如接纳自己的情绪，而不是压抑。养成成长型思维等\n\n甚至，我们还可以借助一些工具，比如Flora等。\n\n![image.png](https://p6-xtjj-sign.byteimg.com/tos-cn-i-73owjymdk6/efeba85ec76943fcb04f83d3330fed9e~tplv-73owjymdk6-jj-mark-v1:0:0:0:0:5o6Y6YeR5oqA5pyv56S-5Yy6IEAg5Lic5Lic5ou_6ZOB:q75.awebp?rk3s=f64ab15b&x-expires=1728598643&x-signature=xC3ujYNSMaF4k4Q9K7UIbkx8I54%3D) 对于**思维带宽**，我们也有不少方法，避免稀缺，提升我们的思维带宽\n\n1.  进行时间规划，避免紧急重要的任务投入太多时间。对重要不紧急的事情，每周固定留出一部分时间，避免因为时间带来的负担\n2.  对于支出制定预算，明确收支范围，避免因为财务紧张陷入金钱稀缺的状态\n3.  学会留白，拒绝不重要的活动、聚会，而是什么都不做，让自己自由思考、放松等，或者是拒绝一份996的工作\n4.  培养正确的认知，认识到稀缺对于我们心态的影响，当真的面临时间、金钱的压力时，提醒自己不要陷入狭隘的视角，从更广阔的角度去看问题\n\n方法很多，就不一一列举了。\n\n说在最后\n----\n\n好了，文章到这里就要结束了，感谢你能看到最后。\n\n从看到小糖人游戏带给我的结论时，我先是感到无奈与不甘，因为这个结论，对于一个普通人来说，实在是太让人失望了。\n\n洋洋洒洒这么多，还是想给自己泼一盆冷水，那便是我们即使不断的提升我们的心智，我们大大大概率也不能够拥有完全足够的财富。\n\n我只能说，通过心智的不断提升，即使财富无法追上那20%的人们，也可以在思维、心智上完成跃迁。只有这样，财富或许才会到来。\n\n因为相信，所以看见，让我们继续玩人生这个无限游戏吧。\n\n如果你有收获，欢迎在评论区和我分享，也希望你点赞、评论、收藏，这对我来说真的很重要。也欢迎你加我的wx：Ldhrlhy10，一起交流～\n\n本篇文章是第49篇原创文章，2024目标进度49/100，欢迎围观。"
}