{
	"title": "TVP新书上架  融合：产业数字化转型的十大关键技术",
	"author": "腾讯云开发者",
	"publishTime": "2023-06-28",
	"readTime": "阅读10分钟",
	"tags": "[\"程序员\",\"前端框架中文技术社区\",\"前端开发社区\",\"前端技术交流\",\"前端框架教程\",\"JavaScript 学习资源\",\"CSS 技巧与最佳实践\",\"HTML5 最新动态\",\"前端工程师职业发展\",\"开源前端项目\",\"前端技术趋势\"]",
	"description": "新书速递 近期，在腾讯云 TVP 联合出书计划中，腾讯云 TVP 山金孝老师推出了新书《融合：产业数字化转型的十大关键技术》。",
	"article": "**新书速递**\n--------\n\n近期，在腾讯云 TVP 联合出书计划中，腾讯云 TVP 山金孝老师推出了新书《融合：产业数字化转型的十大关键技术》。\n\n![](/images/jueJin/8a93a4ecc08043c.png)\n\n《融合：产业数字化转型的十大关键技术》\n\n作者：山金孝 李琦\n\n中译出版社\n\n**内容简介**\n--------\n\n数字经济已成为高质量发展的新引擎，数字化变革已成为转型发展的新动能，数字经济的蓬勃发展将在整体经济复苏中扮演重要角色。在数字经济发展中，技术革新是不容忽视的重要力量。5G、大数据、云原生技术、人工智能等数字技术广泛并深度应用于经济社会各领域，逐渐在助推千行百业数字化转型中发挥着关键性作用，将在带动传统工业体系变革、引领技术产业换道超车、打造我国经济新增长点等方面持续释放价值。\n\n本书从传统产业数字化转型角度出发，以数字科技赋能产业数字化和数字技术与实体产业的深度融合为核心主旨，对与产业数字化密切相关的十大数字技术进行了深入的认知分析和实现路径的详细介绍，内容深入浅出、系统全面，理论认知与实践路径相结合，是一本适合不同层次、不同需求，兼顾传统产业和数字原生企业，以及产业数字化转型和数字技术研究领域读者的技术哲思录和枕边书。\n\n**作者简介**\n--------\n\n山金孝，腾讯云 TVP，硕士研究生，现为招商局集团数字化中心技术管理处处长，资深云计算专家、技术架构师，招商局集团数字技术平台架构规划及建设主要负责人，集团技术架构管理主要负责人。中国移动通信联合会元宇宙产业委常务委员，中国信通院数字化发展共建共享平台专家委员会委员，中国信通院云边协同产业发展“领航人物”。多年来，一直从事数字技术的研究与应用实践相关工作，是前沿数字技术的推广者与布道者，数实融合产业转型发展理念的一线实践者，产业数字化领域资深技术专家。著有《OpenShift 云原生架构：原理与实践》《企业私有云建设指南》《OpenStack 高可用集群：原理与架构》《OpenStack 高可用集群：部署与运维》等书籍，拥有 10 余项云计算相关发明专利，发表多篇数字技术相关论文。\n\n李琦，博士研究生，现为招商局集团数字化中心副主任，资深产业数字化转型专家，大型多元化传统企业数字化转型专家。国资委国资监管和中央企业信息化专家组专家，大湾区中央企业数字化协同创新联盟副理事长，信通院数字化发展共建共享平台副理事长，深圳CIO协会副会长。招商局集团数字化转型战略制定主要参与者，招商局集团数字化战略主要推动者和管理者，统筹规划并参与设计、制定了招商局集团数字化转型战略路线，主导建设了招商局集团共享数字化基础设施、统管数字化应用平台，以及集团产业板块的数字化转型工作。长期从事传统产业数字化转型建设及管理工作，对数字技术赋能传统产业转型升级有深入研究与实践，是产业数字化领域的资深专家与管理者。\n\n**序言导读**\n--------\n\n腾讯集团高级执行副总裁、云与智慧产业事业群 CEO 汤道生 作序推荐\n\n近年来，我国加速经济换挡升级，以创新引领发展，培育经济新动能。产业经济要素面临与此前截然不同的现实环境：全球化竞争加剧，只有持续创新才能应对市场变化；中国实体经济正在从“高速度增长”转向“高质量发展”；产业体系向更高品质、更高效率的产出转变。\n\n我们看到，产业互联网已经从新兴概念快速演变为普遍共识，数实融合的趋势持续强劲，产业升级的方法和路径也与过往全然不同。在社会层面，新技术、新应用为增加国民收入、提升生活幸福感和便利度发挥了巨大作用。在企业层面，更多的企业愿意用数字技术“度量”与“优化”生产流程，降本提质增效；用数字化工具“连接”产业链上下游，以大数据洞察机会，以人工智能改造生产模式，捕捉和挖掘市场需求。而具备行业先发优势和锐意进取的行业领军者，则再次肩负起践行数字变革、引领产业升级的重任。\n\n一年多以前，我参加了招商局妈湾智慧港的开港仪式。现场一名岸桥司机，坐在办公室里，通过智能操作中心，远程就可以操作岸桥，将集装箱精准装载到无人集卡上，顺利运到堆场。这个场景令我印象深刻，让我对数实融合的未来充满期待，也对招商局集团在前沿数字技术领域的创新应用充满敬意。\n\n腾讯和招商局集团的合作始于 2017 年，随后双方在多个业务板块，共同探索数字技术和实体产业相融合的创新实践，深化产业场景，挖掘新价值与新机会，取得丰硕成果，也很好地诠释了数实融合的内涵。例如，我们联袂打造出央企首个信创区块链平台，共建物流联盟链，通过区块链技术的应用，极大提升了粤港澳大湾区集装箱的流转效率；招商蛇口引入数字营销技术与企业微信为一线城市的销售拓展赋能，销量在全球公共卫生事件爆发期间逆势增长；招商轮船采用成熟的线上展会方案，让线上世界航商大会成为行业最大规模的展会。\n\n着眼未来，数实融合的序幕刚刚开启，路漫漫其修远兮；时间是优秀企业的朋友，机会总是留给长期主义的坚守者。在招商局集团，我们已经看到更多领先技术在渐次落地，生根发芽；更多创新场景在渐次展开，纵深演进。回顾招商局集团 150 多年的商业历程，创新与变革一直是招商局基业长青的基因。\n\n招商局的智能化创新之路，也印证了数字技术的产业价值。如果把数字化企业视作一个有机生命体，那么数字技术始终是牵引肌体有效运转的神经中枢，支撑肌体向前行走的坚实骨架。由招商局集团数字化中心技术专家撰写的这本专著，以数实融合背景下的产业数字化为出发点，以自身多年的数字化转型建设和实践经验为基础，对产业数字化所必需的各项数字技术进行了深入的理论认知分析、架构设计讲解和实践路径介绍，抽象并构建了行业领先的数字化企业应具备的数字技术认知体系和建设框架，对于产业数字化，尤其是传统企业的数字化建设，具有重要的指导和参考意义。更难能可贵的是，这本书还梳理和总结了“数字化招商局”的一系列数字化实践和成果，是一本真正来自一线大型数字化企业的技术实战和创新应用的经验集，对于即将开启或正在进行数字化转型的企业，都有很好的指导和借鉴意义。在此，我很高兴能将这本专著推荐给大家，希望大家开卷有益，从中取到各自所需的“真经”。\n\n**专家推荐**\n--------\n\n数字化转型的终点是数字原生。人类的历史就是一部技术革命驱动的社会转型和发展史。产业数字化转型，就是通过新一代数字技术与实体产业的深度融合，将传统产业最终升级重构为数字原生企业的过程。本书两位作者都是招商局集团数字化转型的亲身经历者与实践者，既有来自产业角度的技术哲思又有实践路径的具体指导，是一本难得的兼顾了深度与广度的产业数字化转型专著。\n\n——何宝宏 中国信息通信研究院云计算与大数据研究所所长\n\n科学技术是推动人类社会发展的根本动力。了解和学习数字技术，是数字化时代的必修课，而本书就是非常好的参考书。本书内容与国务院印发的《数字中国建设整体布局规划》主题相关、不期而遇，充分印证了作者对国家发展方向的理解和对技术趋势的深刻洞察。\n\n——李剑峰 中国石化集团首席专家、国务院国资委国资监管信息化专家、腾讯云 TVP 行业大使\n\n科技创新是第一生产力，数字科技与实体产业的融合创新是发展数字经济的根本途径，数字技术已成为数字经济时代企业的核心生产力。本书立足于招商局集团多元化传统产业的数字化转型经验，从亲身经历者的视角，深入分析了数字技术在产业数字化中的关键作用和实践路径，具有很强的现实指导和借鉴意义。\n\n——胡志强 天翼云科技有限公司总经理\n\n数字化转型，说易行难。这是一场数字化技术引领的产业变革，是一个复杂的巨系统工程，没有现成的模式可以完全照搬，每一家公司、每一个组织都有其自身的优势与局限。本书作者以大型多元化企业的数字化转型实践为基础，为读者们提供了一个综合的视角，让产业转型的实践者们能够利用系统化的方法，根据各自的特点选择合适的技术组合，一步一步地凭借自身努力和技术手段，来驾驭这个充满复杂性与不确定性的时代。\n\n——韦青 微软（中国）有限公司首席技术官\n\n随着数字经济的蓬勃发展，数字化已经成为当代产业发展的必然趋势。企业和组织必须实现数字化转型，才能在激烈的市场竞争中脱颖而出。本书对于产业数字化转型十大核心技术的深入探讨和分析，为读者提供了全面的数字化转型指南，可帮助读者深刻理解数字化转型的趋势和底层逻辑，掌握最前沿的技术应用和实践方法，实现企业和组织的创新突破和可持续发展。\n\n——朱勇 百度智能云副总裁\n\n![](/images/jueJin/c18ef3f5bd3349f.png)\n\nTVP 山金孝老师新书《融合：产业数字化转型的十大关键技术》已开售。本书内容丰富，适合从事不同技术领域的各类读者，包括企业管理人员、数字科技领域研究者以及对产业数字化转型和数字技术感兴趣的大众读者，点击[「链接」](https://link.juejin.cn?target=https%3A%2F%2Flink.zhihu.com%2F%3Ftarget%3Dhttps%253A%2F%2Fitem.m.jd.com%2Fproduct%2F14009848.html%253F%2526utm_source%253Diosapp%2526utm_medium%253Dappshare%2526utm_campaign%253Dt_335139774%2526utm_term%253DCopyURL%2526ad_od%253Dshare%2526gx%253DRnE3xGVYaGaNydRP--tyD96c7zzOc1F1C3vb \"https://link.zhihu.com/?target=https%3A//item.m.jd.com/product/14009848.html%3F%26utm_source%3Diosapp%26utm_medium%3Dappshare%26utm_campaign%3Dt_335139774%26utm_term%3DCopyURL%26ad_od%3Dshare%26gx%3DRnE3xGVYaGaNydRP--tyD96c7zzOc1F1C3vb\")即可购买！",
	"selfDefined": "likes:0,comments:0,collects:2,likes:2598"
}