{
	"title": "程序员旅程中的思维与精神",
	"author": "",
	"publishTime": "2023-09-25",
	"readTime": "阅读7分钟",
	"tags": "[\"程序员中文技术社区\",\"前端开发社区\",\"前端技术交流\",\"前端框架教程\",\"JavaScript 学习资源\",\"CSS 技巧与最佳实践\",\"HTML5 最新动态\",\"前端工程师职业发展\",\"开源前端项目\",\"前端技术趋势\"]",
	"description": "最近碎片时间有在看黑客与画家，看的过程中，有一个问题突然冒了出来，一个程序员，到底应该具有哪些思维，哪些精神才算领悟了真谛 ？除了程序员，和我们生活在这个时代的每一个人又是否有借鉴之处呢？",
	"article": "![](/images/jueJin/de48be64bf25440.png)\n\n> 本文作者：E、T、F\n\n最近碎片时间有在看黑客与画家，看的过程中，有一个问题突然冒了出来，**一个程序员到底应该具有哪些思维，哪些精神才算领悟了真谛？** 除了程序员，生活在我们这个时代的每一个人又是否有借鉴之处呢？这里我们先撇去技术层面的知识不谈，更宏观地看下这个问题。\n\n陆奇曾在演讲中提到，**`动手去创造性地解决问题，代表了创造者一系列的核心行为和思想状态。`**\n\n首先，一定是要**动手去做**。在当今这个大数据消费时代，很多人似乎“失去”了思考和学习的能力，被个性化推荐滋补投喂着“个人兴趣”，守着这一亩三分地再也没想着迈出去。\n\n有些人通过阅读书籍，学了很多知识，听了很多道理，看了很多的世界，却仅止步于理论，将知识停留在记忆中，甚至慢慢消退。有时候，每当别人发表观点，突然就仿佛唤醒了自己的记忆，说道：“诶？你不提我还真给忘了，这个我有印象，是那个啥啥啥吧，说的大概是balabala”。\n\n再进一步的人，会在看的过程中，记录自己的笔记，就像当年学生时代很多人抄歌词一样，一是当时情绪到位了，让当时的自己大受触动；二是留个念想，待到多少年后一看，满是青春的回忆。但绝大多数人也仅仅停留在记录的这一道，没有更进一步。\n\n然而，最难得的人呢，是那些**看到这些知识内容后，会静下心来写出自己的想法，思考它在不同场景下是否仍然适用，最终融汇到自己思维体系中的人**，在这期间，同一份知识内容他们可能会反复回过头去细品确认，最终得出自己的见解并在后续的日常中付出实践。\n\n当然，**动手是需要勇气的**，而且这往往要耗费大量的时间，也需要我们拥有专注和耐心。尤其是在这个快消费时代，30分钟的枯燥思考怎么抵得过30个欢快的短视频。\n\n有时候就是这样，道理我们都懂，但如果要付诸实践却困难重重，往往需要巨大的决心和意志力。反过来看，那些真正能思考后付出实践，甚至养成习惯的人，就显得多么高大。\n\n然后是**创造性**，我们传统层面对创新的理解一直是些高大上的东西，想着要从0到1发明创造个什么牛逼哄哄的东西。但创造性更多意味着不受束缚，敢于探索。**从0到1是创新，从1到1.1也是创新**。**`善于运用前人的智慧结晶才是大道`**。就像我们感觉古人们都会作诗，但其实除了凤毛麟角的圣贤外，大多数也是因为他们当时“考试”要考这个，也是学习模仿名人名句，在某些场景下有感而发写出了一首首诗词歌赋。\n\n另一方面，创造其实同设计和品味是密不可分的。许多人其实都具备设计的能力，但真正有品味的设计者却寥寥无几。**`设计作为需求和技术之间的桥梁，具有非常重要的地位`**。一个好的设计，可以不断满足需求，让技术发挥更大的潜力。真正能够创造价值的人，就是那些真正有品味的人，他们知道什么是好的，明白什么是需要优化的，同时这些人往往很有态度，不做到卓越誓不罢休。\n\n最后是要**解决问题**。解决问题不仅仅关乎技术层面，更关乎的是解决人的问题，满足人的需求。那如何才能发掘和找到这些需求呢？\n\n近些年比较热的一个概念就是**善于运用第一性原理**。它最早是由古希腊哲学家亚里士多德提出，强调的是\\*\\*`回归事物最基本的条件，将复杂问题不断拆分进行要素解构分析，从而找到实现目标最优路径的方法`\\*\\*。那些最基本的事实或真理是不需要再被推导、证明的，而其他的知识和理论都可以根据这些原理来构建和推导。\n\n它可以帮助我们洞察事物的本质，更好地理解和发掘需求，并促使人类不断演进和发展。一个好的、更优的路径，可以让我们展望更远的未来。\n\n用一个可能不恰当的例子，如果说“算法 + 数据结构 = 程序”。我们看清了需求，可以认为找到了一种“解药”。**`但光有解决方案还不足以实现真正的变革，我们还需要一种容器来承载和实现这个解决方案`**。这个容器就是创造的工具。\n\n不同的时代，创造的工具有着显著的区别。**随着人类社会的发展和技术的进步，创造工具的形式和功能也在不断演变**。\n\n在古代，创造的工具主要是各种农业/手工艺工具。这些工具帮助我们提高了农作物的产量和效率，制作出精美的纺织品。\n\n随着工业革命的到来，创造工具经历了革命性的变化。发电机、蒸汽机等工业设备的出现，引领了新的工业时代。电力的运用使得生产力大幅提升，机械化生产取代了手工劳动。这些创造工具极大地推动了工业化进程，并对社会产生了深远的影响。\n\n而在当下这个时代，**计算机、开发工具、编程语言等创造工具成为了重要的创新驱动力**。不论是在程序员开发的软件、Web应用、移动应用中，还是最近大热的人工智能领域，编程语言、开发框架、数据分析处理工具都发挥着核心的作用。**`它们是当下创造者思考的基石，也是创造者进化和演变的核心环境`**。\n\n著名的心理学家、龙虾🦞教授 乔丹·彼得森（Jordan Peterson）在之前的采访和演讲中也再三说明了思考、写作、实践的重要性，甚至也强调了创作工具的地位。这种方法的底层逻辑其实也是在告诉我们：**要思考，更要行动起来，用“正确的技术”去发现并解决问题**。\n\n实际上，不仅仅是对于黑客、程序员，对于画家，对于生活在这个时代的每一个人来说，都是类似的。当我们的大脑停止思考时，命运的车轮也将停滞不前。如果我们一味坚持固化的观念和思维方式，终有一天也将变成那些我们当初眼中的“老顽固”。\n\n在这个大变革时代，我们都需要`勇于行动、善于思考，善于发现适合自己的工具和方法，探索创新的边界`。\n\n> 本文发布自网易云音乐技术团队，文章未经授权禁止任何形式的转载。我们常年招收各类技术岗位，如果你准备换工作，又恰好喜欢云音乐，那就加入我们 grp.music-fe(at)corp.netease.com！",
	"selfDefined": "likes:25,comments:5,collects:23,likes:5468"
}