{
	"title": "当了三个月面试官，面试者有些表现让我挺无语的~说说我的看法~",
	"author": "Sunshine_Lin",
	"publishTime": "2023-10-18",
	"readTime": "阅读6分钟",
	"tags": "[\"前端中文技术社区\",\"前端开发社区\",\"前端技术交流\",\"前端框架教程\",\"JavaScript 学习资源\",\"CSS 技巧与最佳实践\",\"HTML5 最新动态\",\"前端工程师职业发展\",\"开源前端项目\",\"前端技术趋势\"]",
	"description": "前言 大家好，我是林三心，用最通俗易懂的话讲最难的知识点是我的座右铭，基础是进阶的前提是我的初心。 当面试官、做简历筛选 不知不觉，三个月过去了，也当了三个月的面试官。毕竟在以前的公司也当过面试官，在",
	"article": "前言\n--\n\n大家好，我是林三心，用最通俗易懂的话讲最难的知识点是我的座右铭，基础是进阶的前提是我的初心。\n\n![](/images/jueJin/5279bbe5a77546c.png)\n\n当面试官、做简历筛选\n----------\n\n不知不觉，三个月过去了，也当了三个月的面试官。毕竟在以前的公司也当过面试官，在B站上也经常有模拟面试的直播，所以现在的团队让我去当一面的面试官，也会让我去做简历的筛选~差不多也看了有上百份简历，面了有几十个人\n\n这三个月，我的感受就是\n\n*   **简历烂的人太多了。。。。**\n*   **技术不达标的人太多了。。。。**\n\n总结为一句话就是：\n\n*   **初级前端太多了。。。**\n\n接下来我就从**简历、笔试、面试**这三个方面给大家分享吧~\n\n简历能不能不要太low？\n------------\n\n*   一个JavaScript就能概括，非得把原型链、this、Promise等等全都写在技能上，以为你这样写基础就很好吗？\n*   Node、mongoDB写在一起，一看就知道是网上自学的，能不能放技能后面去，以为这么写你就是有过全栈经历吗？\n*   连 vscode、postman 这类工具都写到技能里面去充数，以为这么写别人会觉得你会的好多？\n*   居然写 \"会新特性 HTML5 + CSS3 + ES6\" ，自己去查查这几个东西都是几年前的东西了，还新特性？\n*   一个” Vue 全家桶“就能概括的技术，非得把Diff算法、插槽、生命周期这类细节技术点写到技能里，并不会让人觉得你会的多\n*   工作经历就写了”公司 + 年限“，大哥，你这么写，我哪知道你在上家主要做的方向是啥？\n*   居然把”使用nexttick解决了xxx问题、使用了生命周期做了xxx功能、使用了vuex进行状态管理“这类写在项目经历里，我只能说你是不是没啥可以写的了？这些不是开发一个项目必备的操作吗？你以为很独特？\n*   你项目亮点里说优化了性能，那你倒是写一下优化了多少啊，效果是什么，指标是什么，你说你优化了，你自己信吗？\n*   100个人里有99个人会把”二次封装了axios“这种东西作为亮点写简历上，大哥。。你是封装了什么特殊功能吗？就写个请求拦截器、响应拦截器就算亮点啦？那你还不如不写呢。。\n*   别TM把你大学时，或者平时私底下写的博客网站放到项目经历里了，求求了，真的不知道怎么说你了，这是个前端就能搞的东西，放上去有什么意义呢？\n*   真6，居然还有把汽车驾驶证写到简历上的，真的6~\n*   个人评价不用写太多哈，因为我也不会看的\n\n笔试能不能多写点？\n---------\n\n*   前面那些基础题都是背了就能写对的，你连背都不背，那没办法了，活该你不及格\n*   后面的那些编程题。。你TM不会你可以写一下你的思路啊，写一写伪代码也行啊，你直接不写，或者乱写，你叫我怎么给你分？比如一道题你不会，但是你有思路，我还能给你一半分，，你要是乱写或不写，那不好意思直接没分\n*   居然还有个兄弟，笔试只有2分，真的是66666了~如果是实力问题，那回炉重造吧你。如果你是不屑做这份题，那我更看不起你，起码的尊重都不给你，也回炉重造吧你\n\n面试时能不能争气点？\n----------\n\n*   我是真服了，我上来客客气气叫你做一下自我介绍，你前后讲了十几分钟，差点就把你家里几口人，存款多少都跟我说了。。大哥，我只是想知道你技术栈而已，你没必要这样浪费这么多时间。。\n*   面试就好好面试，能不能别TM动来动去的，移动来移动去的，左摆头又摆头的，你以为你是明星？参加电影节呢？\n*   简历上写的天花乱坠，面试时问你个this指向，都得我给提示才能回答得过关？\n*   问你有没有私底下去学习，是想看看你好不好学，你直接跟我说没有？？？大哥你就不能意思意思一下吗？你这么搞让我怎么给你过？\n*   问了你webpack怎么配置优化，你TM直接给我来一句：”我没配置，都是公司里老前端们配的“。。。我真服了，老前端配的你就不能看看吗？看完不就是你自己的？\n*   同理，问你某个功能怎么实现的，大哥，这可是你简历上写的啊，你直接跟我说：”这部分我没怎么做，是我同事做的“，真牛。。你同事写的代码你是看不了还是咋地，看了不就是你自己的？并且，你回答不上来你还写简历上干嘛？\n*   八股文这种是个前端都能背的东西，这要是放在考试里那就是送分题。。我都搞不懂了你面试前为啥不把送分题背一背，你连背都不肯背一下，那是不是说明你对这个岗位也不太重视？？？那我可不要你。。\n*   抛给你几个场景题，知道你没搞过这些场景，就是想考考你能回答出多少，并且会不断给你提示。。你TM直接给我放弃了。。大哥，你这属于是自己都对自己没信心了。。怎么可能每个人每一种场景都会呢，我这是在看你能回答出多少，有没有在思考。。你这直接放弃，搞得我都觉得前面面试是在浪费时间。。。\n\n结语 & 加学习群 & 摸鱼群\n---------------\n\n我是林三心\n\n*   一个待过**小型toG型外包公司、大型外包公司、小公司、潜力型创业公司、大公司**的作死型前端选手；\n*   一个偏前端的全干工程师；\n*   一个不正经的掘金作者；\n*   一个逗比的B站up主；\n*   一个不帅的小红书博主；\n*   一个喜欢打铁的篮球菜鸟；\n*   一个喜欢历史的乏味少年；\n*   一个喜欢rap的五音不全弱鸡\n\n如果你想一起学习前端，一起摸鱼，一起研究简历优化，一起研究面试进步，一起交流历史音乐篮球rap，可以来俺的摸鱼学习群哈哈，点这个，有7000多名前端小伙伴在等着一起学习哦 --> [摸鱼沸点](https://juejin.cn/pin/7035153948126216206 \"https://juejin.cn/pin/7035153948126216206\")\n\n![image.png](/images/jueJin/b36bfee92a124ae.png)",
	"selfDefined": "likes:46,comments:11,collects:36,likes:2853"
}