{
	"title": "一位炒了四年粉的朋友想转前端，而我前端想兼职炒粉~",
	"author": "Sunshine_Lin",
	"publishTime": "2024-01-03",
	"readTime": "阅读5分钟",
	"tags": "[\"前端中文技术社区\",\"前端开发社区\",\"前端技术交流\",\"前端框架教程\",\"JavaScript 学习资源\",\"CSS 技巧与最佳实践\",\"HTML5 最新动态\",\"前端工程师职业发展\",\"开源前端项目\",\"前端技术趋势\"]",
	"description": "前言 大家好，我是林三心，用最通俗易懂的话讲最难的知识点是我的座右铭，基础是进阶的前提是我的初心~ 背景 昨天有一位小伙伴加我，备注是：专业炒粉招加盟~ 我还以为是打广告的，同意了之后，发现不是打广告",
	"article": "前言\n--\n\n大家好，我是林三心，用最通俗易懂的话讲最难的知识点是我的座右铭，基础是进阶的前提是我的初心~\n\n背景\n--\n\n昨天有一位小伙伴加我，备注是：专业炒粉招加盟~\n\n我还以为是打广告的，同意了之后，发现不是打广告的哈哈，其实我昨天还说我要转行去炒粉直播呢，也太巧了，马上就有一位炒粉加盟的来加我哈哈哈哈，笑鼠俺噜~\n\n![](/images/jueJin/964c3f5a989a4b4.png)\n\n这位兄弟说他干了四年的炒粉了，今年想要转前端，并且正在学习前端\n\n![](/images/jueJin/eccfb64339354b1.png)\n\n其实现在虽然互联网市场已经大不如前，但是还是有很多兄弟想要转互联网，吃上互联网的蛋糕，其实这是可以理解的，因为大家都传言程序员工资比较高嘛，说实话程序员工资确实比其他行业高些~~ 并且我也觉得转前端确实是一条不错的道路~~\n\n看法 & 建议\n-------\n\n对于这类**入门级前端程序员**，其实我有我自己的一些看法和建议，想要送给这些兄弟，因为毕竟我也是从那个阶段走过来的~\n\n### 少看书，多看视频\n\n初学者建议别看书，纯纯浪费时间，除非你时间真的很多，但是你觉得现在留给你们的时间还多吗？书上的东西是比较闷的，需要你自己去发掘其中隐藏的知识点，这无疑浪费了你的时间。\n\n我建议是多看视频，去B站上面搜前端，一堆视频给你看，视频是比较生动的知识获取途径，它能教你基础，教你实践，教你面试，所以，能看视频，为啥要看书呢？\n\n### 切勿好高骛远，学好三板斧\n\n有的人一入门就想学 vue、react，其实他们连框架是啥都不知道，框架跟 JavaScript 有啥关系他们也不知道。。\n\n所以我建议你们还是不要好高骛远，先学好前端三板斧\n\n*   JavaScript/ES6+\n*   HTML\n*   CSS\n\n先能写一个静态网页了，再往后去学习高阶的东西，不然你一开始就爬的那么高，最后就会摔的有多惨~\n\n### 多总结，多复盘\n\n无论是学习前端也好，写代码出现BUG也好，面试也好，都要学会总结，复盘，分析自己错在哪里，还有哪些能改进的地方~这样你下次才不会继续犯这些错误，久而久之你会发现你经验越来越足，人也越来越自信\n\n### 优先学习Vue\n\n如果你是一个入门级别的前端，并且想要马上找到一份工作，那么我劝你优先学习 Vue 这个框架，为啥呢？因为现在国内前端市场 Vue 的占有率很高，不是很高，是超级高，用的公司超级多，所以你想要找个公司上班，我劝你优先学习 Vue + axios\n\n### 少看文档，多百度，多问人\n\n在工作中，看文档进行开发是一件很正常很普遍的事情，但是对于初学者来说，你们往往很难去看懂文档，并且文档其实跟书一样，就是冷冰冰的文字，你看了文字你还得自己去思考文字的意思，所以遇到不懂的，先查百度，百度不到再去问人，而不是盯着文档看，最后也看不出个所以然\n\n### 放低身段，寻求机会\n\n如果你是转行前端，或者是在校大学生想学前端，第一份工作一定要放低身段，先搞个岗位混经验先，就当做是一个跳板，等你攒了一些工作经验后，你才有资本去做选择，现在你只有被选择的份~\n\n### 只要学不死，就往死里学\n\n我还记得我当时刚学前端的时候，一天能学10小时以上，所以现在到你们了，如果你们想要找到一份工作的话，那么你们就只能往死里学，毕竟现在大环境不比以前了，你想要吃蛋糕，那你现在就得付出比别人成倍的努力，你才能在求职中淘汰掉其他人，你们说是不是？\n\n### 两耳不听窗外事，一心只敲前端码\n\n不要听外面说什么“前端已死”这种话，如果你对自己有信心，对前端有信心，确定这是你的方向，那就认真学，死命学，而不是三天打鱼两天晒网，学一会焦虑一会的，那你会发现到最后机会都是别人的，你只有竹篮打水一场空~\n\n结语 & 加学习群 & 摸鱼群\n---------------\n\n我是林三心\n\n*   一个待过**小型toG型外包公司、大型外包公司、小公司、潜力型创业公司、大公司**的作死型前端选手；\n*   一个偏前端的全干工程师；\n*   一个不正经的掘金作者；\n*   一个逗比的B站up主；\n*   一个不帅的小红书博主；\n*   一个喜欢打铁的篮球菜鸟；\n*   一个喜欢历史的乏味少年；\n*   一个喜欢rap的五音不全弱鸡\n\n如果你想一起学习前端，一起摸鱼，一起研究简历优化，一起研究面试进步，一起交流历史音乐篮球rap，可以来俺的摸鱼学习群哈哈，点这个，有7000多名前端小伙伴在等着一起学习哦 --> [摸鱼沸点](https://juejin.cn/pin/7035153948126216206 \"https://juejin.cn/pin/7035153948126216206\")",
	"selfDefined": "likes:9,comments:0,collects:1,likes:946"
}