{
	"title": "现在的前端，到底是技术深度重要，还是技术广度重要？",
	"author": "Sunshine_Lin",
	"publishTime": "2023-05-25",
	"readTime": "阅读5分钟",
	"tags": "[\"程序员中文技术社区\",\"前端开发社区\",\"前端技术交流\",\"前端框架教程\",\"JavaScript 学习资源\",\"CSS 技巧与最佳实践\",\"HTML5 最新动态\",\"前端工程师职业发展\",\"开源前端项目\",\"前端技术趋势\"]",
	"description": "前言 大家好，我是林三心，用最通俗易懂的话讲最难的知识点是我的座右铭，基础是进阶的前提是我的初心。 前几天跟朋友讨论“技术广度和技术深度哪个重要”，再想想自己像过山车一般的前端历程，有感而发，想给小兄",
	"article": "前言\n--\n\n大家好，我是林三心，用最通俗易懂的话讲最难的知识点是我的座右铭，基础是进阶的前提是我的初心。\n\n前几天跟朋友讨论“技术广度和技术深度哪个重要”，再想想自己像过山车一般的前端历程，有感而发，想给小兄弟们一些建议~\n\n![image.png](/images/jueJin/fadfad32b1b5439.png)\n\n为什么会有这个疑问？\n----------\n\n还记得两年前，甚至是一年前，当时想要找到一份好工作，你至少得做好几件事情：\n\n*   熟练某一个框架的使用\n*   阅读并深入探索过框架的实现原理\n*   熟练各种JavaScript的八股文\n\n至少你得做好以上这几件事，才有可能找到一份较好的工作，但是如今的形式，看看各种招聘的要求，可怕的很，让人不禁想问：只会上面的这些，还能找到一份好工作吗？\n\n自我心路历程思考\n--------\n\n还记得两年前，那时的我是一个非常纯正的前端程序员，那时候我心里想的是：\n\n*   我是前端，我只干前端的事\n*   公司肯定是分工明确的，啥岗位的人干啥岗位的事情，不会让我去干后端的\n*   学前端以外的事情是不可能的，那只会影响我更加深入学习前端\n\n我记得那个时候我还专门写了一篇文章，去diss那些鼓励前端去学后端的人。那个时候的确是“无忧无虑”的，只需要考虑自己前端的事情即可。\n\n![image.png](/images/jueJin/a0f9635371a4458.png)\n\n后来我进了一家公司，经历了三个过程：\n\n*   被迫从一个“纯正前端”变成“全干工程师”\n*   再到完全适应去做一个“全干工程师”\n*   再到从“全干工程师”这个身份中去学到一些东西\n\n这段经历让我明白了许多，从这开始我才知道为什么那些前端大佬能成为前端大佬了，因为他们会的多，能从多个角度去思考所做的产品，而不仅仅是从前端的角度。\n\n技术深度 or 技术广度？\n-------------\n\n讲完我这些年的经历和看法之后，我们回到主题，来聊聊技术深度和技术广度。我个人觉得就现在的前端形势来说，技术广度无疑是比较重要的，你随便去Boss上看，稍微一个牛一点的公司对前端要求都很多，比如：\n\n*   不止要网页，还要会app\n*   不止要前端，还要会点后端\n*   不止要前端，还要懂点运维/操作系统\n*   不止要前端，还要有产品思维\n\n其实换位思考一下，这也很正常，如果你是一个公司的招聘者，有两个应聘者，一样的期望薪资，一个会的多，一个会的少，你难道不觉得前者的性价比更高吗？毕竟大部分公司招的都是即战力，招你进来就是需要即插即用的，会的多的人大概率学习能力较强或者项目经历更加丰富，那肯定融入团队的项目开发更加迅速~\n\n但是，并不是说技术深度就不重要，技术深度和技术广度这两个东西，从来就不是单选题，而是多选题，只不过说如今的形式确实技术广度更加吃香，但是如果你能做到技术广度+技术深度的话，那你根本不愁找工作~\n\n现在流行“前端已死”的说法？\n--------------\n\n现在的论坛上流行着“前端已死”的说法，且越传越开，搞得很多人都开始焦虑。其实我也是不认同这个说法的，我认为只是现在的前端市场出现供大于求的情况，很多人现有的实力已经跟不上市场的要求了，所以唯一的办法只能是让自己进步~\n\n我之前也写过一篇文章 [三心杂谈：前端已死？打破“三个局限”，直接起死回生！](https://juejin.cn/post/7204367270974292005 \"https://juejin.cn/post/7204367270974292005\")，我觉得你要去打破三个局限：\n\n*   不局限于框架\n*   不局限于前端\n*   不局限于开发\n\n其实仔细想想这三点，何尝不是技术广度的体现呢？我不想强迫各位去卷，去疯狂地学习，我只是以一个经历过多个前端历程的人，去给你们建议，愿各位能找到适合自己的学习方法吧，从而提升自我！\n\n结语 & 加学习群 & 摸鱼群\n---------------\n\n我是林三心\n\n*   一个待过**小型toG型外包公司、大型外包公司、小公司、潜力型创业公司、大公司**的作死型前端选手；\n*   一个偏前端的全干工程师；\n*   一个不正经的掘金作者；\n*   一个逗比的B站up主；\n*   一个不帅的小红书博主；\n*   一个喜欢打铁的篮球菜鸟；\n*   一个喜欢历史的乏味少年；\n*   一个喜欢rap的五音不全弱鸡\n\n如果你想一起学习前端，一起摸鱼，一起研究简历优化，一起研究面试进步，一起交流历史音乐篮球rap，可以来俺的摸鱼学习群哈哈，点这个，有7000多名前端小伙伴在等着一起学习哦 --> [摸鱼沸点](https://juejin.cn/pin/7035153948126216206 \"https://juejin.cn/pin/7035153948126216206\")\n\n![image.png](/images/jueJin/a0226b8e08ba43e.png)",
	"selfDefined": "likes:396,comments:0,collects:172,likes:51942"
}