{
	"title": "实景声学测试与用户需求调研报告（问答库方向）",
	"author": "王宇",
	"publishTime": "四月25,2023",
	"readTime": "12s",
	"tags": "[\"6、FTT问答库测试记录\"]",
	"description": "6、FTT问答库测试记录",
	"article": "**一、引言**\n\n        2022/04/11~2022/04/19，李梦阳、廖志川、范晓烽三人一同前往贵港市进行万得厨2.0的声学模块实景测试及用户需求调研。本报告主要聚焦于问答库方向用户需求调研，反馈客户对万得厨内置虚拟人问答知识内容的需求，给出虚拟人问答技能的适宜使用场景及技能配置建议。\n\n**二、声学测试概况**\n\n        本次万得厨声学模块调研在客户家的厨房及客厅进行，收集真实做饭场景、客厅场景下的环境噪音数据，并进行万得厨声学模块在真实环境不同距离下的语音识别能力，详细测试报告详见[https://wiki.yingzi.com/x/weTVBQ](https://wiki.yingzi.com/x/weTVBQ)。\n\n        从测试结果来看，厨房做饭时的环境噪音较大，在1米距离内的识别效果较好，但也要相应提高测试人的音量，距离较远时的识别效果较差，识别率低。客厅环境的噪音相对厨房要低很多，声学识别能力也好很多。除了环境噪音的影响外，无线网络信号也会影响虚拟人的应答速度，进行影响用户体验。此外我们还在相同厨房环境下，进行了小万、天猫精灵（方糖2）、小爱同学（小爱音箱play增强版）之间的识别效果测试，从主观感受来看，环形4麦的小爱音箱的识别效果要比线性二麦的小万及天猫精灵要好。\n\n**三、用户调研**\n\n一）调研内容\n\n        本次调研内容主要是用户使用万得厨做饭的痛点、用户在使用1.5版本后提出的功能性意见及建议以及用户对于万得厨功能的需求，调研方式为口头访谈。\n\n二）调研对象\n\n        本次主要对贵港的11家万得厨客户进行了调研访谈，覆盖青年群体、三代同居大家庭、宝妈带娃、独居老人等群体。\n\n三）调研结果\n\n        由于调研的用户只使用过万得厨1.5版本，所以他们都是基于1.5的给出的痛点及需求，主要反映了炉子卡顿重启、自定义无法暂停、老人操作困难等问题，痛点及需求部分内容详见[https://wiki.yingzi.com/x/weTVBQ](https://wiki.yingzi.com/x/weTVBQ)。对于老年用户，他们更希望的是万得厨的交互与操作能够更简便易学（傻瓜式操作），所以关怀模式的开发尤其需要注重这一点。\n\n        用户在体验我们带来的2.0版本后，大部分客户对其语音功能是十分期待的，万得厨毕竟为厨房用具，客户在做饭场景经常都是不方便去手动操作万得厨的，语音功能即使只能够实现开始、暂停、火力调节等基础功能，也能够给客户带来极大方便。我们也询问了客户是否有对硬件、使用指引、食品、养生、运动等知识解答、问题解决、闲聊等技能的需求，大部分客户反应的是，在厨房环境下此类技能并没有多大用处，使用几率不大，平时也不会主动跑到厨房去对万得厨询问某些东西，出现问题更多是在手机上寻找答案及解决方法。总的来说，用户对于语音功能其实还是希望更聚焦于跟烹饪相关的指令内容，希望通过语音技能实现一些简单、基础的烹饪操作，其他的问答和闲聊的功能在厨房场景并不太合适，离开厨房客户还有智能音箱、手机等智能设备。\n\n        当然不可否认的一点是，客户没有使用过万得厨2.0版本，所以访谈结果有一定的主观性。\n\n**四、问答库工作建议**\n\n●根据声学测试结果来看，万得厨2.0在厨房嘈杂环境下的语音近场识别能力尚可，大于一米之后识别效率降低甚至影响使用，基于当前识别能力极容易导致相似问答对之间识别错误，撰写问答对时可以适当对类似的问题做好区分，降低相似度。\n\n●对于老人，他们更喜欢使用一些傻瓜式的东西，由此我们在撰写操作指引类的问答对时，需要考虑到老年人群的理解及执行能力。\n\n●基于万得厨的厨房使用场景，客户对与烹饪以外的语音技能需求不大，当前问答对的撰写应该把重点放在烹饪场景相关的内容，其它类目问答库可暂缓。\n\n●根据客户的需求及建议，炉端虚拟人可考虑只配置烹饪相关的问答库内容，减轻炉端负担，运动顾问、养生类等与烹饪相关的问答库内容并不适用于厨房场景，建议配置在手机端。\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}