{
	"title": "48、49周学习笔记",
	"author": "王宇",
	"publishTime": "十二月09,2022",
	"readTime": "12s",
	"tags": "[\"范晓烽\"]",
	"description": "范晓烽",
	"article": "《场景革命》读书笔记：  \n一、后连接时代的造物逻辑  \n1、情感连接（场景造物的体验逻辑）：  \n很多时候，人们喜欢的不是产品本身，二十万产品所处的场景，以及场景中自己浸润的情感。（胜负手：打动人心的场景，例如多肉植物-寄托着人们的情感，满足自己的情感诉求）  \n2、场景时代是对过去流量时代的一次革命而非改良——人是这个时代最大的场景。（流量时代过去了？）\n\n二、正在发生的场景革命  \n1、互联网中的场景常表现为与游戏、社交、购物等互联网行为相关的，通过支付完成闭环的应用形态（即应用场景）。  \n1）超级入口：能够触发用户沉浸式体验或者能够使用户长时间停留的应用形态，比如视频、游戏、微信（小万OK吗？）  \n2）支付场景：能够应用微信支付/支付宝完成交易的购物、用车、团购等场景。（we can）  \n2、场景：  \n●以人为中心的体验细节——依赖于人  \n●一种连接方式  \n●价值交换方式和新生活方式的表现形态（打赏、平衡车。。。）  \n●构成时间、地点、人物、事件、连接方式\n\n一）长在朋友圈中的碎片化场景  \n1、微信——连接层面的最大公约数（从微信生长出来的的互联网应用形态），社交需求是微信产品的第一法则（美食广场？场景连接工具？）  \n2、碎片化图片和视频场景分享的背后，就是我们希望连接的场景  \n3、有情怀的产品和场景本身即是存在，更是移动互联网时代我们与世界最真实的连接。\n\n二）共享经济崛起的DNA  \n1、共享经济（关键词：场景）：场景中产%产、人%人、人%产连接方式的额不断改变与优化，是更有效率的撮合能力的不断优化。（共享经济是场景商业的典范，Eg：Uber）  \n2、基于新的用户需求和用户体验，以共享经济的逻辑，形成一种全新的产品打法和场景分类。\n\n三）颠覆传统互联网入口的核心逻辑  \n1、移动互联网时代，场景作为重要入口，颠覆了PC时代的流量逻辑（手机？）  \n2、三个原则：  \n●不再是简单执着与产品研发，而是专注洞察新的场景可能。  \n●不再是拘泥于自我本位诉求，二十激发用户主动传播分享。（美食广场？服务型机器人？）  \n●不再是红海竞争性流量获取，二十新品类独占新场景红利。\n\n二、支撑场景的要素  \n1、今天商业模式最重要的构建方式的就是场景化，塑造场景化的四个核心要素：体验（重塑改造场景）、链接（移动互联网、智能终端（小万？））、社群（用户卷入感）、数据（大数据）\n\n一）体验美学-重塑新的商业价值逻辑。  \n1、为用户提供价值需要新场景的解决方案——为用户创造超越期待的体验，建立与消费者的情感来连接。  \n2、用户越来越愿意为自己的“懒惰”付费，体验不单要解决痛点，还要解决甜点、痒点、尖叫点和兴奋点。  \n3、塑造用户卓越体验的三个方面：  \n●塑造体验的层次感，体验的层次感决定场景的真实性。  \n●体验要有细节，细节足够真是，才能吸引用户加入。  \n●提供基于长期消费 伴随的用户养成类体验，并把控制权交给用户。（万得厨-不止预制菜）\n\n二）空间链接-新场景得定义指导  \n1、网络空间和生后空间的不断融合带来新的跨界，从而定义新的场景。（链接的乘法效应，不用-你是异类）  \n2、完成空间链接的四个方面：  \n●让场景演进为生活方式。  \n●场景标签化-塑造成亚文化载体。  \n●基于用户为中心的全渠道化。  \n●多屏联动。（设备端、app端）\n\n三）社群-场景的动力机制（新商业生态的DNA）  \n1、场景具备亚文化的力量、亚群落的表征和社群感，才会具备拥有大规模用户和商业应用的可能。  \n2、移动互联网时代的消费精神：  \n●想要而不是需要  \n●追求既视感，所见即所购  \n●态度币功能重要  \n●追求价值敏感性而非价格敏感性  \n●自我表达与小众认同超过大众评价  \n●社交网络评价大于显示沟通  \n外在表达就是社群感、亚文化  \n3、个性化的场景生态：以人为逻辑、以体验为核心、以来链接韦中心、以社群为最大公约数的商业环境。（场景力：其对场景本身的定义能力和对亚文社群的影响能力）  \n4、科技产品要人格化，将它变成连接的标签/小众的生活态度，要有足够的内容价值，应该以更高的性价比来定义我们与拥护者之间的关系。\n\n四）数据-让场景精确匹配用户需求  \n1、场景背后是可量化的数据（数据流动性），新型的CRM（客户关系管理）系统构建，数据建模和输出成为场景底层逻辑，智能终端与结构化数据下的全场景体验\n\n三、构建场景的四即方法论  \n一）产品即场景——场景的解决方案（咖啡可以不是咖啡，是传达、连接感情的载体）  \n1、产品的功能属性（inside内核）+连接属性（plus外延）=新的场景体验  \n2、如何为产品找到Plus的机会？  \n●找到消费者场景体验的痛点  \n●细分消费者需求  \n●确定场景的呈现细节  \n3、inside能力-做用户的入口，连接人与场景。  \n二）分享即获取（越分享，越获得）  \n1、弹幕-大众“天涯共此时”的情绪分享与视频交互体验。  \n2、通过分享去构建新商业模式或形成营销创新：  \n●基于人格背书的分享（稳定的信用→长久收获信用带来的溢价）  \n●分享有效的信息资源（分享内容广义化）  \n●分享的杠杆能力和乘法效应（要找到分享引爆点的解决方案）  \n三）跨界即连接（跨界的深度，形成新的定价依据和定价能力，歌词瓶、台词瓶）  \n1、爆米花、电影院组合为一种跨界混搭，增强了用户在特定场景中的情感体验，价值敏感性取代了价格敏感性（电影院的爆米花贵吗？）  \n四）流行即流量（产品自身形成的用户主动搜索的能力）（流量正全面服从与流行）  \n1、场景流行的最重要成因-亚文化现象与拥护者之间是最真实的情感关系，用户甚至是催生亚文化的超级传播者。（全智贤同款-大量关注、主动搜索）  \n2、流量的造场运动种，应：  \n●相信亚文化的力量（用户主动搜索的意愿）  \n●找到品牌的拥护者（拥护者资源去催生的亚文化）  \n●流量新入口逻辑来自于人与人的口碑相传\n\n四、场景的商业应用  \n1、nice——首家“图片+标签”社交软件，其打造了一种兴趣社交场景，甚至跨界场景（合作草莓音乐节）。  \n2、场景时代的到来意味着全渠道的溶解与融合，意味着场景争夺成为今天商业升级与创新的必由之路。  \n一）场景在商业应用中的分类  \n1、高频场景容易获取用户，低频场景容易获取高毛利，重度场景容易形成产业链，轻度场景能够形成先到先得的壁垒。  \n2、为什么是河狸家不是河狸甲？上门到家！（高频场景）  \n3、消耗量大、使用人多、俨然成为一致生活方式场景，跑步（重度场景）  \n4、很多轻度场景正在不断被重度化，抓住轻到重转化的机会→弯道超车、新风口！  \n5、以做一个好产品的态度和方式去做场景的定义和推广，附加的情感意义不是无病呻吟，是基于功能的沉淀（支付宝的“十年账单”）\n\n二）场景成为传统产业转型为数不多的机会  \n1、传统产业转型关键，在品牌现有的产品和服务提供的价值之外，要创造出基于新场景的附加价值，濒危消费者创造独特的体验。（晨光的互联网产品-即刻）\n\n本书核心问题：  \n●产品是什么？是场景，场景的解决方案  \n●渠道是什么？是人，是人与人的互动性，场景触发的一种新连接，应用轨迹形成的连环场景，人是渠道的核心。  \n●研发是什么？研发意味着用户的大规模参与，研发本身意味着各种利益相关者共同的合谋和基于场景最真实的一种还原  \n●营销是什么？营销是基于热点的迅速转化，是基于互联网的内容产品只有内容，才能在互联网场景引爆流行。  \n●品牌是什么？其实已经没有品牌、没有商标了，所谓的差异化和识别性，在人群中气味一闻便知。是不是我的菜?是不是同行?是不是同道者?\n\n  \n\n  \n\n  \n\n  \n\n  \n《智能商业》读书笔记：  \n一、智能商业大变革  \n1、智能商业的三个重要的创新方向：在线化（微软）、智能化（谷歌搜索）、网络化/协同网络的扩张（广告技术），要在三个方向上有新的突破→奠定领先地位  \n2、智能商业双螺旋：  \n网络协同：通过大规模、多角色的试试互动来解决特定问题（维基百科的知识共创平台）。  \n数据智能：本质是机器取代人直接做决策（淘宝页面推荐），由人能操作的环节能不能让机器直接代替，只是一个非常有效的评判标准，只要能替代，就是向智能商业的一次质的飞跃。  \n3、制造业不会再成为一个独立企业，而是成为他人服务闭环里的一个承载者，或者自己建立一个2C（对消费者）的沟通渠道。  \n二、互联网本质  \n1、联：改变物理世界的底层技术革命——物理世界的在线化（万物互联）  \n2、互：让交流沟通具备无限可能，互动  \n3、网：互联网给商业社会带来的颠覆性改变，连接和互动的必然发展路径是结网  \n三、网络协同  \n1、真正意义上的网络协同需要直连互动、实时反应、异质角色和多元场景，只有互联网技术才能充分实现这些条件，也只有万物互联才能充分发挥出网络协同的价值  \n四、数据智能（无数据，不智能；无智能，不商业）  \n1、“数据化”本质上是将一种现象转变为可量化形式的过程。  \n2、智能化指的是商业决策会越来越多地依赖机器学习，依赖人工智能（机器取代人）  \n3、自己在互联网上留下的每一处“足迹”都被数据化地记录下来，成为各种应用推送个性化服务的关键依据。（美食推荐必须依赖数据化智能推荐）  \n4、数据-汽油，算法-引擎  \n5、产品化：数据智能和商业场景的最终载体，其实用户是不直接消费数据和技术的，他们消费的是产品。  \n6、智能商业的三大基石：数据化、算法化、产品化  \n7、活数据：  \n●一定是始终在线且不断更新的，可以随时被使用。  \n●灵活使用：“活数据”在不断地被消化、处理，产生增值服务，同时又能产生更多的数据，形成数据回流。  \n三大特征：全本记录、先有数据后有洞察、先有数据，后有洞察  \n8、企业智能化的两大步骤：核心业务在线化、业务环节自动化（流利说）  \n五、智能商业的特征：向精准升维  \n1、精准就是精确和准确，分别对应着网络协同和数据智能。（？）  \n精确：通过网络协同，实现降维打击（精确是通过协同网络的扩张，对一个人在不同场景下的理解逐步深化的过程）  \n●精确要追求的方向，是在极度颗粒化的场景下，依然能找到具体时间点的需求，然后按需服务。  \n●究竟如何让能够实现精确？答案的核心是通过协同网络的不断扩张，获取一个人在不同的场景、不同状态下的更多数据。  \n2、准确：数据智能的背后，是商业逻辑的根本改变\n\n——TBC\n\n  \n\n  \n\n  \n\n  \n\n  \n\n  \n\n场景多面体至少包含生命周期面、空间面、组织面、  \n生命周期相对时间面、空间相对时间面、组织相对  \n时间面（六个面，六面体？）\n\n5W1H分析法  \nWho：产品为谁设计？目标用户是谁？谁购买，谁使用？数量有多少？（广度=主体）  \nWhy：用户为什么要选者我们的产品？除了我们的产品外，他还有哪些选择？产品被替代的可能性大吗？（强度=解决方案）  \nWhen：用户什么时候使用我们的产品？多久用一次？会使用多久？（频次、可持续性=时间）  \nWhere：用户在哪里使用我们的产品？（场景）  \nWhat：产品具体形式是什么？做成什么样？（方案形态）  \nHow：用户怎么使用它？（操作路径）\n\n虚拟数字人：虚拟数字人指存在于非物理世界中，由计算机图形学、图形渲染、动作捕捉、深度学习、语音合成等计算机手段创造及使用，并具有多  \n重人类特征（外貌特征、人类表演能力、人类交互能力等）的综合产物。  \n●虚拟—存在于非物理世界中，不同场景实现难度不同  \n●数字—依托多项技术存在，相关技术成熟成为其发展重要推动力  \n●数字—依托多项技术存在，相关技术成熟成为其发展重要推动力  \n分类：服务型（虚拟主播、老师等）、身份型（虚拟偶像）  \n                                           ——虚拟数字人深度产业报告\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}