{
	"title": "2023.11.04~与虚拟人公司沟通“FTT新增功能清单”内容",
	"author": "王宇",
	"publishTime": "十一月06,2023",
	"readTime": "12s",
	"tags": "[\"7、和第三方公司沟通的会议\"]",
	"description": "7、和第三方公司沟通的会议",
	"article": "会议名称\n\n与虚拟人公司沟通“FTT新增功能清单”内容\n\n会议时间\n\n2023年11月04日 上午10:30~12:00\n\n会议地点\n\n24楼VIP会议室\n\n主持人\n\n韦玲\n\n会议记录\n\n黄婷\n\n参会人员\n\n韦玲、王宇、任鹏、唐玮、马冬颖、郑小涵、李梦阳、黄婷\n\n会议主题\n\n针对“FTT新增功能清单”中虚拟人对待沟通问题的书面答复，进一步沟通。\n\n会议内容\n\n**沟通内容：**\n\n针对《FTT新增功能清单待沟通问题-应答1030》中功能详情与回复的内容进行了讲解，额外沟通情况记录如下：**  \n1、需求1-五要素基础架构实现**\n\n1）提及的五要素管理的架构需要协同多个团队推进，虚拟人只是整个业务架构中的一部分；等基础架构确定之后，涉及FTT系统相关架构变化需求才能进一步沟通明确。\n\n2）针对已列出功能清单中一些具体且独立的功能，待提供细化的功能说明后，可以根据实际应用需求提前先沟通确定。  \n3）清单中要素管理的内容，主要是在为应用提供物品道具资源（3D模型、贴图等资源格式）管理的能力，并非实际业务提及的烹饪数据建模概念，具体应用结合大的功能需求场景考虑。\n\n**虚拟人公司**：这期不做会导致后续架构改造使得成本增高，拟仁会把实现的功能列出来，具体需要影子结合业务需求考虑。\n\n**2、需求2-优化虚拟人的个性化形象定制能力**\n\n1）需要等已交付的PTA功能模块验收后，再根据效果评估新增功能需求。  \n2）针对功能清单提出内容，由影子评估是否有利于提升PTA效果，最终将该功能纳入一阶段合作作为交付物优化，还是纳入二阶段新增合作，由后续与商务沟通确定。\n\n**3、需求3-提升虚拟人的个性化智能水平**\n\n**虚拟人公司**：同等数据情况下，小模型效果不会低于目前平台的准确率。考虑数据隐私及内容合规性，不建议支持将用户个性化小模型分享给其他用户使用。\n\n双方对于应用场景及功能实现情况存在理解不一致的情况，希望每条功能具体实现的情况能给出说明文档，使得双方沟通理解更方便。\n\n**4、需求4-提升虚拟人的通用化智能水平**\n\n*   新增对话管理器  \n    问题3：支持利用历史信息辅助分类。  \n    问题4：可以对分类结果数进行限制。  \n    问题5：执行管道，前端先配置固定的串并行执行方案，算法若能给出更优方案，则优先按照算法的方案调整执行，否则走平台配置方案。  \n    问题6：下一期新增置信度结果输出，平台配置好阈值后，系统根据置信度和资源情况动态给出一个最优结果。\n\n如果对话管理和策略由算法层面处理，希望描述清楚算法做了哪些工作，相比之前的方案有哪些提升，影子才能评估功能满足情况及自己需要做哪些工作。\n\n*   优化中文NLU模块  \n    q：强知识体系约束有哪些？  \n    a：不同领域的知识分库处理，根据领域特点可以使用不同的技术解决，比如词槽不用再通过指令添加实体的方式实现。从而提高意图识别、指令识别的准确性。\n\n*   新增表格知识图谱  \n    q：表格问答能否通过设备捕捉实体回复？  \n    a：这是应用层的处理逻辑，应用层能捕捉到，后台就能处理。  \n    q：是否支持特殊场景的回复模板设置？  \n    a：只要属性在表格内且话术配置了对应的模板就支持。  \n    q：是否支持调用算法对返回结果进行处理（比如排序）？  \n    a：严格来说这不是表格图谱的问题，1.要是有检索需求，可以提供阈值设置，根据阈值对结果进行排序。2.可以通过推荐功能实现。  \n    q：是否支持返回实体（比如食谱）惟一编码？  \n    a：可以，但是要做到应用端与SAAS平台对齐，用统一ID同步交互实现。  \n    q：百度表格问答测试能力一般，是否有做过相关测试？  \n    a：可以根据常用表格数据进行优化，提供的表格问答肯定能达到95%的准确率要求。  \n    q：对话干预需求中说“任务型对话和指令问答支持对话干预，其他类型不适用”，然后表格问答又说“支持基于预设条件的问答结果干预配置”不太理解，这是不是意味着表格问答支持对话干预？  \n    a：干预配置范围不一样，对话干预指的是对话生命周期进行干预配置，表格是对回复结果进行干预。\n\n*   支持任务型对话  \n    q：对任务型对话支持的领域/场景有限制无法理解？  \n    a：指的是需要预先确定领域知识体系，不是数量限制。前端页面会提供基础的领域及意图配置工具，配置对应的领域和意图数据后，拟仁公司后台会针对这些领域做进一步优化。通用型任务对话没有领域限制，效果可能不佳，提前提出一些领域，可以针对特定场景进行优化。\n\n**5、需求5-智能烤箱终端应用**\n\n*   英伟达新硬件平台支持  \n    相较于在用RK3568，英伟达板子CPU频率不占优势，但内核数高，从参数上看，其CPU、显卡等配置均更优；  \n    需要影子提供英伟达板子可分配给虚拟人SDK运行的资源占用比，以优化在该板子上可达到的最佳效果，理论上支持使用pbr材质以达到次世代效果；  \n    已有SDK在英伟达板子上初步运行图片已发Monica；\n*   新增本地语音交互方案  \n    **虚拟人公司**：本地TTS缓存，要精简指令数。  \n    q：是否能针对少数指令做缓存？还是需要对整个指令库做缓存？  \n    a：部分指令缓存在技术实现上没问题。\n\n*   新增SDK接口或功能  \n    q：“支持新增位置类型滑块的解析工作”与需求4中”新增虚拟人方位编辑功能“有什么关联？  \n    a：一条是saas平台的一条是炉端的，相互关联。\n\n决议项\n\n1、需要虚拟人公司针对每个功能提供更具体的功能说明文档；\n\n2、如相关需求确定并完成商务沟通，在后续开发实施过程，需要由影子的人参加涉及的设计评审。\n\n材料（附件）\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}