{
	"title": "第五十、五十一周读书笔记",
	"author": "王宇",
	"publishTime": "十二月16,2022",
	"readTime": "12s",
	"tags": "[\"邹正清\"]",
	"description": "邹正清",
	"article": "《场景革命》\\_吴声读书笔记\n==============\n\n本书主要从进入移动互联网时代后正在发生的场景革命、支撑场景的四大核心要素、构建场景的四即方法论、以及场景的商业应用等四大维度论述，每个维度下有子维度及具体案例。个人感觉核心要素及四即方法论是本书的核心内容：\n\n1、到底什么是场景？\n----------\n\n场景本来是一个影视用语，指在特定时间、空间内发生的行动，或者因人物关系构成的具体画面，是通过人物行动来表现剧情的一个个特定过程。在互联网中，场景表现为与游戏、社交、购物等互联网行为相关的通过支付完成闭环的应用形态。\n\n在本书中，作者认为至少具备四个特点：是以人为中心的体验细节；是一种连接方式，是价值交换方式和新生活方式的表现形态；也需要时间、地点、人物、事件、连接方式等五要素。\n\n2、什么是支撑场景的核心要素？体验、链接、社群、数据；\n---------------------------\n\n### （1） 体验美学重塑新的商业价值逻辑\n\n场景颠覆传统流量入口，反应的是这个时代的消费精神的变化，是基于体验美学的[场景经济](https://www.zhihu.com/search?q=%E5%9C%BA%E6%99%AF%E7%BB%8F%E6%B5%8E&search_source=Entity&hybrid_search_source=Entity&hybrid_search_extra=%7B%22sourceType%22%3A%22article%22%2C%22sourceId%22%3A%2292234253%22%7D)范式。为用户提供价值，需要新场景的解决方案—为用户创造超越期待的体验，建立与消费者的情感连接。\n\n### （2） 空间链接变成新场景的定义指导\n\n团购、打车等场景背后隐含了互联网时代生活方式和消费形态的升级，这种变化更多时候带有极强的赢家通吃效应和链接的乘法效应。\n\n### （3） 社群，是场景的动力机制\n\n我们要思考，到底是流量需要我们，还是我们需要流量？商业的本质，就是忘掉生意，忘掉利益，去思考我们和拥护者的底层关系。\n\n### （4） 数据，让场景精确匹配用户需求\n\n今天是一个数据运营、用户经营的时代，场景的背后是可量化的数据。数据流动性越强，生成的结构性也越多；使用者关系越清晰，新场景的创造性也越清晰。举例喜马拉雅、凯叔睡前故事；\n\n3、如何构建场景？场景重构4P，演化为产品即场景，分享即获取，跨界即连接，流行及流量。\n-------------------------------------------\n\n### （1）产品即场景\n\n产品等于场景的解决方案，并成为产品研发的核心能力。需要在场景中提炼产品的核心能力，然后不断迭代出新场景。场景不存在线上线下区分，其核心是以用户体验、场景粘性为中心的解决方案。\n\n### （2）分享即获取\n\n[分享经济](https://www.zhihu.com/search?q=%E5%88%86%E4%BA%AB%E7%BB%8F%E6%B5%8E&search_source=Entity&hybrid_search_source=Entity&hybrid_search_extra=%7B%22sourceType%22%3A%22article%22%2C%22sourceId%22%3A%2292234253%22%7D)时代，分享越多，获取越多；越分享，越获得。分享注定成为场景红利的神经中枢。分享最大的主体，不是企业或第三方的广告中介，而是人。\n\n### （3）跨界即连接\n\n跨界深度形成西index定价依据和定价能力。在营销层面看，每个品牌都可以互为连接的渠道，品牌动力机制被跨界迅速激活。\n\n### （4）流行即流量\n\n微信是强关系的隔绝生态。当场景有足够的内容价值，就能够形成穿透力，击穿隔绝生态，通过社群动力完成一次引爆式流行。\n\n传统商业模式的4P，产品，价格，渠道，促销（营销）等方式被场景革命重新塑造。产品维度，是基于产品即场景的解决方案，流量也因此场景化；价格维度，是基于场景的分享即获取，同时包含分享成本和信任溢价；渠道维度，是跨界和链接，连接无限可能。营销维度，流行即流量，场景流量引爆品牌。\n\n  \n\n《结网》\\_王坚读书笔记\n============\n\n一、职业选择\n======\n\n 产品经理日常的工作任务有哪些，并按照时间跨度的方式将产品经理的工作内容描述为三大部分：战略性工作、阶段性工作、日常性工作；通过王坚的描述展示了产品经理何必是高层管理人员，产品经理在项目或企业中发挥着重要作用。（当然也可能是毫无作用甚至是负作用）。仔细要认真看，其实对于我这样的人来说，还是云里雾里的，感觉跟产品所有相关的内容，产品经理都能插上一脚。\n\n第二小节介绍了互联网产品经理的职业发展路径；\n\n第三小节摘抄两句话：机遇只光顾能力上做好准备的人、创造用户价值是第一要务\n\n（一）名词定义\n-------\n\n**战略性工作**：跨越产品的整个生命周期的工作，主要有：为产品建立长期的战略布局、发现新的产品机会、为产品的演变增强和引进提出建议；\n\n**阶段性工作**：有明确的起始时间，包含以下几部分内容：1、参与新产品的开发；2、参与年度商业计划的制定；3、利用公司内部、外部资源开展营销活动；4、预测竞争对手的行动并制定对应方案；5、更新产品并进行相应的用户教育；6、降低成本；7、重新规划产品线；\n\n**日常性工作：**1、收集分析竞争情报；2、协调开发、运营、客服、销售等资源保证产品正常运作；3、执行商业计划（目前的弱点）；\n\n（二）个人思考\n-------\n\n1、过去我对于产品经理其实只有一个认识——如何打造一款极简的产品。但通过第一章这样了解，产品经理的工作并不简单，对外部你要能对竞争对手有深刻的认识了解，如何打造自己的产品，对内你要做得有说服力，让这款产品相关的开发，ui朝着一个方向前行，实现产品价值；总之，一个好的产品经理至少该做到的是使大船朝着一个方向划，而这的前提是团队基于对你的认可。所以加油把，先努力充实自己，方方面面。\n\n二、创建互联网产品\n=========\n\n讲述了产品的生命周期，从概念的提出-验证-开发-上线-数据分析-版本迭代。书中大部分时候都在表述的内容是——不要重新发明轮子，更好的产品应当是模仿。“敢为天下后”也不失为一种创新，并不是人人都是乔布斯！\n\n新人产品经理表示这部分内容确实很有帮助，即使很多公司实际的产品经理工作并不是如此，但实际上也大差不差，帮助我这等新人对自己的工作流有一个大概的认识，同时我认为书中提到的框架图、pdca进度管理也很受用，先学者用这些基础流程来规范自己的职业开端或许很有帮助。\n\n还有谨记：**用户体验的三要素：别让我等，别让我想，别让我烦。（不仅是互联网的）**\n\n（一）名词定义\n-------\n\n**产品业、服务业、体验业：**”如果你为物品和有形的东西收费，那么你所从事的就是商品业。如果你为自己开展的活动收费，那么你所从事的就是服务业。只有当你为消费者和你在一起的时间收费时，你才算进入了体验业“\n\n**强需求、弱需求：**强需求就是一天要吃三顿饭、出门要揣着手机，弱需求就是找个时间去公园逛街；\n\n**频发需求、非频发需求：**频发需求就是一天要吃三顿、牙齿要一天刷两次，非频发需求就是明年回老家结婚；\n\n**产品设计文档：**产品设计文档是伴随产品整个生命周期的链接概念而执行的重要工具，它帮助产品团队与研发团队和高层领导达成共识，进而明确研发计划并指导研发过程。\n\n**项目经理：**是利用有限的资源在限期内把事情做成的专家，他只对项目负责\n\n（二）个人思考\n-------\n\n用户体验影响产品口碑，口碑影响产品成败，产品城北影响产品经理的利益。里面关于如何做产品，你的产品怎么样或许每一个产品经理都可以把自己的产品拿来一一比对，就能知道你的产品是否具有意义。\n\n深度的、频繁的使用自己的产品是一名产品经理应该养成的职业习惯之一，产品经理需要做到”春江水暖鸭先知“\n\n但是要警惕的是，**一些产品经理并不是自己所负责产品的用户，他们有很多理由，比如当局者迷旁观者清、爱上自己的产品会把缺点当成优点等等。**\n\n三、个人修炼\n======\n\n1、面对逆境需要两种能力：正反馈、鉴定的信念\n\n2、沟通遵循平等原则、相容原则、互利原则、信用原则 SMART  S-具体的  、M-可衡量  、A-可实现、R-相关性、T-时限性\n\n3、创新\n\n4、自省\n\n5、练习 （一定要刻意练习）\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}