{
	"title": "场景革命学习笔记-2023/02/27",
	"author": "王宇",
	"publishTime": "二月27,2023",
	"readTime": "12s",
	"tags": "[\"黄婷\"]",
	"description": "黄婷",
	"article": "**前言 后连接时代的造物逻辑**\n\n1.  你之蜜糖我之砒霜：场景造物的生态逻辑\n2.  情感连接：场景造物的体验逻辑\n3.  需要到想要：场景造物的人格逻辑\n4.  社群动力学：场景造物的势能逻辑\n\n  \n\n**第一部分** **正在发生的场景革命**\n\n**被互联网定义的新场景：**\n\n1.  场景是最真实的以人为中心的体验细节。场景依赖于人，没有人的意识和动作就没有场景。\n2.  场景是一种连接方式。\n3.  场景是价值交换方式和新生活方式的表现形态 。\n4.  场景构成堪比新闻五要素，时间、地点、人物、事件、连接方式。\n\n场景本质是对时间的占有。拥有场景就拥有消费者时间，就会轻松占领消费者心智。\n\n  \n\n**第一章** **长在朋友圈中的碎片化场景**\n\n能不能找到自己的场景，会证明自己的生活价值或者“无意义”能否被自己爱上。这些有情怀的产品和场 景本身就是存在，更是移动互联时代我们与世界最真实的连接。\n\n  \n\n**第二章** **共享经济崛起的****DNA**\n\n共享经济最大的吸引力在于灵活性：任何人都可随时参与，并受益其中。\n\n这不只是因为共享经济与生俱来地具有可以灵活配置闲置资源、实现利益最大化的经济效率模式，也是因为它永动机般不断重构我们出行、休闲和社交的场景。这一重构的本质就是场景中产品与产品、人与人、人与货物、人与城市的连接方式在不断改变，连接的便捷程度与撮合连接的能力都在不断强化。\n\n  \n\n**共享经济崛起的两点核心逻辑：**\n\n1.  “场景”是共享经济商业模式创立的重要工具。新的场景意味着新的连接方式。因为人们越来越需要新体验和更高的效率，满足更高效率和更新体验就意味着重新定义新场景，重新建立新的连接，所以创设新场景成为新产品和新服务的关键要素。\n2.  基于新的用户需求和用户体验，以共享经济的逻辑，形成了一种全新的产品打法和场景分类。新的场景感不仅在连接体验和细节层面更加大胆、更加真实，而且超越了我们以往对场景的分类。因此，场景成为新商业模式指数级增长的关键词，或者说场景成为新商业模式的基础出发点。\n\n  \n\n**第三章** **颠覆传统互联网入口的核心逻辑**\n\n移动互联网时代，场景作为重要入口，颠覆了PC时代的流量逻辑。\n\n**场景入囗逻辑以此为基础，尤需要把握以下三个原****则****：**\n\n1.  不再是简单执着于产品研发，而是专注洞察新的场景可能。\n2.  不再是拘泥于自我本位诉求，而是激发用户主动传播分享。\n3.  不再是红海竟争性流量获取，而是新品类独占新场景红利。\n\n  \n\n**第二部分** **支撑场景的核心要素**\n\n塑造场景化必须同时具备4个核心要素：体验、链接、社群、数据。\n\n  \n\n**第四章** **【****体验美学****】****重塑新的商业价值逻辑**\n\n今天说的产品创新，是指新的品类或者是跨界的混搭。之所以能够形成这些创新，就是因为今天的**场景体验构成了商业价值的首要维度**。我们判断人的社交活动、娱乐活动、商业活动，乃至互联网上的虚拟活动时，体验都是理所当然的核心标准。**基于此的定价规则也由价格敏感性变为价值敏感性。**\n\n摒弃传统的流量思维，要为用户创造新价值。如何做到这一点？场景的解决方案正是为用户创造卓越的体验，**我们可以从如下三个方面来塑造用户的卓越体验****:**\n\n1.  **塑造体验的层次感，体验的层次感决定了场景的真实性：**正是这种连环场景中构建的体验感层次，决定了场景的真实性。体验层次表现为，体验带给用户的 满足从功能到利益、从信任到知识层层递进。能否成为真实场景，取决于体验感的这种层次组合是否可持续。\n2.  **体验要有细节，细节足够真实，才能吸引用户加入：**不仅是层次，体验还要有细节才足够真实，从而吸引用户加入。因此细节是场景成为流量入囗的要点所在。细节就是基于场景的互联网入囗。关系标签，就是一种体验细节的亚文化符号。在这种关系标签迭代的背后，是流量入囗的消费逻辑和细节的变化同步更替。\n3.  **提供基于长期消费伴随的拥护者养成类体验，并把控制权交给用户。**\n\n  \n\n**第五章** **【****空间链接****】****变成了新场景的定义指导**\n\n网络环境和生活空间正不断融合，带来新的跨界，从而定义全新的场景，也帮助我们创造全新的品类。\n\n*   链接的乘法效应是移动互联时代的指数思维\n*   O2O是以人为中心的线上线下接触点管理逻辑：究竟哪个O是Online还是Offline并不重要，重要的是消费者的接触点管理、消费者的支付依据和支付逻辑。有支付场景，才能形成一个完整的消费闭环，这就是移动互联时代倡导的全渠道链接概念。\n*   泡沫意味连接红利的可能：有泡沫就恰恰证明了市场的显性化存在，没有泡沫哪有红利可言，没有泡沫更无顺势而为。  \n     \n\n 空间的链接方法实质是通过场景几何级数增长来生成衍生巨大增量的市场。**我们可以从四个方面来完成空** **间链接：**\n\n1.  让场景演进为生活方式，就会连接出新的产品机会和产业价值。\n2.  场景标签化，把场景塑造成亚文化载体，就会形成主题定价模式。\n3.  基于用户为中心的全渠道化，让线上模拟线下，让线下对标线上，让移动端改造PC端，用垂直整合的方式 让全渠道变成场景乘法。\n4.  多屏联动也是空间链接指数级增长的具体表征。从PC端，到手机屏、iPad，再到智能电视、车载显示屏， 每增加一个信息承载与互动体验的分屏，就意味着多一个乘法指数。在这个过程中，用户持续的跨屏迁移与互动， 以及相应地在横向空间、纵向时间上的衔接与整合，本质上是在争夺更多信息空间产生的用户黏度，及其带来的溢价。\n\n  \n\n**第六章** **社群是场景的动力机制**\n\n如果场景自身不能具备一种**亚文化的力量、亚群落的表征和社群感**，它将不具备拥有大规模用户和商业应用的可能。\n\n社群形成的势能，是推动场景商业化的动力，没有社群，场景就无法形成势能。\n\n有亚文化能力的产品形态和有亚文化特征的表达，往往占据着营销最有利的地形，可以轻松脱颖而出。\n\n**理解移动互联网时代的消费精神，这种精神具有六个鲜明的特点****:**\n\n1.  “想要”而不是“需要”\n2.  追求即视感，所见即所购。\n3.  态度比功能重要\n4.  追求价值敏感性而非价格敏感性\n5.  自我表达与小众认同超过大众评价。\n6.  社交网络评价大于现实沟通评价。\n\n这种消费精神的外在表达，恰恰是社群感、亚文化这种可复制、大规模传播的内容，使得用户被卷入。\n\n  \n\n**塑造场景力**\n\n个性化的场景生态是**以人为逻辑、以体验为核心、以连接为中心、以社群为最大公约数**的商业环境。今天判断一个企业能否进行产品迭代，能否快速形成一种消费主张，很多时候是看它**对场景本身的定义能力和对亚文化社群的影响能力**，我们称之为**场景力**。\n\n  \n\n**认识社群的本质****:****同义反复的生态**\n\n社群是场景的商业动力，是新商业生态的DNA，其本质是同义反复的生态，借此形成大规模的内容传播和用户参与，是场景力以社群形成的亚群落内容重新定义商业形态\n\n**冷冰冰的科技产品又如何通过群落进行传播****?**\n\n传统上，我们强调产品的科技感很强，但今天依靠科技感很难凸显产品的差异化。\n\n但是如果产品能够人格化，将它变成连接的标签，抑或变成了一种小众生活的态度，这时定价策略就会变化。只要是基于价值的敏感性，我们传统的加价率和毛利率考核法则，就会发生翻天覆地的跃进。当我们有足够的内容价值，产品就会有人格的魅力，甚至有温度感和参与感，我们就可以获得超额的利润。当然也许有人会说，这是不是意味着我们可以无限提高定价呢?不是，恰恰我们应该以更高的性价比，来定义我们和拥护者之间的关系。\n\n**用社群引爆话题营销**\n\n“爆品”的质量要比其他商品好，价格要比其他商品便宜，这样才能走量。爆品代表了最富性价比的用户获取能力。\n\n到底是流量需要我，还是我需要流量?我们对流量嗷嗷待哺的同时，必须看到流量对我们也是望眼欲穿。\n\n商业就是忘掉生意、忘掉商业，是要去思考我们和拥护者的关系。用户不再是用户了，而是拥护者，品牌也不再重点突出自己产品的功能，而是要突出它和用户有情绪共鸣的结合点。\n\n  \n\n**第七章** **数据让场景精确匹配用户需求**\n\n数据流动性越强，生成的结构性也越多，使用者关系越清晰，新场景的创造也越清晰。\n\n1.  塑造可量化的全场景体验\n2.  精准的数据匹配精心设计的场景\n\n  \n\n**第三部分** **构建场景的四即方法论**\n\n四个“即”：**产品即场景**（产品等于场景的解决方案）**、分享即获取、跨界即连接、流行即流量**（流行成为流量的新入口，只有占据亚文化流行趋势的制高点，才能掌控流量的话语权）。\n\n  \n\n**第八章** **产品即场景**\n\n**产品的功能属性****(Inside)+****连接属性****(Plus)=****新的场景体验**\n\n**场景解决方案成为我们产品研发的核心能力，**对我们既往的产品思维是一个极其重要的考验。\n\n所以，在场景中，我们需要找到产品的核心(inside)能力，然后不断 Plus出新的场景，即产品的功能属性(Inside)+连接属性(Plus)=新的场景体验。找到产品对自身独特标签(inside)的定义能力，并通过场景找到产品的 PIus 方向，这毫无疑问是今天丰富新产品的一个重要方法和工具。\n\n那么，**如何为产品找到****Plus的机会?**在用户某个生活环节中(即场景)，适时提供其可能需要的以及关联的产品或服务(即产品)，便能获得最大的爆发能量。具体可以从3个方面入手：\n\n1.  找到消费者场景体验的痛点。\n2.  细分消费者需求\n3.  确定场景的呈现细节\n\n细分人群的生活方式和场景黏性可以轻而易举地造就一种现象、一个成功品类。所以，根本不存在 020所谓线上与线下的隔断或区分，重要的是以用户体验为中心、以场景黏性为中心的解决方案。\n\n  \n\n**第九章** **分享即获取**\n\n“分享思维”是互联网的核心精神之一，在分享模式下，资源越用越有价值，分享就是获取。分享最大的主体不是企业或第三方广告中介，而是人。当人变成了新的渠道，用户是传播者、分发者抑或营销者都已不再重要，重要的是彼此的信任和人格背书。我们的分享，会形成我们的社交价值。这里的人格关系，在社会化的网络中得以指数级放大，这也是今天场景在分享中爆发的源动能。\n\n过去，我们为广告头痛不已。如今，当我们主动分享被称之为有内容、有价值，被定义为经验、攻略的信息时，**广告的逻辑也被颠覆**了。一方面，这是一个信息超载的时代，另一方面，正是因为信息的爆炸，对可信任信息的筛选就会成为达人电商的由来，进而成为新商业模式的机会。\n\n场景时代，企业获取新客户，个人获取影响力的渠道，都在发生深刻的变革。想要**通过分享去构建新商业模式或形成营销创新，可以从以下几个方面入手：**\n\n  \n\n*   **基于人格背书的分享：用户处在自己的亚群落之中，只有基于真实场景的分享才会带来信任溢价。分享即获取，并不仅仅是意见领袖可以分享，更多时候是基于每个用户人格背书的分享。只要有稳定的信用，就意味着可以长久收获信用带来的溢价。**\n\n*   分享有效的信息和资源：不仅仅是“钱”，要更多地分享信息和资源，分享的内容可以更加广义化，是攻略、心得或影评，或者是品牌的自身资源与渠道。\n\n*   找到分享的杠杆能力和乘法效应：越分享，连接的机会越多，互为渠道的结合点就越多，更容易把有限的市场预算变成乘法效应，这就是分享的逻辑。\n\n  \n\n  \n\n**第十章** **跨界即连接**\n\n跨界即连接，不仅仅是我们个体之为个体、社群之为社群、内容之为内容的依据，也是今天的产品新逻辑。在跨界生态下，我们能看到新鲜的场景，陌生的细节，能够形成微妙的情感和体验，能够带来零售业最关注的毛利率。\n\n互联网时代的确是一个跨界整合的时代。随着物质生活的极大丰富，为了满足马斯洛需求层次理论中的高阶需求，消费不仅是简单的商品买卖，消费者更要享受买与卖的过程价值，因此个性化需求和情感需求被日益放大。\n\n所以在场景时代，跨界不只是营销，而是所有维度的常态，更是产品常态。从渠道和自身资源的角度考虑，每个品牌都可以具有互为连接的渠道，品牌动力机制被跨界迅速激活。\n\n品牌能不能通过横向的连接成就跨界的信任，能不能从流量的批发进化到人格的背书，是获取新的定价依据和定价能力的关键。\n\n  \n\n**第十一章** **流行即流量**\n\n在流行即流量的“造场”运动中，我们应该\n\n**1.相信亚文化的力量：**\n\n个体的泛社群化、亚文化特征才是场景电商崛起的核心驱动力。而且，它本身就是流行和主动搜索带来的流量。并不是流量不值得购买，关键在于产品自身能否形成一种主动搜索的意愿，能不能催生流行的指数，能不能形成基于这种指数的品牌力。\n\n**2.找到品牌的拥护者：**\n\n我们要思考怎么去挖掘、创造自己的流行、亚文化和引爆能力，如何去找到我们的拥护者而不是用户。不为输赢，只为认真。也就是说，场景流行最重要的是亚文化现象和拥护者之间是真实的情感关系一这种亚文化甚至是拥护者自愿去催生的亚文化。\n\n**3.流量新入口逻辑来自于人和人的口碑相传：**\n\n我们需要深刻理解今天所有的营销问题都是战略问题，深刻理解原来营销等于互联网内容产品的打造，惟此，流量的增长才会真实可信，也可感可行。\n\n  \n\n**第四部分** **场景的商业应用**\n\n  \n\n**第十二章** **场景重构商业模式**\n\n**社交媒体**是场景时代必不可少的要素，用户不断通过各种社交平台明确自己的喜好、所处的位置以及所寻求的生活方式。\n\n场景时代的到来，意味着全渠道的溶解与融合，意味着场景争夺成为今天商业升级与创新的必由之路，这是场景商业应用中不可逆转的趋势。\n\n**传统商业模式的产品、价格、渠道和营销方式将被场景革命重新塑造**。产品维度，是产品即场景的解决方案，流量也因此场景化;价格维度，是基于场景的分享即获取，同时包含分享成本和信任溢价，渠道维度，是跨界即连接，连接无限可能。营销维度，流行即流量，场景引爆品牌。\n\n**战略、产品、渠道、营销、流量、品牌****，这些我们耳熟能详的关键词，都在被颠覆。**\n\n  \n\n*   **场景定义=战略**\n\n  \n\n身处场景时代，定义场景成为一个基础动作，**定义什么样的场景就意味着要做什么样的事情和不做什么样的事情，也决定了企业和品牌的战略方向。**\n\n  \n\n*   **场景方案=产品**\n\n  \n\n定义场景是战略，特定场景的应用方案就是产品或者服务。只要是满足一种特定场景的解决方案，产品本身就具备了可交换的价值和可购买的理由。而这种可交换的价值、可购买的能力，也意味着用户须为场景解决方案付费。\n\n产品成为场景解决方案中最重要命题和基本逻辑，也就是让产品和服务回到与用户连接的原点角度:用户参与更加前置，即从产品和服务的研发阶段，就把场景和用户的需求连接在一起。\n\n  \n\n*   **场景动能=渠道**\n\n  \n\n渠道的核心是流动，包括商品的流动，也包括信息和资金的流动。传统营销思维下营销和销售的通路是分开的，即商品和信息的流动是分开的。场景思维下，商品和信息的渠道却是融合的。我们理解的渠道，已经不在乎天猫还是京东，微信还是微博，更多是关注渠道能不能让人感觉到连环场景和连续转化。\n\n我们反复强调这个时代商业活动的核心是人，那么人的动作就是场景的核心，这个动作包括线下的行为，也包括线上的点击和触摸。所以，**今天渠道的关键已经不是静态的销售平台，不是互相区隔的营销通路，而是人的传播分享形成场景的链条：**让不理解这个场景的人去理解这个场景，喜欢这个场景和接受这个场景，让喜欢的人去解释，去分享这个场景;让场景的偏好者主动去推广，主动去复制。这时，场景才真正具备动态的能力和能量，从而形成新的渠道价值。\n\n场景越有传播能力、越有动能，渠道越容易形成。**判断一个场景是否有传播能力和动能，有以下三个标准****:第一，这个场景本身是否有内容，让人有转发的欲望，第二，这个场景本身是否足够真实，让人有体验的动力;第三，这个场景能不能形成一种基于亚文化的人格，让人能够感受到一种温度，愿意参与和亲近。**场景中这样的内容越多，传播就越有动能，那么渠道力就越强。\n\n所以，本质上场景变成了传播的接触点和分享的触发点。\n\n  \n\n*   **场景势能=营销**\n\n  \n\n具备传播能力和场景动能的渠道代表着临门一脚的可能性，但**势能代表的是连环过程中品牌、用户愿意去连接场景的可能性，因此场景势能是营销的核心。**\n\n  \n\n*   **场景细节=流量**\n\n  \n\n这个命题与场景动能等于渠道，场景势能成就营销具有相关性:技术和商业的进步，使场景与消费者的接触点越来越具体，而越具体，转化率就越高。\n\n场景细节的核心是体验的细节，体验的细节形成了决策的依据，决策的依据就是营销的临门一脚，最终转化成高质的流量。\n\n  \n\n*   **场景故事=品牌**\n\n  \n\n场景故事等于品牌，也就是说在场景理论中，**消费者对品牌的感知已经不仅仅是对形象的感知，而是对品牌的故事、温度、人格等综合维度的感知。**\n\n无论个人品牌，还是产品品牌，都在突出场景故事。**场景故事中，产品不是第一要素，关键是我们赋予产品什么样的连接场景，其核心要义特别简单****:让品牌更加有魅力，更加有人格，更加体会到场景的温度感。**至于具体的讲述方式:可以是故事的文案，让品牌更加有情怀，更具有人格魅力;也可以是场景无所不在的表现细节,可以是图片、视频、音频等一切可呈现的表述形式。\n\n  \n\n*   **场景用户=社群**\n\n  \n\n场景对用户进行了重新的格式划分。**场景思维下，品牌面向的目标用户更多时候是对不同细分场景的聚焦，**如同在不同线下环境的不同人群，会因为喜欢同一个产品或者同一类服务聚集在某个线上社区，这就是一个社群。**社群的形成，可能是基于这个场景拥有共同的价值观，或是对这个场景倡导的生活方式有着共鸣。**\n\n社群激活的不仅是一种连接属性，也包括了一种集群价值和动能。清晰定位场景的特定用户，有意识去经营社群与用户，我们就能比较方便地创造新的场景需求、新的品类、新的定价方式、新的渠道，从而形成一种正向循环和反馈。\n\n在一个场景中，用户基于同一个亚文化的需求，就容易形成社群，但**社群需要平台有意识地去运营和组织，才能让这个社群的动能持续累积和沉淀：**\n\n*   首先，**品牌要准确认识自己的产品，只在用户需要时才出现**，在无须产品和服务的场合，要“安静地做一个美男子”，所谓“行于所当行，止于所当止”，这是微博表现。\n*   其次，**要时刻洞察社群体验，使品牌****/****产品的内容、活动本身成为社群的需要**，成为社群存在的价值，从而带动用户的主动参与，这是百度贴吧表现。\n*   最后，**基于社群价值做内容建设和内容运营**，社群的内容能力是价值所在和动力所在，没有内容，也就不存在社群，这是微信公众号表现。\n\n  \n\n**第十三章** **场景在商业应用中的分类（上）**\n\n从上门的美甲场景切入，是在获取信任，获取用户的黏性，获取高频带动低频场景的能力。**高频场景是用来获取新客户，**河狸家因此不收美甲佣金。**通过高频场景获取用户后，可以选择在低频场景获取较高的毛利率和客单价****。**\n\n当场景从低频变成高频，从轻度变成重度，在类似的场景转换过程中，蕴含了大量的商业机会和创业机会，代表了一种新的风口能力和红利价值。这个话语体系也叫“互联网+”。\n\n品牌要真实地建构和消费者的情感联系和家庭的场景连接，然后围绕这种联系和链接，生产创造出相应的互联网内容，构建自己特立但不独行的商业模式。这些逻辑的第一步，是我们要**对自身可能连接的场景有明确的定位和细分**。\n\n  \n\n*   **通过“高频场景”获取用户**\n\n  \n\n高频场景是单纯按发生频次细分的场景，因发生率高，容易获取用户\n\n  \n\n*   **通过“低频场景”获取高毛利**\n\n  \n\n低频场景虽然发生率低，但由于场景本身的稀缺性，往往存在严重的信息不对称因而具有高客单价的机会，也是最容易被移动互联改造的机会场景。\n\n  \n\n*   **通过“重度场景”形成产业链**\n\n  \n\n高频场景再进一步，与生活方式息息相关、每天都会接触的场景，可称之为重度场景。重度场景容易形成产业链。\n\n  \n\n*   **通过“轻度场景”形成壁垒**\n\n  \n\n轻度场景一般指生活中某些特定的场合，轻度场景通常意味着稀缺，但并不代表价值缺失。轻度场景改造之后容易形成一种先到者先得的壁垒。\n\n无论如何，由于消费频率低，尤其具有特定的体验需求时，用户对低频、轻度场景提供产品或服务的质量就会很在意。这时，用户对产品价值的关注往往会高于对价格的关注。如果品牌能够与用户达成情感共识、提供尖叫感的产品或服务，就可以获得丰厚的回报。所以，**低频、轻度场景的难点是在消费者非常少的重复消费需求下，如何有效地到达消费者。**\n\n  \n\n**第十四章** **场景在商业应用中的分类（下）**\n\n**密度场景**是基于社群连接，能够串联起不同生活情景的情感场景，它代表与用户情感连接的强度和密度。\n\n能够真正打造场景的定义能力和情感连接能力的，恰恰就是密度场景。开发基于密度场景的应用，实现多点的连接、连通和互动，是场景应用开发的核心标准(当然前提是我们的用户量和流量能力足够真实)。\n\n对有情感连接价值的密度场景的定义，永远是真实的内容触动大于形式的华丽炫目，而非形式大于内容;因此，以做一个好产品的态度和方式去做场景的定义及推广，附加的情感意义不是无病呻吟，而是基于功能的沉淀。\n\n密度场景的相对表达是**广度场景**，比如说软饮、可乐、咖啡等，它们重复消费的频次高，但本身并不具备特别的情感意义和价值。\n\n从商业价值角度的考虑出发，所有的**广度场景也都要向密度场景转型，以实现一种连接的亲密感，从而提高场景中产品或服务的附加值。**\n\n**如何完成从广度向密度的转型****?**\n\n核心方式是跨界和混搭，通过更有深度、更加强势的连接，产生新鲜度。\n\n  \n\n**第十五章** **场景成为传统产业转型为数不多的机会**\n\n传统产业转型的关键一步就是，能否在品牌现有的产品和服务所提供的价值之外创造基于新场景的附加价值，并为消费者创造独特的体验。\n\n**传统企业转型中场景重构的五个维度**\n\n**1.组织构建方式的改变****:从稳固的组织边界进化为跨组织的合作****：**传统企业在移动互联时代转型所面临的最大难点，是组织结构的改变。因为传统产业代表着存量，代表了相对稳定的思维方式，也代表了相对固化的组织结构和组织安全区。我们要形成跨组织的合作关系，用需求和场景去连接，组织的边界才会溶解且更有效率。\n\n**2.产品定义方式的改变****:从功能进化为场景解决方案****：**产品不再以功能为中心，不是功能不重要，而是因为功能变成了基本参数。\n\n**3****.****渠道拓展方式的改变****:****从传统中介进化为圈层化的新接触点管理：**关键是消费者在哪里?消费者的接触点就是我们的管理半径所及。\n\n**4.客户经营方式改变****:从传统的CRM进化为社群运营和亚文化建设****：**用户经营不再是简单的CRM或可有可无的客服了，它已成为品牌的生命线。不能建设有黏性的社群，进而激活企业与用户连接的文化密码，品牌就会衰落，混然众人。\n\n5.商业模式(或盈利能力)改变:从传统的售卖逻辑进化为数据经营逻辑：传统商品的计件模式和传统渠道的层级化加价模式正在失灵。不断奏效的是对用户数据的挖掘和经营。\n\n  \n\n**让自己成为成就年轻人的平台**\n\n因为智能手机的大行其道，因为社交网络的蓬勃发展，所有的口碑都能够在一瞬间传播到五湖四海，原来老客户的关系管理已经变成了获取新客户最重要的手段。\n\n时代已经变了，**未来的商业模式是所有的产品从一开始就是在迭代，从开始就是未完成。**所以，回到**本书的核心问题**\n\n*   **产品是什么****?是场景，场景的解决方案。**\n*   **渠道是什么****?是人，是人与人的互动性，**场景触发的一种新连接，应用轨迹形成的连环场景，人是渠道的核心。\n*   **研发是什么****?研发意味着用户的大规模参与，**研发本身意味着各种利益相关者共同的合谋和基于场景最真实的一种还原\n*   **营销是什么****?营销是基于热点的迅速转化，是基于互联网的内容产品,**只有内容，才能在互联网场景引爆流行。\n*   **品牌是什么****?其实已经没有品牌、没有商标了，所谓的差异化和识别性**，在人群中气味一闻便知。是不是我的菜?是不是同行?是不是同道者?\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}