{
	"title": "5、跨设备与多模交互",
	"author": "王宇",
	"publishTime": "七月31,2023",
	"readTime": "12s",
	"tags": "[\"多模交互设计知识学习\"]",
	"description": "多模交互设计知识学习",
	"article": "*   1[第六章 跨设备和多模交互](#id-5、跨设备与多模交互-第六章跨设备和多模交互)\n    *   1.1[6.1 跨设备交互](#id-5、跨设备与多模交互-6.1跨设备交互)\n    *   1.2[6.2 跨设备和多模交互细节的考虑](#id-5、跨设备与多模交互-6.2跨设备和多模交互细节的考虑)\n        *   1.2.1[· 结合用户场景考虑：](#id-5、跨设备与多模交互-·结合用户场景考虑：)\n        *   1.2.2[· 结合信息密度和显示距离考虑：](#id-5、跨设备与多模交互-·结合信息密度和显示距离考虑：)\n        *   1.2.3[· 考虑多个模态之间的过渡和打断：](#id-5、跨设备与多模交互-·考虑多个模态之间的过渡和打断：)\n    *   1.3[6.3 未来](#id-5、跨设备与多模交互-6.3未来)\n\n第六章 跨设备和多模交互\n============\n\n6.1 跨设备交互\n---------\n\n· 跨设备交互是指多个设备之间可以无缝连接和协同工作，比如苹果公司推出的Handoff、三星Galaxy手机和微软Windows 10操作系统实现跨系统对接、华为的多屏协同功能。\n\n· 多模交互是从人的角度管理交互的焦点和状态，跨设备/任务交互是从机器的角度管理交互的焦点和状态，所以它们是息息相关的。  \n![](/download/attachments/105272075/image2023-7-31_17-46-38.png?version=1&modificationDate=1690796798776&api=v2)\n\n· 跨设备研究术语和本体：\n\n![](/download/attachments/105272075/image2023-7-31_17-46-53.png?version=1&modificationDate=1690796814152&api=v2)\n\n· 跨设备设计空间维度分类法：（六个维度）\n\n*   时间（Temporal）和配置（Configuration）：跨设备交互基于时间维度可以分为同步交互和异步交互，而配置维度是对跨设备系统的实际设置及输入/输出模式的使用方式进行分类。\n\n*   （1）同步交互主要分为镜像和分布式用户界面（Distributed User Interface）。镜像就是两个设备看到的界面是一样的；分布式用户界面是指对界面元素、界面控件和逻辑进行分布式设计，其中响应式设计是最重要的设计手段，把相同而内容通过不同的布局结构显示在不同大小的屏幕上（边看电视边用手机发弹幕）。\n*   （2）异步交互也分为两类，允许跨设备迁移的用户界面和可以在各种操作系统上一致运行的跨平台应用。比如苹果的Handoff（接力）功能，在iPhone上复制一段文字或图片，在Mac电脑上可以直接粘贴；比如华为的多屏协同，将手机中的照片拖拽到电脑的PPT中。\n\n*   关系（Relationship）：利用不同的人与设备之间的关系进行分类。跨设备交互更多的是指一人多设备或多人多设备。在多人多设备的情况下，例如家庭、办公室、公共场所等，基于多模交互的体验设计需要考虑个人隐私和对其他人的干扰。\n*   规模（Scale）和动态（Dynamic）：动态会影响人和跨设备之间的距离，分类包括固定空间、半固定空间、临时/移动空间。\n\n*   当前固定空间主要研究对象是大型设备，这些设备的配置一般来说是固定不变的。\n*   半固定空间在一定程度上允许设备重新配置，如路由器、智能音箱等小型设备。\n*   临时/移动空间的研究则集中在便携式设备上，它们可以动态更改和重新配置。\n\n*   规模（Scale）：规模是指用户和设备之间的交互距离。设备应该根据交互距离做出不同的响应，可以参照美国人类学家爱德华·霍尔提出的空间区域距离。作者认为，人和机器之间的距离会成为是否开启人机对话的重要线索：\n\n*   处于社交距离及公共距离（大于120cm）时，设计对象应该保持沉默状态；\n*   处于远位亲密距离及个人距离（16~120cm）时，设计对象应该处于已激活状态，可以考虑适当主动地与用户进行交互（展示信息或打招呼）；\n*   处于近位亲密距离（0~15cm）时，设计对象与用户之间的信息交换应该毫无保留，适当增加主动与用户交互的次数；\n*   若有紧急状况或有定制的信息需要提醒用户，可忽略距离限制及时告知。\n\n*   空间（Space）：空间维度区分了同位交互（Co-located Interaction）和远程交互（Remote Interaction)。当前大部分跨设备工作涉及同位交互场景，甚少由远程交互的跨设备工作。\n\n![](/download/attachments/105272075/image2023-7-31_17-47-10.png?version=1&modificationDate=1690796830853&api=v2)\n\n6.2 跨设备和多模交互细节的考虑\n-----------------\n\n### **· 结合用户场景考虑**：\n\n跨设备交互一定会涉及到时间、空间和人三个因素，在设计交互任务或活动时，设计者可以问问自己以下几个问题：\n\n1.  当前用户在做什么？\n2.  如果用户的当前任务被打断，用户需要付出多少努力才能重新开始任务？\n3.  交互任务对时间的要求是否较高？\n4.  完成交互任务需要多久？\n5.  交互任务对用户产生的工作负荷是否较高？\n6.  空间内有其他人的场景下，交互任务是否会泄露个人隐私？\n7.  空间内有其他人的场景下，交互任务是否会影响到其他人？\n8.  哪台设备最适合发起交互？\n\n问题1~7，设计者在设计前应该从紧急程度、时间长度、工作负荷、隐私、干扰度等维度对交互任务进行优先级划分，避免多个设备产生的任务给用户生活带来过多的打断和干扰。\n\n问题8和多设备响应有关，解决方法一是给不同设备单独起名字，虽然有效但会增加用户的记忆负担；解决方法二是**设备仲裁**，即所有设备接收到指令后会自行选择最佳的设备和用户进行交互。设计设备仲裁时可以参考以下问题：\n\n1.  哪台设备最近被用户使用？\n2.  哪台设备距离用户最近？\n3.  哪台设备最近的使用频率最高？\n4.  被选择的设备拥有的模态种类是否满足信息展示的需求？可参考下表。\n\n  \n![](/download/attachments/105272075/image2023-7-31_17-47-23.png?version=1&modificationDate=1690796843577&api=v2)\n\n### **· 结合信息密度和显示距离考虑**：\n\n不同设备在相同时间内能展示的信息密度是不一样的，通常高密度信息显示在高分辨率屏幕上，这些设备一般包括麦克风和扬声器，可以实现语音交互功能；而低密度信息。用户和设备之间的交互距离也会影响信息接收的效率。\n\n**密度**\n\n**描述**\n\n**例子**\n\n**密度**\n\n**描述**\n\n**例子**\n\n低密度\n\n极其受限的信息输出，需要依赖外部环境及上下文表示含义\n\nNest恒温器、按钮开关\n\n标准\n\n提供的用户信息足以执行特定的任务，但几乎不提供其他上下文\n\n智能音箱\n\n高密度\n\n提供的信息和功能远超过完成任务所需的最小上下文数量\n\n手机、PC\n\n**距离**\n\n**描述**\n\n**例子**\n\n**距离**\n\n**描述**\n\n**例子**\n\n近距离\n\n用户必须在触手可及的范围内或与之接近的地方，以便与相关的输入传感器进行交互\n\n遥控器、手机、电脑\n\n混合距离\n\n该设备支持近距离交互和远距离交互\n\n带屏智能音箱\n\n远距离\n\n用户通常在与设备或界面距离0.6~3米远的地方进行交互\n\n智能音箱、体感游戏\n\n  \n信息密度和交互距离是影响用户体验的关键因素，Cheryl Platz提出了一个多模交互模型：\n\n*   第一象限：自适应交互。支持丰富的信息输出和远距离交互，自适应交互兼容远距离与近距离交互。设备需要拥有强大的硬件功能及提供给用户灵活的输入方式（比如语音交互）。\n*   第二象限：锚定交互。支持丰富的信息输出和近距离交互，用户通常和设备保持较近的距离，因此设计时可以考虑（1）使用较小的字号和较大的书面文本密度；（2）使用高分辨率的照片、视频或UI元素；（3）依靠物理输入设备（如触摸屏、键盘或遥控器）。要注意，**使用语音交互座位补充可以提高输入效率，但不意味着此时所有的人物都必须通过语音交互来完成**。\n*   第三象限：直接交互。有限的输出和近距离交互，以Google Glass为代表的AR眼镜就属于该象限。设备体积越小，处理能力越受约束，更需要其他设备的协助。\n*   第四象限：无形交互。有限的输出和远距离交互，智能音箱是无形交互的代表，不需要高性能芯片和高清屏幕，仅通过廉价的传感器就能帮助用户完成大量任务（设备可以通过LED灯光告诉用户当前的状态）。手势识别也属于无形交互的一种。\n\n![](/download/attachments/105272075/image2023-7-31_17-47-52.png?version=1&modificationDate=1690796872440&api=v2)\n\n· 如果设计的产品处于初期阶段，暂时没有锁定输入和输出能力，可以通过以下问题评估自己的产品更符合哪个象限：\n\n*   你的用户想要完成哪些任务？\n*   是否需要用到用户的双手？它们是空还是满？\n*   用户是否有可能承受很大的环境噪声？\n*   互动会围绕许多人进行吗？\n*   任务是否敏感或涉及安全检查？\n\n对于嘈杂、到处都是人的房间，锚定交互是较好的折中方案；如果是为了满足用户经常移动或忙碌的情况下使用产品，自适应和无形交互最为有用；如果是在特定环境下显示若干信息（例如床头显示时间），那么直接交互足够用了。\n\n### **· 考虑多个模态之间的过渡和打断**：\n\n· 模态过渡考虑的是关联任务之间的信息共享，信息可以在多个模态之间顺畅地流动，但不可避免地存在信息丢失或信息失去上下文的风险。\n\n· 模态过渡分为用户主动和系统主动两种情况：\n\n（1）用户主动：用户认为新的交互方式更容易或更适合使用，并主动更改当前的交互方式；  \n（2）系统主动：系统认为当前的交互方式不足以支撑并继续用户的活动，主动调整最适合的交互方式。\n\n· 无论是谁主动，最重要的是多模交互框架的设计，可以基于以下问题思考哪些场景下需要考虑模态的切换：\n\n*   当前的交互方式是否符合人体工程学？\n*   当前的交互方式是否会增加用户的工作负荷并造成危险？\n*   当前的交互方式是否是效率最高的？\n*   在多人环境下，当前的交互方式是否能保护用户的隐私？\n*   用户下一步采取的行动是什么？\n*   如果要切换模态，用户如何知道发生了改变？\n*   如果要切换模态，是否有失去上下文的风险？是否需要提示甚至警告用户？\n*   如果不能切换模态，如何提示甚至教会用户？\n\n· 模态打断考虑的是多个不相关任务同时并行的情况，分为四种情况：\n\n（1）用户发起的任务切换：指用户在多台设备之间完成多个不关联的任务，比如一边用平板电脑看视频，一边用电脑办公。——为了避免此时的模态打断，系统对不同任务和上下文的理解尤其重要。  \n（2）系统发起的任务切换：指系统发现当前存在优先级更高的任务，比如收到短信，这时会打断用户当前操作进入新的任务。——为了避免此时的模态打断，系统应该针对不同的任务划分优先级，低于当前任务优先级的尽量避免打扰用户。  \n（3）用户发起的主动中断：指用户突然在一段时间内不继续当前任务，比如长时间离开了房间，这时系统应该保存还是清空任务数据，需要结合任务和场景进行判断。  \n（4）系统发起的主动中断：可能是当前信息或上下文缺失，应该恢复至默认状态并提示用户下一步操作是什么。\n\n6.3 未来\n------\n\n· Google在2016年开始研发下一代操作系统Fuchsia OS，是基于微内核开发的操作系统，把Android、Chrome统一，将互联网和物联网围成一个闭环。\n\n· 华为在2019年发布了基于微内核的全场景分布式鸿蒙OS（Harmony OS），通过统一的内核架构统一所有的终端设备，并为用户提供跨设备交互的能力。\n\n· 普适计算（Ubiquitous Computing）是Mark Weiser于1988年在美国施乐（Xerox）公司PARC研究中心提出的概念：新一代计算机应该具有以下特征，它是高度分散和互联的，通常融入自然环境中，不可见且不需要人们有意识操作或分散注意力。普适计算的目的是建立一个充满计算和通信能力的环境，把信息空间和人们生活的物理空间进行融合，在这个融合空间中，人们可以随时随地、透明地获得数字化服务；计算机设备可以感知周围环境的变化，从而根据环境变化及用户需要自动做出对应的改变。\n\n· 在《普适计算及其商务应用》中，作者Bo Begole总结了普适计算系统所包含的概念：\n\n*   普适互操作性：在系统执行任务时进行信息交换和命令的传递。\n*   自然交互：允许用户在实际世界中用最自然的方式于系统进行交互。\n*   多模式交互：允许用户同时使用多种输入方式。\n*   **可触式交互**：允许用户操作实体物体来执行数字化任务。\n*   隐性交互：不需要用户直接请求，系统自动执行并完成任务。\n*   情境感知系统：利用物理和电子环境因素（位置、附近物体、任务、邮件、预约等）来提供信息服务。\n*   活动检测：使用传感器检测用户的身体活动与心理认知活动。\n\n· 基于普适计算，Mark Weiser在1995年提出了新的概念“宁静技术”（Calm Technology）。他认为计算系统的前景是它们可以简化复杂性，而不引入新的复杂性。在实现“宁静技术”的时代，技术将帮助人们专注于真正重要的事情上。\n\n· 普适计算最重要的两个概念仍是跨设备和多模交互，两者都涉及**状态管理**和**信息同步**。\n\n· 计算机支持协同工作（Computer Supported Cooperative Work, CSCW）\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}