{
	"title": "22年48~49周",
	"author": "王宇",
	"publishTime": "十二月02,2022",
	"readTime": "12s",
	"tags": "[\"唐玮\"]",
	"description": "唐玮",
	"article": "1\\. 智能商业包含网络协同和数据智能两个板块。\n========================\n\n数据智能就是利用大数据、人工智能技术建立能够自主学习、自主决策的软件系统。本质上是把人该做的工作用机器人来替代。数据智能如同一台自动化的机械，特殊的是它能够自我进化。\n\n不像自动化机械，机械的更新、进化是很缓慢的，成本很高的。**数据智能的特点是它的更新、进化非常频繁，同时成本也很低廉。**数据智能的这些特点意味着它是新时代的超级商业秘诀。\n\n数据智能即使到现在也依旧在发展阶段，因数据智能按其技术特性，是可以用在几乎每一行业中、每一件事中的。想想未来可能会出现一个超级智能的类人机器人就知道数据智能目前发展到什么阶段了。目前很多行业开始运用数据智能去重塑所在的行业，重做一遍行业。数据智能正在深刻的改变着整个世界。\n\n2\\. 要将数据这个新时代石油变成驱动经济的马，必须要做3件事：连接、挖掘和使用\n========================================\n\n驱动数据智能的是数据。数据是石油，而数据智能是机器，所以数据被称为新时代的第五要素，连同劳动、土地、资本、技术，共同驱动经济这架马车。所以要将数据这个新时代石油变成驱动经济的马，必须要做3件事：连接、挖掘和使用\n\n2.1. 什么是连接\n----------\n\n简单来说就是把客户和商家放到一起。商业的模式一直在变，但商业的本质一直是交易。交易的基础是连接。连接就是把商家和用户连在一起。世界在变化，但是趋势一直很清晰，即商业总是往交易效率更高的方向走。古代商业最繁华的地方在洛阳、长安，因为这2个地方是陆路交通的中心。前几十年最繁华的商业发生在上海、深圳、广州，因为当时是全球化贸易，沿海地区是连接海洋最近的连接口。而现在最繁华的商业发生在淘宝、京东、亚马逊，因为全世界的用户和商家都聚集在里面。\n\n市场中客户和商家接触的效率在越变越高，这就是这个时代的变化。\n\n2.2. 什么是挖掘\n----------\n\n挖掘就是利用找到数据里面的信息。2022年年初空气炸锅火遍全国，但小红书在空气炸锅刚开始销售不久，还没有火的时候，就已经知道了这个信息。因为空气炸锅这个词在平台里短时间搜索量激增。此外小红书挖掘数据在2022年底就可以发布2023年的十大消费趋势报告，未来未到，就已经了解了未来的趋势，这是何等的牛批。\n\n2.3. 什么是使用\n----------\n\n最后就是使用，根据挖掘到的需求去重新设计我们的服务和产品。比如知淘数据网站提供淘宝数据，分析出蓝海行业和产品，辅助电商企业去选品销售、去设置关键词，服务百万淘宝商家。我们的精准饲喂利用母猪饲喂数据训练饲喂模型，让每一头猪都能“我需要吃多少、应该吃多少，就吃多少”。\n\n  \n\n**通过连接，与客户保持关系。利用挖掘，找到目标客户、找到客户需求。使用挖掘信息去设计产品与服务。**\n\n3\\. 《场景革命》\n==========\n\n1.  什么是场景？场景就是关于人的故事。任何一件事都能构成一个场景。\n    \n2.  场景思维是寻找产品需求的一种方式。场景思维就是到用户的故事中去寻找产品需求，同时场景思维强调用户体验。\n    \n3.  故事包含人物、思维、情绪、时间、地点、任务、事件\n    \n4.  企业为什么要关注场景，关注场景思维？\n    \n\n*   当社会的产品变得越来越多的时候，用户的产品需求越来越难找。人的需求就像冰山，深不可测，被人们所见到的永远是少数。\n*   但是不是每个人都有洞察产品需求的眼睛。当显现在人们眼中的显性产品需求都一一被满足时，很多人就看不到人们还有的其他需求，就觉得市场一片红海，没有机会。\n*   《场景革命》这本书在提醒我们，不要担心社会上没有产品需求，同时要用上显微镜去观察世界。\n*   以物质举例。你面前有桌子、屏幕、还有空气。你眼睛看到的，以为空气中没有物质了，但是你眼前的空气还有氧气、氦气，你以为氧气下就没有了，但是O2的氧原子下还有电子、原子核。原子核下还有质子中子，质子下还有夸克… …\n*   所以你看永远都可以再找到新的东西，只要你用倍率更高的镜片。\n*   场景思维是倍率更高的显微镜。\n*   场景思维是思考用户在自己的某个故事下未被满足的需求，并想办法去满足这个需求。场景思维看到的更细，关注的是用户的故事，关注这个故事中的每一个细节。\n\n1.  核心观点：\n\n1.  人永远有未被满足的需求。\n2.  现在的产品品类极大丰富，我们可以用更大的显微镜（场景思维）去找到未被满足的产品需求。\n\n1.  另外这本书在讲的是获客方式，是客户心态的变化\n2.  抓住机遇，有三种方式：\n\n1.  创造性降低成本\n2.  解决更贵的问题\n3.  抓住全新的需求\n\n1.  ![](/download/attachments/91140755/%E6%9C%AA%E5%91%BD%E5%90%8D%E5%9B%BE%E7%89%872.png?version=1&modificationDate=1669967708875&api=v2)\n2.  用户主动传播分享\n3.  情绪（被认可、尊重、被关注）价值比实用价值要高。\n4.  答案永远在现场\n5.  不管是共享经济、还是体验市场的潜力不断攀升。这些现象的本质都是在解决更贵的问题或者是在创造性的降低成本。\n6.  社群的本质是信任。社群在用户心中比商家、比评价软件更具信任感。\n7.  信任感：好朋友推荐\\>评论\\>评分\\>企业背书\\>商家宣传（这个排序在不同情况下可能不同）\n8.  做产品，是为了满足用户。做营销，是为了影响用户。做渠道，是为了触达用户。\n\n  \n\n所以我们做平台就是在做一个集市\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}