{
	"title": "oppo强大语音助手小布背后的故事",
	"author": "王宇",
	"publishTime": "三月14,2023",
	"readTime": "12s",
	"tags": "[\"二、产品理念和PRD\"]",
	"description": "二、产品理念和PRD",
	"article": "### \n\n*   1 [一、产品当前现状](#oppo强大语音助手小布背后的故事-一、产品当前现状)\n    *   1.1[1、市场发展情况和背景介绍](#oppo强大语音助手小布背后的故事-1、市场发展情况和背景介绍)\n    *   1.2[2、语音助手功能](#oppo强大语音助手小布背后的故事-2、语音助手功能)\n*   2[二、产品核心优势](#oppo强大语音助手小布背后的故事-二、产品核心优势)\n*   3[三、优秀体验背后的技术支撑](#oppo强大语音助手小布背后的故事-三、优秀体验背后的技术支撑)\n    *   3.1[总体解决方案](#oppo强大语音助手小布背后的故事-总体解决方案)\n    *   3.2[预测总体思路](#oppo强大语音助手小布背后的故事-预测总体思路)\n    *   3.3[预测收益](#oppo强大语音助手小布背后的故事-预测收益)\n*   4[四、语音助手锤炼的思路](#oppo强大语音助手小布背后的故事-四、语音助手锤炼的思路)\n    *   4.1[4.1、技能建设](#oppo强大语音助手小布背后的故事-4.1、技能建设)\n        *   4.1.1[4.1.1 技能建设中遇到的难题](#oppo强大语音助手小布背后的故事-4.1.1技能建设中遇到的难题)\n        *   4.1.2[4.1.2  解决难题过程中沉淀的解决方案](#oppo强大语音助手小布背后的故事-4.1.2解决难题过程中沉淀的解决方案)\n    *   4.2[4.2、反智障](#oppo强大语音助手小布背后的故事-4.2、反智障)\n        *   4.2.1[4.2.1 第一个抓手进行技术升级](#oppo强大语音助手小布背后的故事-4.2.1第一个抓手进行技术升级)\n        *   4.2.2[4.2.1 第二个反智障的举措是自主缺陷发现与优化](#oppo强大语音助手小布背后的故事-4.2.1第二个反智障的举措是自主缺陷发现与优化)\n    *   4.3[4.3、懂用户](#oppo强大语音助手小布背后的故事-4.3、懂用户)\n        *   4.3.1[4.3.1 懂用户的属性](#oppo强大语音助手小布背后的故事-4.3.1懂用户的属性)\n        *   4.3.2[4.3.2 懂用户的行为](#oppo强大语音助手小布背后的故事-4.3.2懂用户的行为)\n        *   4.3.3[4.3.3 懂用户的情感](#oppo强大语音助手小布背后的故事-4.3.3懂用户的情感)\n*   5[五、长远规划](#oppo强大语音助手小布背后的故事-五、长远规划)\n*   6[六、对比当前影子的语音助手，进行深度思考](#oppo强大语音助手小布背后的故事-六、对比当前影子的语音助手，进行深度思考)\n    *   6.1[6.1、我们的语音助手离小布的距离还有多远，弱在哪里？](#oppo强大语音助手小布背后的故事-6.1、我们的语音助手离小布的距离还有多远，弱在哪里？)\n    *   6.2[6.2、小布有哪些地方我们可以学习和扩展的？](#oppo强大语音助手小布背后的故事-6.2、小布有哪些地方我们可以学习和扩展的？)\n    *   6.3[6.3、语音助手带来的价值增长点在哪体现，怎样让用户为AI买单？](#oppo强大语音助手小布背后的故事-6.3、语音助手带来的价值增长点在哪体现，怎样让用户为AI买单？)\n\n一、产品当前现状\n\n#### 1、市场发展情况和背景介绍\n\n      ![](https://pic1.zhimg.com/80/v2-06b195cc9a36907e3a4d4db0725a5bb8_720w.webp)\n\n       纵观整个智能助手市场，OPPO 小布助手有点“不一样”：**它出现比较晚，但发展迅猛，成绩突出**。\n\n       前不久，oppo旗下的人工智能助手“小布助手”月度活跃用户数突破一亿，成为国内首个活跃用户数破亿的手机语音助手，已经覆盖公司的各类终端设备，并在不断的增加新入口，覆盖众多任务型、问答型、闲聊型的垂域。\n\n       小布助手是搭载在 OPPO、Realme 和 OnePlus 这三大 OPPO 品牌上的智能助手产品。\n\n       我们推出小布助手的初衷是，首先希望为 OPPO 万物互融新生态建设服务，成为关键的战略控制点。我们希望依托 AI 技术，基于数据智能驱动人机交互的用户体验不断升级。\n\n       小布助手的定位不只限于语音助手，目前已经包含了语音、指令、建议、识屏和扫一扫 5 大能力，是人机交互最直接的信息媒介。我们希望通过小布助手为用户提供跨终端、全场景、智慧有度的服务体验。\n\n       从 2018 年底推出小布助手前身 Breeno 语音到现在，短短三年时间我们累计迭代了 40 多个版本。\n\n#### 2、语音助手功能\n\n          小布助手功能可分为五类：\n\n*   系统应用类：确定的命令需求，如系统设置、时间技能、应用技能等\n    \n*   信息查询类：客观知识的查询/搜索需求，如“今天天气怎么样”等\n    \n*   泛娱乐类：满足用户娱乐需求，包括听歌、看电影等\n    \n*   生活服务：满足用户日常生活需求，包括导航、打车、订餐等\n    \n*   聊天类：主观类的闲聊需求，包括人设问答、闲聊问答、话题多轮等\n    \n\n         唤醒方式：_语音_唤醒、长按电源键0.5s唤醒 、APP悬浮球、耳机唤醒。\n\n### 二、产品核心优势\n\n无需安装，唤醒即用”的覆盖能力，实现“解放双手，高效操作”的新形态人机互动。\n\n拥有丰富的唤醒方式，可轻松实现内容的语音直达服务。\n\n小布助手可以支持的技能有上百种，包括比如：生活服务、出行服务、信息查询、系统操作和娱乐服务等\n\n语音助手是一个语音交互系统，它有四大核心瓶颈：唤不醒、听不清、听不懂和说不清。\n\n![](https://static001.geekbang.org/infoq/4e/4ecee25b58edabd706b22fab1b0345a0.png)\n\n![](https://static001.geekbang.org/infoq/70/70ef797adeee6c928bc012b854ec10ee.png)\n\n### 三、优秀体验背后的技术支撑\n\n小布助手追求用户的极致体验，流畅度是其中最重要的维度之一。\n\n1.  服务端三方资源执行耗时占比最大。服务端耗时中，三方资源执行耗时占比最大，80%+\n    \n2.  服务端语音识别耗时占比第二\n    \n3.  客户端渲染交互可更简洁。部分垂直技能客户端交互可更简洁，执行可更快\n    \n\n![](https://static001.geekbang.org/infoq/41/414652d29716b7274cd6b6dcaf11d082.png)\n\n#### 总体解决方案\n\n1.  并行：预测、串改并\n    \n2.  剪枝：快慢分层、多级缓存\n    \n3.  提速：三方自建、云端 VAD、交互简化、执行优化\n    \n\n![](https://static001.geekbang.org/infoq/af/af847f5a76df638a22cf1b82482d8f17.png)\n\n#### 预测总体思路\n\n预测是架构复杂度较高的特性，展开说明小布助手的实践。\n\n在用户的语音交互过程中，ASR 流式中间结果不断上屏，直到尾点识别 VAD 结束，才会获取完整的用户音频输入。\n\n利用业务特性，预测可以做到“边听边想”，将识别过程和执行过程并行化，缩短串行等待的时间。\n\n![](https://static001.geekbang.org/infoq/26/26e4a4b2bd730136c11add236241fe42.png)\n\n分为有 2 种策略\n\n1.  VAD 阶段并行执行，高准确低收益。\n    \n2.  识别阶段并行执行，低准确高收益。\n    \n\n#### 预测收益\n\n部分命中率较高的技能达到 70+%，耗时降低 60+%\n\n开启的技能整体命中率 42.3%，耗时降低 43%\n\n### 四、语音助手锤炼的思路\n\n         ![](https://pic3.zhimg.com/80/v2-f0323c02b1e8532a8b99f5bae89c8656_720w.webp)\n\n*   第一层主要解决效率问题，希望能方便、快捷地帮助用户完成日常的简单任务。比如：系统的操作控制、定闹钟、设置日程等。注重工作效率的用户会比较喜欢这类的功能。\n*   第二层中除了简单的操作之外，希望系统可以更智能，更好地了解用户的习惯、偏好，知道用户对哪些内容感兴趣。除了被动的交互之外，希望系统可以给用户主动的推送。\n*   在第三层希望系统跟人一样，像之前提到的拟人化的交互，满足用户的情感需求。比如，在用户比较郁闷的时候可以陪用户聊聊天；甚至可以成为用户的知心朋友，在用户不开心的时候给他一些宽慰和鼓励。\n\n        **小布的演进思路，大致可以理解成从技能建设到反智障，再从反智障到懂用户这样的路径。**\n\n  \n\n#### **4.1、技能建设**\n\n      目前小布有 300 多个技能，对应 2500 多个细分意图。从技能维度来看，技能量不算多。但真实场景中，技能对应的用户量会呈现非常明显的头部效应，这 300 多个技能已经覆盖了 95% 以上的用户需求。\n\n      ![](https://pic3.zhimg.com/80/v2-8732cd45481089d8ae57b486654efd7e_720w.webp)\n\n##### 4.1.1 技能建设中遇到的难题\n\n*   **第一个是语义理解**。这个问题目前还没有完美的解决方案，当面临大量用户口语化的表达时，总会出现各种各样的 Badcase，这一点相信长期做 NLP 技术研发的伙伴可能都有体会。\n*   **第二个是开放域对话范围比较广**。这里主要是指聊天和知识问答。对于聊天，用户希望你能解闷，还希望你能安慰人，甚至希望你能陪它玩；知识问答包含的领域也很广，什么问题都可能被问到，比如以小布为例，每个月能收集到的不重样的问题得到千万级以上，非常的发散和长尾。\n*   **第三个是效果优化高度依赖人工**。对话交互不像搜索、推荐场景，可以快速收集高质量的反馈数据形成闭环，高效完成优化。有一句调侃AI的玩笑，“有多少人工，就有多少智能”。虽然是玩笑调侃，但在对话的场景中也部分反应了目前的真实现状。\n*   **第四个对于海量用户，需要考虑模型的应用成本**。目前模型的参数量像是打开了潘多拉魔盒，参数量扶摇直上，量级从亿级到十亿、百亿、万亿级别。但应用这些模型进行推理的成本是很高的。如果这些问题未能得到解决，应用复杂模型的成本还是非常高的。\n\n##### 4.1.2  解决难题过程中沉淀的解决方案\n\n        ![](https://pic3.zhimg.com/80/v2-476b184abe7ee30a177c354f35060196_720w.webp)\n\n之前提到的系统开关、APP 控制都可以通过指令型技能完成。这类技能的特点是用户 Query 的本身包含了比较丰富的语义信息和信号，有比较强的信息输入将其结构化为意图和槽位。此外，意图和槽位之间也有比较强的关联关系。我们采取了融合规则和多任务深度学习的方案。一方面，通过规则降低一些计算量的开销。算法对于标准问法的识别准确率是非常高的。另一方面，引入多任务的深度学习模型也会兼顾意图和槽位的关联。这也是一个经典的解决方案，可以很好的解决误差累计的问题，能够取得更好的效果。\n\n结合小布实际的业务经验，使用数据驱动优化和比较完善的规则校验，再加深度学习的方式在指令型的技能上基本可以做到 95% 以上甚至更高的的召准率。\n\n![](https://pic4.zhimg.com/80/v2-de6e9b1e0dea3870565be62bd733312f_720w.webp)\n\n**第二类是知识依赖型的技能**，比如刚刚提到的音乐、影视等技能。单从用户 Query很难判断该 Query 属于哪个技能。这类 Query 包含的实体信息有它自己的知识属性，在判定知识所属的类别之后，才能准确判定该 Query 所对应的技能。\n\n比如，用户说“你帮我放个原子弹”或“你帮我放个炸弹”。没有背景信息的话，很难判断对应的技能。“原子弹”和“炸弹”都是歌曲的名字。针对这些问题，我们采用了先做实体识别和链接，后做意图识别判断的方案，这样可以有效的融合知识，最终获得更精准的结果。\n\n![](https://pic4.zhimg.com/v2-d2dc52b7665d9e94d4f2857601c0fff3_r.jpg)\n\n**接下来介绍两个开放域的场景。**\n\n开放域知识问答场景占到小布交互量的 15% 左右，属于比较刚需的场景。知识问答可以看成搜索引擎的一种终极形态的期望。它可以直接给用户简短精准的答案，这也是用户使用它的原因之一。针对这种开放域的知识问答问题，我们将其拆分为几个不同的场景进行处理。\n\n*   **第一种是相对比较封闭的问题**，比如：星座、交通限行相关的问题。这类问题目前是通过定制技能来解决的，效果相对也会更可控一些。\n*   **第二类是事实型的比较客观的开放型问题**，比如：问东京奥运会金牌得主是谁？这种我们是通过自建的知识图谱，以及对一些结构化问题的解析转化成图谱来实现。这种方式的优点是可以把答案做的特别精准。目前系统支持简单的单跳和复杂的多跳场景。\n*   **第三种最复杂，属于既开放又比较长尾的问题**。目前通过检索式、结合知识库的方式来解决。在这种情况下，知识库的构建就非常重要。除了人工构建，我们采用一些半自动化挖掘的方案，比如基于语义理解的一些方案。从去年开始，我们也引入了一些基于生成式大模型的方案探索，希望更高效的构建知识库，且产生的知识库的内容也更优质。\n\n![](https://pic3.zhimg.com/80/v2-098b3bf79644af43faac26d39b238b1a_720w.webp)\n\n**另外一个开放域的场景是聊天**。在手机设备上，智能聊天是占比最高的需求。一方面是因为用户喜欢调侃语音助手，尤其是一些新用户。另一方面，聊天贯穿在对话的整个过程中，在某种程度上是对话的润滑剂。有部分用户会有倾诉的需求，不方便跟周围的人说。他们希望把小布当做树洞，通过这种更安全的方式来沟通。\n\n**针对聊天场景，我们使用了检索式、生成式以及记忆的方式融合的方案。**检索式大家比较熟悉，需要注意的是随着近几年预训练模型的发展，在检索匹配的时候我们引入了比较多的基于预训练大模型的方案，希望可以把语义表征学习的更好一些，使得检索更精准。因为检索的范围是有限的，要把开放域做的比较好，生成式已经必不可少。这里我们采用了 UniLM 和 1vN 建模的模型，从而生成可控且相关的高质量的回复。这里比较大的风险在于生成式的安全性。针对这个问题，我们做了很多 Query 安全性、答案安全性、Query 和答案组合安全性的控制机制。\n\n为了让聊天变得更有趣、有用，我们特别研发了记忆的能力，希望在聊天的过程中记住一些用户主动提供、或用户提到的一些信息，从而影响未来聊天的内容。目前小布已经支持记忆很多信息，比如：位置、节日、纪念日等，这部分的范围也在逐步扩大。\n\n#### **4.2、反智障**\n\n**![](https://pic3.zhimg.com/80/v2-61c66c408d0c9a4379ecb92097b83d36_720w.webp)**\n\n下来介绍一下对话助手建设不得不面对的问题，即：如何让AI助手表现得不那么智障。这里面的主要问题就是：对于任何一个很小的低级错误，在实际用户体验中都可能会被放大，尤其是小布这种用户体量非常大的 C端产品。要在行业中存活下来，让系统具有反智障的能力是非常重要的。\n\n##### 4.2.1 第一个抓手进行技术升级\n\n     因为它可以带来大影响面的效果提升。前面提到小布诞生的比较晚，在 2018、2019 年这个时间阶段，当时深度学习在 NLP 领域的应用已经非常成熟，所以小布的技术体系也是以深度学习为主。因为小布的整个技术没有传统的历史包袱，技术升级也会相对容易一些。这几年预训练的发展给技术升级带来了红利，我们也建设了从一亿到十亿的大参数模型的落地，从而促进小布在语言理解、泛化能力的提升，避免比较低级的问题。\n\n![](https://pic1.zhimg.com/80/v2-77f8c5066dcb9441cae3da8be1009610_720w.webp)\n\n**模型包含多任务解码的设计，从而对下游的适配性更强。另外，在通用语料的基础上，我们叠加了特定领域对话的语料对模型进行持续的预训练。此外，我们考虑了知识增强这个方向，使得模型对知识有更好的理解。在知识增强这个方面我们也会考虑用户提到的实体相关的信息，将实体的信息关联到实体相关的百科内容中，让模型在知识理解做的更好。**\n\n这里重点介绍一下面对大量用户产生的交互流量如何控制大模型落地成本。否则，技术升级只能作为试点技术，不能进行大规模的推广。针对这一问题，我们引入了统一表征的落地方案。在实际应用时，骨干网络只计算一次。在下游应用时，骨干网络的计算结果只需要微调少数的层次，就可以在效果没有太大损失的情况下取的差不多的收益。这其实就是构造大模型的一次推理，同时解决下游 N 个任务运用的问题。计算量大概可以节约75%左右，这样模型落地就不会有太大的问题。这也是我们的预训练和提升反智障能力在工程落地方面做的重点事项。\n\n##### 4.2.1 第二个**反智障的举措是自主缺陷发现与优化**\n\n**![](https://pic1.zhimg.com/80/v2-408f7ec8234ba04d3903f1121bcf949c_720w.webp)**\n\n      在实际的工业应用中，AI 助手的交互环境是非常复杂的，这会给语音识别和语义理解带来很大的挑战。对这类问题应对的不好，就会让用户觉得助手很不智能。另一方面，尽管没有特别好的方式来获得直接的用户反馈，我们希望将 Case 收集更加自动化，全部依赖人工会导致效率低下。之前做过数据统计，尽管小布有内外部多个人工收集渠道，但半年时间只积累了几百个 Case，这对产品优化是远远不够的。迫切需要探索新的技术，比如半自动化、自动化的技术让缺陷的发现和修复变得高效。\n\n**![](https://pic4.zhimg.com/80/v2-28c275c738750017fc50c39e62a8068f_720w.webp)**\n\n这里举措两个收益比较大的实践案例：\n\n*   第一个是结合语音语义联合的无效交互的拒识。用户在使用小布助手的时候，背景通常不是特别安静的，这里面会有很多环境噪音带来的无效输入。如果不对这类噪音进行识别和处理，就会导致助手的响应不可预期。因为噪声对应的意图是不真实的，不管做出什么样的响应都是不合适的。此外，在很多情况下，通过噪声识别出来的文字，人类都很难理解其对应的意图，机器去理解和响应就更困难了。因此，考虑从源头对噪音数据进行识别，并拒绝噪音数据。针对这一问题，我们引入语音 ASR 识别的文本信息作为输入进行联合建模，更精准的过滤无效输入。我们尝试过单独文本的方案，受限于数据的损失，单独文本与多模态联合建模效果有较大的差距。\n*   第二个是自动化语义缺陷挖掘与修复。希望综合利用语义、非语义的信号，自动识别出助手回答错的问题，通过半自动化、自动化的方式让缺陷修复更加高效。我们设计了全套缺陷挖掘和优化的流程，借助半监督、主动学习的优化手段，挖掘召回存在误判的 Case，推进其进行校验和优化，这可以让系统进入良性循环。目前覆盖 85% 以上的技能，覆盖意图识别问题量的 48%，这种方式比人工优化效率高了两个数量级。\n\n#### **4.3、懂用户**\n\n**![](https://pic1.zhimg.com/80/v2-e86c21ff9a1b8e29dce5aa76e0fa88fc_720w.webp)**\n\n##### **4.3.1 懂用户的属性**\n\n    第三部分是怎么更好的懂用户，这是最难的，也是未来最有想象空间的。懂用户包括，懂用户的属性、用户的行为以及用户的情感。希望通过懂用户给用户带来更贴心的产品体验，认为这个助手是为他打造的。同时，通过提升用户对助手的信任感，增加用户粘性。有了用户的信任感和粘性后，未来助手才会有更大的发展潜力。\n\n![](https://pic1.zhimg.com/80/v2-611805f24d4b36a8eb894564b0abc708_720w.webp)\n\n小布在懂用户方面还在持续的发展中，目前覆盖基本属性，针对这些属性小布也可以做到记忆、提醒和影响后续部分对话交互的过程。整体还需要进一步的深入挖掘，这也是我们未来发展的重点方向之一。\n\n##### 4.3.2 懂用户的行为\n\n![](https://pic2.zhimg.com/80/v2-ea947e87158090bae098d8fb7429683d_720w.webp)\n\n此外，**在懂用户行为方面**，我们也已经做了一些探索和实践。比如，我们发现有些用户在需求未满足时会通过换不同的说法、澄清的方式希望助手更理解自己；有些用户会在小布犯错的时候骂他，给小布负向反馈；也有用户会在小布很好完成任务时给小布正向的激励反馈，对小布说谢谢或夸赞。我们了解到不同用户的行为后，也针对不同的用户行为做反馈，提升小布的理解能力。\n\n**针对反复澄清的用户，**我们实现了自动化离线学习外加在线澄清的方案用来实现和满足用户需求。通过澄清的方式，猜测用户意图，最终帮助用户达成诉求。这不仅对当前用户是有效的，对相似的用户场景也是通用的。\n\n**针对用户的批评和表扬**，我们也制定了小布的口碑满意度体系，降低用户对小布的不满，提升用户满意度。\n\n![](https://pic2.zhimg.com/80/v2-0e03cea4bd046f8bf95375d4d6e1a031_720w.webp)\n\n##### 4.3.3 懂用户的情感\n\n**懂用户另外一个重要的维度是和用户共情。针对这一方向，小布做了一些情感引擎和情感理解的工作，识别和跟踪用户的情感变化，为用户提供情感关怀方面的交互**。目前还处于比较初级的阶段。总的来说，在技术层面上理解用户情感是相对可控的。但如何在理解的基础上交互让用户感受更好，这一课题还需要更多的探索。\n\n![](https://pic2.zhimg.com/80/v2-a9827e978be4a25f132cb1eed77f72f5_720w.webp)\n\n此外，**在理解用户的潜在需求方面**，我们也希望有更多的工作落地。比如，用户反馈被打了或者被批评了。我们希望可以通过交互的方式深刻的挖到背后的原因，结合原因再使用交互的方式去满足用户的潜在需求，从而对用户有一些疏导。\n\n### 五、长远规划\n\n  以上就是小布演进过程中，我们做的思考和实践。AI 助手目前在非常高速的发展中，如果大家关注到一些顶级会议论文研究方向的分布，会发现对话助手相关的研究是非常活跃的。这里对未来 AI 助手的未来方向做一个简单的展望。\n\n![](https://pic1.zhimg.com/80/v2-c546c95f10e357686672400d47c90460_720w.webp)\n\n**首先，AI 助手覆盖的设备载体越来越丰富**。从用户角度来看，拥有多设备的用户也越来越普遍。在做好单设备体验的同时，我们相信多端融合也会是 AI 助手的趋势之一。通过 AI 助手实现更好的跨端协同智能，在协同体验 AI 助手会有更强的竞争力。\n\n**在产品形态层面，目前产品已经从传统的语音、语义的方式转向多模态数字人的方向演进，目前多模态也是必然的发展趋势**。小布在多模态虚拟人方向也有一些落地，如：虚拟人直播带货、播报天气、播报新闻。实际上也吸引了很多用户的关注，虚拟人的交互方式天然让用户的感知更明显。\n\n除了外在表现，我们认为内在的灵魂同样重要。完美的 AI 助手需要有情感，有记忆，有观点。助手需要逐渐成长，值得信赖。所以我们认为**人格化也是未来的趋势**。\n\n![](https://pic2.zhimg.com/80/v2-18d4195b8edd0aa549f724d3ff06b649_720w.webp)\n\n除了刚提到的技能建设的基础体验，以及反智障、懂用户这种持续的提升之外，我们希望小布助手在理论上有持续的发展。比如，借助于情感引擎、拟人对话能力等各方面的技术，给用户提供有自我的 AI 助手，成为用户贴心的伙伴。\n\n![](https://pic1.zhimg.com/80/v2-173c1e8c1be9098b020abafff7211208_720w.webp)\n\n   在 AI 助手这个方向，经历了从早期的客服机器人到全能型智能助手，再到多模态虚拟机器人的变化。AI 助手在车载、电视、智能家居等各个场景上被越来越广泛的应用和接纳。随着设备互联互通逐渐成熟，智能助手也慢慢迎来了自己最好的发展机会。在这些复合场景下，AI 助手的价值能够带来更好的体验。相信未来在万物互融的场景下，AI 助手会发展的越来越好。\n\n### 六、对比当前影子的语音助手，进行深度思考\n\n#### 6.1、我们的语音助手离小布的距离还有多远，弱在哪里？\n\n     我们的小万和发展之初的小布面临同样的问题，就是我们现阶段尽快构建一个可面向用户的产品，再通过用户的实际使用促进产品的快速迭代。\n\n     1、从小布助手最初搭载的设备来看，是跟这家公司的基因有关的，本身就是做手机硬件出身的，设备在市场上已经有了很好的发展，有了大量的用户积累，对于获取大量数据简单了许多，对后续数据分析和迭代、算法模型的优化提供了很多的优质条件，能够基于数据驱动提升智能体验，而我们的小万呢，最近才刚开始商业化，相对来说市场还没有完全打开，用户反馈稍微欠缺。\n\n     2、因为需要快速构建一款语音产品，更多的是以快速组装为主，自然就会引入很多的外部AI技术，去打通语音功能的标准流程，中间就会遇到一些技术问题，各个环节相对割裂，相互之间的适配效果也不是很理想，从端到端来看，效果的折损会比较的明显，对应的语音体验也相对需要更多的时间去打磨和提升。\n\n#### 6.2、小布有哪些地方我们可以学习和扩展的？\n\n    1、正确产品定位和期望。\n\n    2、始终以用户需求为起点,扎根技术研发。从用户角度出发,为用户解决问题\n\n    3、主动智能技术的预研、有对未来的畅想,更有对用户的关怀。\n\n    4、面对技能的增多和有更多的长尾技能的时候，引入平台化解决方案，构建自己的技能平台和开放平台，让非技术人员、外部合作伙伴参与技能的建设，降低研发门槛和成本。\n\n    5、进行用户体验评价，分析线上的有效音频实际录入的技能领域和场景，构建不同的场景测试集以及领域测试集，对于未满足的query进行分析，优化提升。\n\n    6、智能助手与用户交互，无论用户满意还是不满意，一般都是用完即结束，不会直接给反馈，不像搜索推荐，可以通过点击、时长等行为数据直接获得反馈，再促进算法模型的优化，所以需要构建一个自学习系统，通过它获得信号，促进算法高速、更有效的迭代，让智能助手效果越来越好。\n\n    7、在研发资源比较有限的情况下，我们首先还是会专注于当前比较高频、高优先级的用户需求优化。同时我们会根据服务的用户群体去做分层优化，判断哪些需求对于用户来说是优先级更高的，进而逐步满足更多用户的个性化需求，逐步实现所谓的千人千面，终极目标是希望为每个用户打造独一无二的智能助手。\n\n#### 6.3、语音助手带来的价值增长点在哪体现，怎样让用户为AI买单？\n\n    1、缩短用户到达服务之间的路径，让用户尽可能的\"偷懒\", 给用户带来智能化的体验，这是体验语音助手的价值点之一。\n\n    2、我们不局限于当前的硬件产品，只是作为切入点，未来朝着万物互联的生态方向发展，进行全场景探索。\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}