{
	"title": "虚拟数字人行业学习笔记-2022/12/02",
	"author": "王宇",
	"publishTime": "十二月02,2022",
	"readTime": "12s",
	"tags": "[\"黄婷\"]",
	"description": "黄婷",
	"article": "商业与技术相平衡”是虚拟人应用的最佳实践。\n\n**一、重要概念理解**\n\n  \n\n*   **虚拟人（来源：“企业管理杂志”公众号）**\n\n虚拟人是现实世界中根本不存在的“人”，属于人们根据想象所创造出来的全新形象，它可以是2D，也可以是3D。而不管它是2D或是3D，虚拟人与真实的人都存在着肉眼易辨的差异。如我们在动画片、游戏以及广告等视讯媒体中所看到的一切虚拟人物形象，其中较为知名的当属初音未来、洛天依和女团A-SOUL。\n\n  \n\n*   **数字人（来源：“企业管理杂志”公众号）**\n\n数字人，是指从数字孪生概念中引申出真人，通过3D扫描、数据建模等技术手段100%复刻真人后生成完全数据化的人，即数字人是基于真人而映射出的一种数据存在。\n\n  \n\n*   **虚拟数字人**\n\n数字虚拟人，也叫虚拟数字人，是具有多重人类特征的综合产物。它也是现实世界中根本没有的存在，但却具有真假难辨的人类外貌特征，还具有越来越纯熟的人类表演能力以及高度智能化的交互能力。如天猫超级品牌日的数字主理人“AYAYI”、创壹科技的虚拟美妆博主“柳夜熙”和湖南卫视的数字主持人“小漾”等。（来源：“企业管理杂志”公众号）\n\n在实际生活和工作中，为了避免人们混淆虚拟人、数字人和虚拟数字人的概念，我们习惯上将其统称为“虚拟人”。\n\n![](/download/attachments/91141061/image2022-12-2_18-18-12.png?version=1&modificationDate=1669976287791&api=v2)\n\n![](/download/attachments/91141061/image2022-12-2_18-18-22.png?version=1&modificationDate=1669976300507&api=v2)\n\n与具备实体的机器人不同， 虚拟数字人依赖显示设备存在。 虚拟数字人宜具备以下三方面特征：\n\n**一是拥有人的外****观**， 具有特定的相貌、 性别和性格等人物特征；\n\n**二是拥有人****的行为**， 具有用语言、 面部表情和肢体动作表达的能力；\n\n**三****是拥有人的思想**， 具有识别外界环境、 并能与人交流互动的能力\n\n  \n\n*   **元宇宙（来源：“企业管理杂志”公众号）**\n\n最具代表性的定义：一个平行于现实世界，又独立于现实世界的虚拟空间，是映射现实世界的在线虚拟世界，是越来越真实的数字虚拟世界——Avatar是存在于元宇宙中的一个虚拟化身，而**衡量一个公司的某些应用或业务是否属于元宇宙，主要看它是否具备身份、社交、开源和创造、同步和拟真、闭环经济系统五大核心属性****。**\n\n**![](/download/attachments/91141061/image2022-12-2_18-18-40.png?version=1&modificationDate=1669976316981&api=v2)**\n\n元宇宙里的“Avatar”构成了元宇宙的主体，它并不是一个名字或代号，而是现实世界中的人在虚拟世界里的一个身份。\n\n  \n\n**二、行业背景**\n\n**1****.****虚拟人的发展历程**\n\n任何一次市场机会的到来基本会经历四个阶段：看不见、看不起、看不懂、来不及。很明显，**虚拟人正处在一个从“看不起”向“看不懂”过渡的地带。**\n\n![](/download/attachments/91141061/image2022-12-2_18-19-7.png?version=1&modificationDate=1669976345171&api=v2)\n\n**2.****虚拟人的发展现状**\n\n**2.****1供给侧：** **技术难题或已基本解决， 大规模虚拟人制作具备条件**\n\n1.  现阶段虚拟人制作主要涉及建模、驱动和渲染三大技术。 虚拟人的交互分为真人驱动型和智能驱动型。 引擎升级和技术突破大幅降低虚拟人制作难度。\n2.  虚拟人赛道一级市场融资火热，为虚拟人制作提供重要资金支持。\n\n  \n\n**2.2****需求端：** **降本增效、 规避真人偶像风险、 元宇宙赋能，多因素拉动****需求增长**\n\n![](/download/attachments/91141061/image2022-12-2_18-19-48.png?version=1&modificationDate=1669976385620&api=v2)\n\n1.  **虚拟人可分成服务型和身份型。** 服务型虚拟人应用价值集中在“业务中后端”即“用户服务阶段”，主要用于辅助/代替部分真人服务，是现实世界中服务型角色的虚拟代表，**“技术攻关”**成为服务型虚拟人盈利的核心突破点。身份型虚拟人多为虚拟 IP/偶像，意在推动虚拟内容的生产，亦可是虚拟世界里用户的第二分身，其应用价值集中在“业务前端”即“用户触达阶段”，**“IP****运营能力”**成为身份型虚拟人是否可以盈利的核心突破点。\n2.  需求驱动因素之一： 虚拟人的边际成本或持续下降， 或部分替代真人，助企业降本增效。\n3.  需求驱动因素之二： 虚拟偶像或有效降低负面新闻风险， 潜在需求较大。\n4.  需求驱动因素之三： 虚拟人或代表元宇宙八大要素中的“身份”， 是元宇宙的构成要素和交互载体，二者相互赋能。\n\n**2.3****虚拟人产业链下游应用空间打开，依托粉丝经济变现大有可为**\n\n![](/download/attachments/91141061/image2022-12-2_18-20-30.png?version=1&modificationDate=1669976427531&api=v2)\n\n![](/download/attachments/91141061/image2022-12-2_18-20-49.png?version=1&modificationDate=1669976446078&api=v2)\n\n**2.4****内容创作和运营能力为虚拟人产业链公司长期竞争力的关键**\n\n  \n\n**3.****虚拟数字人发展制约因素**\n\n1.  政策环境层面， 行业依然处于培育期， 缺乏政策与资本扶持。\n2.  技术应用层面， 制作方式自动化程度低、 生产门槛高，关键技术还不够完全成熟。\n3.  人才培养层面， 技术人才、 综合人才极度缺乏， 人才供应体系不完善。\n4.  标准体系层面， 行业内缺乏统一技术标准和体系， 产品质量良莠不齐。\n5.  安全伦理层面， 相关法律法规和伦理规范尚待完善， 存在潜在风险。\n\n  \n\n**三、虚拟数字人通用系统框架**\n\n*    虚拟人系统框架一般情况下由人物形象、语音生成、动画生成、音视频合成显示、交互五个核心模块构成\n*   交互模块为可扩展项，依据是否具有交互模块可将虚拟人分为交互型虚拟人和非交互型虚拟人，其交互型虚拟人依据其驱动方式的不同，又可分为智能驱动型虚拟人和真人驱动型虚拟人\n*   其中虚拟人制作过程中核心关键技术应关注:建模、驱动、渲染和人工智能。其决定了虚拟人的外在形象的美观度、动作的流畅度以及交互的自然度及虚拟人的智能程度。\n\n![](/download/attachments/91141061/image2022-12-2_18-21-20.png?version=1&modificationDate=1669976476017&api=v2)\n\n![](/download/attachments/91141061/image2022-12-2_18-21-29.png?version=1&modificationDate=1669976485118&api=v2)\n\n  \n\n**四、解疑答惑**\n\n1.  观看虚拟人视频时产生的问题：**虚拟人现身并与真人互动是如何实现的，我们为什么能看得到，能否摸得到？**运用的是AR全息投影技术，是将虚拟人物通过高科技投影呈现。全息投影技术不仅可以产生立体的空中幻像，还可以使幻像与真人产生互动。这是虚拟幻象，摸不到。\n2.  **虚拟偶像实时舞台表演是如何实现的？**互动系统通过将表演者的形象映射在虚拟人物上进行实时表演，通过虚拟人，观众可以感受到与非真实人物交流的特殊感受，从而达到特定的表演效果。但现有技术通常使用前期制作，将表演流程固定下来。这样的情况导致虚拟人物只能够按照预先设定的流程和动作进行表演，无法与观众互动。即使加入一定的程序设计也只能获得有限的互动效果，无法和真实演员一样处理现场的复杂情况。\n3.  **虚拟人行走、站立、坐着等这些交互动作是如何实现的，如何避免穿模且呈现出真实接触的感觉？**虚拟人的交互分为真人驱动型和智能驱动型。真人驱动型背后有真人操控（中之人），是通过面部和动作的实时捕捉，让虚拟人物和真人可以实时的同步，声音也需要真人来传递。智能驱动型则是利用深度学习，学习模特语音、唇形、表情参数间的潜在映射关系，形成各自的驱动模型和方式，最终通过高精度的驱动模型还原真人的动作变换。对各种动作进行建模，通过物理模拟来计算动作产生时，可能受到的力，然后给虚拟人自动生成、“脑补”相应动作。\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}