{
	"title": "虚拟人应该再往前一大步",
	"author": "王宇",
	"publishTime": "八月28,2023",
	"readTime": "12s",
	"tags": "[\"廖志川\"]",
	"description": "廖志川",
	"article": "1、被动服务–主动服务 (场景化业务+拟人化形象动作设计-五官延展)\n\n2、体用关系的升级,虚拟人的落地场景不能太局限,虚拟人可以有更多的业务入口。\n\n3、关注场景化的用户心理变化-行为路径分析。\n\n4、核心能力底座的突破会给虚拟人带来无限的可能。\n\n虚拟人目前清晰的定位是什么: 现在主打的还是赋能，既然是赋能的定位，那价值的上限很可能是有局限的，因为产品的设计还是要围绕搭载的设备载体而进行展开，而对于一款语音相关的产品，用户的期望是很高的，如果还是按照传统的语音产品的打法去设计，很难得到用户的认可，因为毕竟现在市面上有很多成熟的语音产品，已经在用户心中形成了比较强的认知共识，想要去抢占这块市场显然是不可行的，也是费力不讨好的事情，但是虚拟人对外应该还是一款独立、可扩展的消费级产品，既然是一款单独的产品，我们也应该想清楚虚拟人这款产品自己大的定位是什么，那就不仅仅只是赋能了，脱离开载体，它也应该能够单独的牵动用户，也就是离开了现有的业务，它还能有什么价值，或者说虚拟人这款产品的商业逻辑能不能闭环，能不能创造商业价值？\n\n我们应该把两个事情想明白: \n\n1、作为赋能的定位，那就应该站在万得厨的角度，以万得厨为主体，去思考万得厨需要什么，使用万得厨的用户需要什么？ 背后就是商业价值、用户体验(**性能体验、交互体验、视觉体验)，目前我们在体验这一块也已经打磨了几个月了，只能说还在可用的阶段，还没有达到说好用让用户满意的阶段，还有很多的细节方面可以继续深入设计，优化体验。**\n\n2、作为虚拟人这个产品的定位，我们应该站在虚拟人的角度，虚拟人相对于传统的语音产品的优势在哪里，传统的语音产品更多的是傻瓜式的控制类，主打的是功能级别的体验，我们虚拟人已经不仅仅是这个层面了，它应该是一款有思想、有温度、真正懂你的一款超级个体，我觉得它是凌驾于语音产品之上的，也就是语音产品能做的它也能做，语音产品不能做的，虚拟人可以做的更好。\n\n那对应大的切入点\"敬老、爱幼、助残\", 背后的需求更多的应该是个社会问题，现在社会节奏越来越快，大家自由的时间越来越少，那对老人的陪伴关爱、对孩子的成长以及对一些身体不健全的人的关怀也是比较少，纵向拓展还有更多这样的问题，我们虚拟人应该承担起这个伟大的使命，让老人不再孤单，让孩子健康快乐成长，还身体不健全的人一个友好的天地，让大家不要有遗憾，这是我们要达到的产品目标和理念，背后的用户也会是整个敬老、爱幼、闭环一条链路上的人，谁敬老，谁爱幼，谁助残的问题，站在这个大问题的角度上思考，我们虚拟人要落地，会有很多赛道可以走，当然现阶段最方便的就是跟我们已有的业务结合。\n\n  \n\n拿当前业务来讲，万得厨核心业务是烹饪，那烹饪究竟能给人带来什么呢？\n\n*   专注烹饪的过程中，会让人心情慢下来，能够解压，在快节奏的时代，其实会有一个感受，越靠近科技就越向往原始，不失为一种享受。\n*   厨房是一个有温度的空间，和家人一起进行关于烹饪进行探讨这个过程，最后做好饭菜一起坐在一起吃饭，能够提升幸福指数。\n*   能够获得满足感和成就感，一个人获得他人的激励越多，会越自信，并会持续专注于做这件事情。\n\n那既然烹饪能给大家带来这么多的好处，那为啥大家还是愿意吃着不健康的外卖也不想做饭呢？心理学研究表明: 有以下几种原因\n\n**现实原因**: 大部分人都知道在外面吃又贵有不卫生，至于营养更不用提及，但是大家还是选择在外面吃。\n\n1、忙碌的工作无暇做饭，紧张的工作让人对于做饭都有一种时间来不及和浪费时间的想法。\n\n2、不愿做，不敢做！担心容颜问题，针对广大的女性朋友，天生爱美，对于大多数者来说又是未来的家庭主妇，而且新时代的年轻人有个很明显的特征就是，女生越来越不专注于家庭，反而男性同胞们拿起了锅铲，女性们害怕油烟，做饭会让自己变成“黄脸婆”，当然我认为还有一个原因，谁不想被其他人羡慕嫁了一个好老公了，什么也不用干。\n\n3、不会做，很多工作不怎么忙的人完全可以做饭，但是他们还是选择去餐馆吃或者点外卖，都说自己不会做，只会下面条，做蛋炒饭，但他们又想做就产生了认知失调。\n\n**心理原因:**\n\n1、厨房是家庭教育中一个重要的多媒体室，如果儿时的家庭教育并没有让我们意识到快乐、分享以及烹饪带来的好处，那么成年后很难独自找到对厨房的热情。\n\n2、做饭很需要别人的鼓励和支持，其实很多人都去尝试过做饭，但是做完之后面临的就是重重打击。\n\n3、妈妈永远是心中的厨神，很多人都觉得别人做的饭没有自己妈妈做的好吃，让人产生一种嫉妒心理，慢慢让人失去做饭的信心和兴趣。\n\n  \n\n万得厨目前做的更多是用科技改变厨房烹饪的方式，让不会做饭的人更快的学会做饭，让做饭的门槛变低，更安全更便利等等，本质上是将\"健康、安全、美味、便利\"贯彻到位，但毕竟万得厨是一个冷冰冰的机器，缺少了一样很重要的东西-情绪价值，这恰恰是虚拟人能做的也应该做的，那情绪价值怎么体现，怎么结合敬老、爱幼、助残发力呢？\n\n### 关键点之一:\n\n要知道目前的消费市场的主力军应该还是年轻人，拿敬老、爱幼来说，谁敬老、谁爱幼，那更多的应该年轻人，也就是现在我们经常说的上有老、下有小的这一批人群，我们肯定听过一个广告，“今年过节不收礼，收礼只收脑白金”，为什么这么一则广告可以出圈, 就是把消费者的心理摸的非常透彻，吸引目标人群的关键点:\n\n*   中国人以\"孝“为重，营养保健品则是\"孝敬爸妈\"的最好礼物。\n*   中国人喜欢送礼的实质还是送\"面子\"，所以礼品要贵重、时尚，当然我认为还是要用心，送到位。\n*   中国老百姓容易轻信\"科学“、“权威”、“专家”的言论，所以要做好科技、专业人士的宣传。\n\n从上我们可以有什么样的感悟:\n\n敬老的背后是孝敬，孝敬背后关注的是什么？ 现在的年轻人在外打拼，父母一天天老去，难免身体上会有些问题，自己又不能在身边，即使在身边也没有很多时间去陪伴，对于很多普通人来说在父母这个层面最大的赢面就是父母能够身体健康、安享晚年，现在老年多发疾病非常之多，因为上一代的老人知识还比较欠缺，在健康，疾病预防这块的专业知识很少，有很大需求。\n\n爱幼的背后是什么呢？ 是教育、是成长，一个孩子的成长过程之中，贯穿在成长过程中的教育是很重要的，为什么现在很多家长给孩子报各种兴趣班，参加各种实战教育，其中一个方面就是希望孩子有更强的动手能力，能够更加的自立，将来走向社会也能快速的适应，那我们的烹饪教育也是很重要的一环，当然现在的家长也很关心孩子的身体成长，经常会发现这么一个场景，同样年龄大的孩子身高体型差距会很大，尤其有了对比父母也是很担心，这背后就是孩子成长过程之后需要涉及的营养以及健康饮食等。\n\n我想没有谁可以拒绝在父母和孩子身上打感情牌，但首先我们这张牌打的要够有底气，否则是接不住的。所以从以上分析中可以得到以下方向: \n\n人群\n\n需求要点\n\n用户\n\n客户\n\n人群\n\n需求要点\n\n用户\n\n客户\n\n老人\n\n健康、疾病预防\n\n老人自己\n\n子女\n\n孩子\n\n烹饪教育\n\n孩子自己\n\n父母\n\n子女\n\n关注孩子健康营养\n\n子女\n\n子女\n\n  \n\n### 关键点之二: \n\n情绪价值需要结合场景化的情感设计去提供。那情感化设计有哪些核心要点呢？[情感化设计优秀案例](https://www.woshipm.com/pd/5456553.html)\n\n**本能层：表象的直接反应**\n\n是用户对产品的视觉和第一印象的本能直接反应。比如用户第一眼被产品的外观所吸引，从而对产品产生想要了解和触碰的冲动。本能层次是**先于思考和逻辑判断**的。\n\n**行为层：交互的行为关系**\n\n用户与产品在行为上产生的交互关系，**具备一定的理性和逻辑感**。比如用户在使用这个产品会从操作流程中产生评价，也会产生因为操作设计不合理而产生负面情绪。\n\n**反思层：情感的反思共鸣**\n\n体现在 产品的独特内涵、品牌差异性在用户的心中根植下**独有的记忆**，用户因为这份记忆会**触发情感共鸣**，从而忠实于产品。用户会产生有意识的考虑和基于经验的反思。\n\n关注不同的人群在情感化需求上到底需要什么？怎么能做到恰到好处，关键点有以下几个方面考虑:\n\n*   研究用户需求和场景: 了解用户在不同场景下的需求和情绪状态，可以从宏观和微观的角度去洞察不同人群细分情绪状态，比如: 一个单身的在外漂泊的独居女性，面对很大的工作压力，无人倾诉她需要什么？\n*   设计人性化的界面和交互: 通过界面设计和交互设计来传递情感和情绪。例如: 使用温暖、舒适的色彩和图像，采用流畅、自然的动态和过渡，创造亲切、友好的界面和体验，让用户感到愉悦和舒适。\n*   提供更多个性化的服务和反馈：根据用户的兴趣、偏好和行为习惯，提供个性化的服务和反馈。例如: 推荐个性化商品，打造专享虚拟人，用最熟悉的语言和声音进行交互对话。\n*   引入情感化的语言表达话术: 在产品的语言和表达上，运用情感化的元素，例如使用幽默、温情、鼓励等方式来与用户进行互动，增加用户的情感共鸣和参与度，减少冷漠、机械的语言。\n*   关注用户体验的细节: 细节决定成败，注意产品各个环节和细节，为用户提供细致入微的关怀，关注性能体验、交互体验、视觉体验。例如: 出错提示时，给予用户友好和理解的反馈，避免让用户感到沮丧和困惑。\n\n人群细分\n\n缺失情感\n\n心理变化(场景)\n\n产品设计方向\n\n通用需求(共性)\n\n人群细分\n\n缺失情感\n\n心理变化(场景)\n\n产品设计方向\n\n通用需求(共性)\n\n空巢老人\n\n  \n\n  \n\n  \n\n  \n\n宝妈\n\n  \n\n  \n\n  \n\n  \n\n单身独居青年\n\n  \n\n  \n\n  \n\n  \n\n  \n\n  \n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}