{
	"title": "·FTT平台宣传后台测试小结",
	"author": "王宇",
	"publishTime": "三月31,2023",
	"readTime": "12s",
	"tags": "[\"4）平台宣传类\"]",
	"description": "4）平台宣传类",
	"article": "1\\. 主要产品功能\n==========\n\n【训练】 ：对已编辑的FAQ库进行同步，未训练过的问答对内容不会收到测试反馈；\n\n  \n【FAQ测试】 : ①支持单条输入测试问句，测试实际返回效果；  \n②支持根据模板批量测试问答对，返回\\[预测FAQ\\]、\\[预测FAQ置信度\\]、\\[是否正确\\]（即期望FAQ和预测FAQ是否一致）\n\n  \n【FAQ排查】 : 已知置信度的提高有两种方法，方法①增加期望FAQ的置信度，方法②降低干扰FAQ的置信度。  \n当反馈结果正确时，FAQ排查可以通过转移相似问的方式降低干扰FAQ的置信度继续提高期望FAQ的置信度；  \n当反馈结果为否时，FAQ可以通过增加相似问，直接起到期望FAQ的置信度；\n\n  \n\n注：FTT后台各部分的功能在使用过后都会很好理解，要点在于如何利用已有的功能帮助我们加速问答内容的整理及提升准确率。\n\n唯一值得说到的有FAQ排查，FAQ排查功能在少量问答对的时候可能会显得可有可无（冲突较少），在大量测试时却能够有效帮助我们找出影响置信度的“捣乱”因子，将其放回正确的位置。\n\n  \n\n2\\. FAQ测试\n=========\n\n本月内共进行了3次平台宣传问答对测试。关键反馈结果如下：\n\n序号\n\n问答对总数\n\n测试条数\n\n正确率\n\n测试人\n\n新增相似问\n\n备注\n\n序号\n\n问答对总数\n\n测试条数\n\n正确率\n\n测试人\n\n新增相似问\n\n备注\n\n1\n\n56\n\n112\n\n41.5%\n\n邹正清\n\n35\n\n  \n\n2\n\n56\n\n56\n\n53.5%\n\n冯天凤\n\n20\n\n  \n\n3\n\n56\n\n56\n\n62.5%\n\n冯天凤\n\n21\n\n  \n\n  \n\n3\\. 测试总结\n========\n\n1、加强对返回结果拓展\n\n目前批量测试返回的结果主要包括两个值，第一值为是否正确（对于正确率），第二个值为置信度。针对当前测试，可将正确率的提升放在首要工作，可先保证回答的正确率达到某一标准后，再通过前面积累输出的测试结果返回头对置信度低的问答对进行调整，提高问题置信度。\n\n以下是测试过程中摸索到的方法，可有效提升工作效率：\n\n①对测试结果为否的问题进行新增相似问后，可以该相似问进行拓展，据此添加更多的相似问；（正确率低的原因是由于系统语义理解能力尚不足，因此在系统能力不足情况下，要求手动添加相似问的近似问来帮助提升回答能力）\n\n②关键词汇提炼，除问题的标准答对应的属性关键词外，还可以总结该问题其他的可能关键词，融入到相似问中。\n\n更多方法待总结...\n\n  \n2、相似问增添\n\n以平台宣传为例，尽管每个问题的相似问平均到4-5条之间，但几次测试的结果虽然正确率有所提升，但依旧不高。且添加的相似问越多，对于测试正确率的提升肯定是边际递减的。\n\n相似问的添加工作重点且紧急，因此需要持续探究相似问的添加办法（无论是规范还是穷举）。\n\n  \n3、分工问题\n\n由于本周重点工作依旧为健身教练方向的问答对的撰写，只有一次为自身测试。\n\nFTT后台的使用本意首先是自己利用该系统进行批量测试发现问题，解决问题，而不是在不完善的问答库交由其他同事去测试，最终降低两个人的工作效率。\n\n因此后续应更主动承担责任，尽量将问答对相似问添加完整，再交由测试组测试，反馈调整。\n\n  \n4、缺少盲测  \n目前的全部测试皆由内容组同事进行，对于用户角度出发的提问尚未关注到，这是后续正确率提升之后需要关注的问题。\n\n4\\. 后续工作重点（4月）\n==============\n\n1、总结FTT后台的返回逻辑\n\n知其然，知其所以然！正确率低的很大一部分原因还是由于对于FTT后台系统的不熟悉。后续的首要工作还是要了解FTT对于相似问的识别逻辑、能力。\n\n团队共同总结探究规律，在4月培训之前，列举FTT后台相似问识别相关问题。\n\n  \n\n2、规范标准问、相似问\n\n已知，当前使用的FTT系统后台能力上跟讯飞AIUI存在差距。根据前两次问答测试反馈结果，不规范的标准问以及相似问将带来两个可能麻烦：\n\n①本身识别不出；（能力问题，科大上可能能识别，但FTT后台不能识别）\n\n②添加相似问臃肿；（未总结规律，形成逻辑）\n\n因此后续的测试要注意总结标准问及相似问的句式，帮助有效提升工作效率及识别率；\n\n  \n\n3、提升准确率\n\n提升准确率的方法除上面提到的规范标准问、相似问和添加相似问的近似问外，还需要格外关注测试组同事的测试结果来帮助提升；（可以从他们撰写测试问句的角度分析我们忽略的问法）\n\n  \n4、根据总结经验指导运动顾问问答对导入\n\n3月测试内容主要是少量的平台宣传问答对，但运动顾问方向的问答对数量更多，难度更大，因此需要有效依据总结的经验减少前面犯的错误。\n\n  \n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}