{
	"title": "3、展会场景问题记录",
	"author": "王宇",
	"publishTime": "五月21,2024",
	"readTime": "12s",
	"tags": "[\"十九、项目履行\"]",
	"description": "十九、项目履行",
	"article": "一、现场相关调试工作\n----------\n\n1、硬件安装、软件版本更新、网络测试、定向麦角度测试、外接音响连接测试、定向麦测试、外接麦克风测试、红外雷达串口版本更新；\n\n2、展会现场背景噪音超过70分贝，设备自带定向麦克风在该类型场景下效果表现较差；提前准备的无线话筒在现场无法连接，安卓系统切换声源输入不可控，补充购入2个款式麦克风进行测试；\n\n  \n\n二、现场使用情况\n--------\n\n1、无线麦克风连接不成功，语音交互不佳，518早上主要用触屏功能支持抽奖；\n\n2、新购买麦克风518下午取到，多次尝试后连接成功，在背景噪音80分贝场景下，可保持较好的交互效果；  \n     和育林总、FPF教研院所销售方案负责人梁芳香讲解产品功能，较为认可，认为可视需求加入相关整体方案中，同时反馈，高校教学中对可视化需求较高；对于养猪专家问答的功能模块，院校学生会有较高使用需求，现场体验感觉效果尚可；  \n     和石总简要介绍产品功能；\n\n3、519早上主要引导观众使用虚拟人语音交互进行抽奖互动，大部分人可以很快掌握唤醒词+语音命令的交互方式，且现场不同年龄、性别、地区的不同口音识别成功率也较高；（在未引导前，较多用户偏向使用唤醒词与命令词连说的方式及不唤醒直接交互的方式）\n\n4、现场观众对于与虚拟人互动感觉较为新奇，设备调试进行互动测试时，路人回头率比较高。\n\n三、现场问题总结\n--------\n\n问题描述\n\n现场解决情况\n\n需关注问题\n\n备注\n\n问题描述\n\n现场解决情况\n\n需关注问题\n\n备注\n\n展会场景基本模拟了声学交互可遇到的最差情况（高环境噪音、现场多设备信号干扰），环境噪音常态保持在70分贝以上，最高分贝会达到85以上。\n\n高环境噪音下，定向麦无法有效工作（唤醒、拾音、字准均不佳）\n\n外接麦克风方案，自带话筒无法连接，补充购买2款麦克风，其中1款调试后可用：  \n1、在设备Line in输入接口插入麦克风接收器，与手持麦克风信号对齐；拔出设备自带定向麦的USB接线；  \n2、在设置界面，将声音输入设置为Line in输入；  \n3、如连接蓝牙音响，检查蓝牙音响是否占用通话通道，如占用，在蓝牙连接的设备信息中进行关闭，仅保留媒体音量；  \n4、以上接线与设置完成，重启设备；  \n5、重启设备后，检查音响蓝牙连接、网络连接；  \n6、打开软件，测试话筒声学交互；  \n7、确保仅有一个使用麦克风的软件在运行，避免占用。\n\n1、无线麦克风连接不稳定（需关注物理接口稳定、无线信号稳定、抗干扰等，自带麦克风话筒在现场无法有效连接，新购买的麦克风也存在连接不稳定情况），需补充评估有线与蓝牙的方案（设备主板仅支持对有线连接的设备提供5V供电）；  \n2、麦克风拾音与降噪能力；  \n3、交互屏设备声音输入输出控制不便利，无法有效判断设置的输入输出情况；\n\n1、已有设备的检查—寄到厂家评估  \n2、新增方案（蓝牙、有线）—待纳入工作计划；  \n3、第三方声音输入输出控制软件—\n\n设备自带扬声器功率不足，需外接音响进行扩音\n\n1、连接蓝牙音响，在连接的设备中开启媒体音量，关闭通话通道；  \n2、在设置界面，将音量调整最大；按设备按钮将音量调整最大；  \n3、将扬声器正面朝向交互者。\n\n1、区分设备声音输入输出的控制，各通道音量调整合适；  \n2、后续如考虑有线连接方案，需评估设备主板的插孔兼容支持情况；  \n3、评估拓展音响本身扬声器的最大功率效果。\n\n  \n\n现场网络不稳定，低网速情况下，切换页面时虚拟人加载时长偏高、调用idle状态慢（模型保持A字型时间过长）、语音播报存在卡顿、大模型回复生成存在延迟\n\n切换自带热点\n\n1、交互屏本身无法进行网络速度监测，无客观数值辅助评估，主要靠主观感觉或者手机连接同一网络后辅助测试；  \n2、设备在线情况无法监测。\n\n找第三方软件  \n  \n\n基于大模型的养猪问答回复，未回复完整的情况偏高\n\n无法解决，存在重新交互但回复仍不完整的情况\n\n  \n\n0524版本处理\n\n配置的热词仍存在识别差的情况\n\n1、加大关键热词权重  \n2、近似识别的加入到相似话术\n\n  \n\n交互屏可以开启单独一个应用，后续可与炉端所用AIUI应用分离\n\n关键交互的泛化性不足\n\n引导用户替换其他话术\n\n1、关键交互需补充维护相似话术；  \n2、补充高频交互误命中的干预处理；\n\n闲聊模块遗漏配置\n\n红外雷达串口升级不成功\n\n未处理\n\n设备寄回广州后再处理\n\n待处理\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}