{
	"title": "2、竞品分析",
	"author": "王宇",
	"publishTime": "三月06,2023",
	"readTime": "12s",
	"tags": "[\"产品相关知识\"]",
	"description": "产品相关知识",
	"article": "*   1[1\\. 确定目的](#id-2、竞品分析-确定目的)\n*   2[2\\. 选择竞品](#id-2、竞品分析-选择竞品)\n*   3[3\\. 资料搜集](#id-2、竞品分析-资料搜集)\n    *   3.1[3.1. 搜集并分析用户的意见](#id-2、竞品分析-搜集并分析用户的意见)\n    *   3.2[3.2. 搜集并分析竞品的数据](#id-2、竞品分析-搜集并分析竞品的数据)\n*   4[4\\. 竞品分析](#id-2、竞品分析-竞品分析)\n*   5[5\\. 利用竞品分析报告指导产品的改进](#id-2、竞品分析-利用竞品分析报告指导产品的改进)\n*   6[6\\. 总结](#id-2、竞品分析-总结)\n\n做竞品分析的思路框架：\n\n1\\. 确定目的\n========\n\n1.  你的竞品报告是为了谁（产品团队、研发设计还是运营、老板）而做。\n2.  你要着重分析哪些内容。\n3.  这个报告需要为谁（产品团队、研发设计还是运营、老板）带来什么有价值的结论和建议。\n\n*   产品里面某个功能是否需要修改犹豫不决，因此希望借助竞品分析来给这个功能是否修改提供一个依据，那么从这个目的出发，我们只要找到有相关功能的竞品，然后主要对这个功能进行对比研究分析即可。\n*   在战略层面上，团队对产品的商业模式有一些疑问，因此想通过竞品分析来拓展商业模式方面的一些思路，那么从这个目的出发，我们就要从宏观上找到相关的竞品，看看它们的运作方式，了解它们的盈利点，再与它们进行对比分析。\n*   对自己产品的交互设计以及视觉UI设计不够满意，希望变得更加易用并且美观。那么从这个目的出发，我们就要找到那些交互和视觉设计都做得不错的竞品进行比较分析，然后主要从交互和视觉角度去比较分析即可。取其精华去其糟粕。\n\n2\\. 选择竞品\n========\n\n1、竞品数量选择不必过多，选择1——2个优质竞品。可以根据80/20原则，密切关注20%比较突出的竞品即可。  \n2、在如何选择竞品对象方面，一般选择当前市场的直接竞争对手或者将来的潜在竞争对手的产品来进行分析。  \n（1）核心目标用户都是同一群体（但是满足的需求不同）的产品：就算不是竞争对手，但是对方的目标用户跟我们的目标用户基本一致，那么我们就可以去分析对方，看看对方在“产品”和“运营”角度是如何吸引目标用户的，而我们又可以从中学习到关于“产品”或者“运营”方面哪些好的经验并应用到我们的产品和运营当中去.  \n（2）满足的都是同样的需求的产品（当下直接的竞争对手）  \n（3）其他的产品（未来潜在的竞争对手）\n\n3\\. 资料搜集\n========\n\n3.1. 搜集并分析用户的意见\n---------------\n\n1、了解我们产品和竞品的核心用户对于产品的看法和意见。比如说：\n\n*   他们是如何看待我们和竞品都有的功能，他们是如何比较这个功能的；\n*   我们没有的功能但是竞品却有的功能，他们又是如何看待这个功能的，用户会不会因为这个功能而选择用竞品而不是我们；\n*   我们有的功能但是竞品没有的功能，他们又是如何看待这个功能的，这个功能能不能帮助我们从竞品那里抢夺用户。\n\n2、主要从这三个角度来分析用户的意见，分析的方法可以有很多，比如说：\n\n*   app store、app annie、知乎、应用软件社区、产品行业网站、咨询公司的一些相关报告，行业内的一些红人或者牛人的博客以及自媒体，还可以是竞品的官方微信、微博的评论等等；\n*   从公司同事了解一些关于我们产品和竞品的评论信息，与我们产品的客户进行沟通，了解他们对我们以及竞品的评价，与朋友家人也可以进行相关讨论；\n*   做用户访谈，与用户聊天，或者做用户测试，让用户同时使用我们的产品和竞品，观察用户的行为，问一些有针对性的问题，了解用户的想法，从而获得用户的意见；\n*   还有一点，别忘了自己要使用并熟悉竞品，还可以咨询对方的客服和技术支持，把自己的感想和评论也要记录下来。有些竞品可能还会有一些社区或者论坛甚至是微信群或者QQ群，在社区论坛微群里面你也可以收集很多有价值的信息。\n\n3.2. 搜集并分析竞品的数据\n---------------\n\n1、了解我们和竞品的市场或者产品等方面的数据对比。比如说：\n\n*   我们与竞品的市场份额占有比例，下载量对比；\n*   我们与竞品的用户数量对比，用户增长率，增长趋势，活跃度对比；\n*   其他数据\n\n  \n2、主要就是获得这些数据，至于获得的方法有很多，比如说：\n\n*   百度指数，淘宝指数；友盟指数；\n*   艾瑞咨询，易观智库，CNNIC，比达咨询，DCCI互联网数据中心，TalkingData，ASO100，Alexa;\n*   App store，app annie；\n*   其他等等\n\n4\\. 竞品分析\n========\n\n  \n对于产品经理来说，竞品分析的主要关注点一般还是在产品功能设计（包括功能、界面、交互以及视觉设计等）以及产品的战略等方面。  \n（1）画出竞品的结构图：  \n通过对比了解竞品之间的差异，主要是了解功能方面的差异。  \n（2）画出竞品的用户使用流程图  \n（3）以用户使用流程图为线索进行竞品分析：\n\n**A 核心功能的用户使用路线流程比较分析：**  \n目的：通过对比竞品的核心功能，得出可以改进我们产品核心功能的方案，包括功能设计，交互设计，视觉设计等方面。达到人有我优的境界！\n\n**B 非核心功能的用户使用路线流程比较分析：**  \n找到我们与竞品的几个非核心功能的用户使用路线流程进行对比。然后，同样把涉及到的功能和界面（交互方式、视觉表现）等方面都进行比较分析，然后结合之前分析的用户评论和市场数据进行综合比较，得出自己的改进建议，并给出理由。\n\n**C 对方没有但是我们有的用户使用流程或者功能点分析：**  \n那么这里最主要的分析点可以是：\n\n1.  对方为什么不做这个功能，他们的目的是什么，这个功能与他们企业或者产品的目标是什么关系？\n2.  我为什么做这个功能，我们的目的是什么，这个功能与我们企业或者产品的目标是什么关系？\n3.  目标用户以及竞争对手是如何看待这个功能的？这个功能能不能帮我们从竞品那里抢夺用户？又或者我们会不会因为这个功能而失去用户？\n\n**D 我们没有但是对方有的用户使用流程或者功能点分析：**  \n我们要考虑的就是我们到底需不需要加上这个功能，同样可以这么考虑：\n\n1.  对方为什么做这个功能，他们的目的是什么，这个功能与他们企业或者产品的目标有什么关系？目标用户对这个功能是如何看待的？他们会不会这个功能选择竞品而离开我们？\n2.  我们现在为什么没有做这个功能，我们的目的是什么，这个功能与我们企业或者产品的目标是什么关系？\n3.  假如我们要做这个功能，会对我们的产品产生什么影响，是否契合我们整体的产品风格，产品目标等等？\n\n  \n**E 一些其他方面的分析**：  \n关于app设置功能的比较分析；\n\n*   关于app启动页面或者引导页面的设计；\n*   关于app全局交互方面的一些设计（比如说网络问题，机型适配问题，特殊情况交互说明，全局手势，退出机制，显示机制，排序机制，刷新机制，缓存机制，控件交互等等页面条件方面的设计），这里的一些比较分析可能会跟前面的核心或者非核心功能的比较分析有雷同的地方；\n*   关于开发了哪些平台的问题，iOS，Android等等。；\n*   其他方面\n\n**10项比较常用的可用性准则为：**\n\n1.  一致性和标准性；\n2.  通过有效的反馈信息提供显著的系统状态；\n3.  方便快捷的使用；\n4.  预防出错；\n5.  协助用户认识，分析和改正错误；\n6.  识别而不是回忆；\n7.  符合用户的真实世界；\n8.  用户自由控制权；\n9.  美观，精简的设计；\n10.  帮助和说明。\n\n了解竞品的发展历程，通过了解竞品的迭代以及改进信息，把握竞品的发展脉络，并以此作为借鉴，看看我们的产品在现阶段有什么问题，了解差距在哪里，并积极寻求方法弥补这些差距，同时还要思考行业和我们产品未来的发展方向，想办法寻找更加优秀的切入点。\n\n5\\. 利用竞品分析报告指导产品的改进\n===================\n\n首先，我们要明确我们的产品目前处在什么阶段，因为不同的阶段对于竞品分析报告可以有不同的应用方式，比如说：  \n（1）在研究用户和功能需求的阶段：  \n将竞品分析作为我们即将形成的用户需求文档（如人物角色)以及产品需求文档的参考。  \n（2）在确定产品逻辑结构框架或者信息结构的阶段：  \n根据竞品分析得出的一些关于功能分析，信息架构，逻辑结构和框架等方面的结论来指导我们这个阶段的产品的逻辑结构规划。  \n（3）在设计产品的高保真原型图、设计效果图的阶段：  \n根据竞品分析得出的一些具体的设计思路和方案，为我们的产品提供思路和灵感。  \n（4）在产品的可用性测试阶段：  \n针对某一具体功能、问题做深入的对比，以此作为可用性测试结果的佐证。  \n（5）在产品的迭代改进阶段：  \n根据竞品分析得出的一些功能或者界面方面的改进思路，用来指导我们产品的改进，以此作为产品迭代的相关依据。\n\n6\\. 总结\n======\n\n1、根据我们产品所处的阶段确定了我们如何应用竞品分析报告之后，我们就要根据我们的目的，把从竞品分析报告中得出来的建议进行分析，这里最好是让整个产品以及设计研发团队参与进来。  \n2、通过进行类似的竞品分析功能评审会议，敲定我们最后需要改进的功能方案或者界面方案，然后应用到我们的产品改进当中。  \n3、将竞品报告中经过大家讨论并筛选出来的有利于产品的建议进行实践，并在后续的过程中做好数据的跟踪和反馈，进一步论证这个改进的地方是否对我们的产品有好处，有好处则留下，不利则去掉，然后继续进行分析，循环往复，不断指导产品的升级和迭代，帮助产品提升市场竞争力。这才是做竞品分析报告最终的目的。\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}