{
	"title": "运动顾问行业调研报告",
	"author": "王宇",
	"publishTime": "十二月29,2022",
	"readTime": "12s",
	"tags": "[\"邹正清\"]",
	"description": "邹正清",
	"article": "一、运动顾问基础知识\n==========\n\n1.1运动概念\n-------\n\n运动：是一种涉及体力和技巧的一套规则，又有习惯所约束的行为活动，通常具有竞争性，现在更多的是指体育运动，指代能够促进身体健康的身体活动——以身体练习为基本手段，达到增进健康、丰富社会文化娱乐生活为目的的一种社会活动。\n\n1.2运动顾问概念\n---------\n\n运动顾问：能够为用户提供专业运动知识，指导他人进行正确的运动方式，最终达成运动目标的专业人员。\n\n1.3运动顾问的主要工作内容\n--------------\n\n### 1.3.1帮助树立正确的运动健康观\n\n运动与健康效益之间存在复杂的因果关系。目前，运动不足已成为全球范围死亡的第四位危险因素，许多国家缺乏运动的人群比例在不断增加。大量研究表明，对各个阶段的人群而言，适当的运动对身体的健康是有益的。  \n同时正确的运动健康观也是帮助用户走向运动、达成运动目标的必要条件。因此运动顾问的工作职责首先是帮助树立正确的运动健康观。\n\n### 1.3.2了解用户\n\n个体之间的身体状况存在差异，不对用户的健康状况、运动习惯等有所了解，就不能根据用户的需求指定运动计划，甚至有可能适得其反。  \n以用户的健康状况为例，运动顾问需要了解用户可能有先天性心脏病不宜开展长跑，。这些都要求运动顾问与用户做到多沟通，准确了解用户的健康状况，在保证用户安全的前提下，保障他们的运动健康。\n\n### 1.3.3制定合理的运动计划\n\n第三步，运动顾问需要根据收集的用户的健康状况结合用户自身的需求，制定行之有效的运动计划以达成用户所希望达成的目标。  \n对不同的个人，他们开展运动的需求不一样，有的人是出于肌肉锻炼需要进行运动，增肥/增重也是常见的需求。运动顾问理应从用户的运动目标需求出发，根据用户的时间对运动的频度、时间进行合理规划。\n\n### 1.3.4教学指引，帮助达成目标\n\n在了解客户的情况并对其开展的运动进行规划后，最难也是最重要的环节是帮助引导客户，使其达成运动目标。在现今，其实大部分人已经树立了正确的运动健康观，大家都渴望能够通过运动来提升自己的精神状况以及健康水平，但一方面是苦于没有时间，一方面是运动的过程对于大多数人来说并不算容易。  \n因此，运动顾问还需要对运动进行适当的教学指引，让运动变成一门生动有趣的课堂，让大家在参与的过程既能收获快乐，同时达成健康的目标。如：任天堂的《健身环大冒险》游戏就是通过将运动健身融入到了游戏当中，以极其有趣的方式在年轻一代中快速蔓延传播，极大的推动了他们对运动健身的参与。\n\n二、现状分析\n======\n\n2.1运动顾问发展现状\n-----------\n\n### 2.1.1我国运动行业发展历程\n\n总体来说，我国运动行业开启时间比较晚，但是发展速度却是飞快的，主要可以分为一下四个阶段：  \n·2000年以前——大众自发运动  \n2000年以前，由于大众运动尚为广泛普及，大众运动健身多为自发的行为，该情形也更多见于一线城市以及具有时间的群体；同时，国内健身&健美行业概念开始萌芽，威尔士、浩沙等第一批运动健身品牌开始出现。\n\n·2001年之后——运动观念养成  \n2001年中国申奥成功激发全社会对体育运动的强烈关注，推动大众开展体育运动，推动了大众运动观念养成以及体育运动设施建设。\n\n·2008年——奥运与政策带动运动热潮  \n2008年北京奥运会的成功举办带来全民运动的热潮；2014年46号文件出台带动体育产业发展，自此体育产业相关政策陆续出台；同时，体育运动的自发休闲模式也开始向专业指导模式倾斜，大众对运动方面的服务需求日益增加。\n\n·今——互联网与科技带动行业升级  \n互联网运动兴起，Keep等互联网企业带动大众运动生活方式的转变升级，并且各大品牌也相继研发推广智能手环、体脂秤等智能设备，智能科技的应用为运动行业的发展创造更多元的服务方向。\n\n从发展历程上来看，在大众运动健身习惯养成、大型国际赛事带动以及国家政策的影响下，中国运动行业的发展一直保持着文件的步伐，整体格局稳定。近些年，随着疫情的放开以及智能科技的发展，运动行业也引起越来越多的人关注，智能设备、智能科技为行业的升级起到了助推作用。\n\n### 2.1.2行业宏观环境\n\n在政策方面，政策红利为全民运动热潮提供有利条件。  \n党的十八大以来，我国体育事业取得长足发展，全民健身运动蓬勃开展，2014年全民健身上升为国家战略，2022年北京冬奥会、冬残奥会成功举办，实现“带动三亿人参与冰雪运动”目标。北京冬奥会的成功举办，全方位推动全民健身开展和体育强国建设，有效满足人民群众多层次、多元化的体育消费需求，提升国民健康水平和国际竞争力，中国体育产业迎来黄金机遇期。  \n2021年10月25日，国家体育总局发布《“十四五”体育发展规划》，对“十四五”时期我国体育产业的发展方向、战略任务和具体措施进行部署，围绕体育强国建设，力求推动“十四五”体育重点领域实现高质量发展……\n\n在人口因素方面，中国大众生活水平提高，消费力和消费医院逐年上升，生活方式快速转变升级，但诸多广泛的健康问题随之而来，这促使大众的健康意识水平越来越强烈。在移动生活的时代下，运动知识被快速高效的传播，类型产品快速被市场接受，用户需求不断分化，推动互联网运动行业快速发展。\n\n### 2.1.3市场发展现状\n\n从行业规模来看，运动健身人群规模增多，体育用品销售规模增速提高，体育场地基建保持增长态势，运动健身从业者规模加大，诸多相关数据显示，行业规模还在持续扩大，未来发展前景广阔。  \n·用户规模：2020年数据显示，每周参与1次以上体育锻炼的人数达7亿，经常参加体育锻炼的人数达到4.35亿  \n·体育用品规模：自2015年起，中国线上运动用品市场规模不断扩大，2020年运动用品市场规模已达1749亿元。  \n·场馆规模：至2020年底，全国体育场地共有371.34万个，体育场地面积30.99亿平方米，人均体育场地面积2.20平方米。  \n·运动健身从业者规模：截至2020年12月份，中国健身教练从业人数约为90万，其中健身俱乐部教练61.2万，工作室教练28.8万。可以预料的是，疫情开放后，运动健身从业者规模将保持增长。\n\n从行业结构来看，中国运动行业仍以休闲为主，缺乏一定的专业性，并且虽其发展迅速，但仍然存在诸多问题有待解决：主要体现为体育大行业整体结构发展不均衡，领域的商业模式缺乏创新，且长期缺少用户服务层面的投入。  \n·国内的运动行业结构，制造业占80左右，而服务业仅占20%，远低于美国同期的发展水品，产业结构不均衡，服务业发展刚刚起步。  \n·中国运动人群长期以自发休闲运动为主，专业运动的消费理念虽有成长但远未成熟，未来的市场教育空间仍大。\n\n三、发展趋势\n======\n\n3.1运动顾问发展趋势\n-----------\n\n### 3.1.1服务更广\n\n在不同的年龄段，用户的成长情况、学习环境、家庭环境随时间发生变化，运动的需求及目的也随之发生变化。青少年和青年身体状况较好，偏爱较高强度的运动项目；中年用户应对工作环境压力，解压、减肥需求增高；中老年用户身体条件下降，对养生健体、社会属性强的低强度活动需求较大。运动顾问也需根据不同人群体征的需求做出相应的服务调整。  \n满足全生命周期用户需求：  \n0-18岁：兴趣爱好、项目培训、强身健体……  \n19-35岁：增肌塑型、美容减肥、产后恢复、运动社交……  \n36岁以上：健康饮食、健康医疗、降低三高、保健养生……\n\n### 3.1.2服务更深\n\n如今，运动理念已经融入广大人民群众生活的方方面面。并且在挖掘服务深度，打通多种生活场景，构建运动健康生活体系不断加强其趋势，而我们也能够在用户生活中找到更多的切入点，大同多种生活场景，为用户构建起一套完整的运动生活体系。  \n家庭场景：家庭运动APP、虚拟教练、远程指导  \n餐饮场景：健康轻食、热量规划、饮食定制  \n交通场景：日常运动计步、路途中运动知识阅读与运动社交更新  \n健身场景：专业运动健身指导、每日健身计划、专业健身设备  \n……\n\n### 3.1.3科技融合\n\n智能科技与运动健康的有机结合是未来发展的必行之路。如何通过智能设备提升运动效果并对运动效果监测一直是个艰难却有重大意义的事情。而智能科技的应用能够提供很多问题的解决途径，因此近些年来有许多该方面的企业在智能健康、智能运动方面的投入不断加大，而这也推动着行业向智能化方向快速发展。\n\n  \n\n![](/download/attachments/91152332/%E5%9B%BE%E7%89%871.png?version=1&modificationDate=1672289321823&api=v2)\n\n图2.2.3 科技融合带来的运动升级方向\n\n四、相关产品分析\n========\n\n4.1 Keep\n--------\n\nKeep于 2015 年2月上线，Keep在早期是一款针对健身小白用户的线上健身工具，主要用于解决最广大群体最直接的健身需求，培养用户健身习惯；随着发展，扩充了运动品类，包括了跑步、骑行、健身、瑜伽、街舞、健走等多种运动形式。  \n2017年Keep用户累积过亿，为线上内容付费和线下业务扩展提供用户基础；现在Keep致力于提供健身教学、跑步、骑行、交友及健身饮食指导、装备购买等一站式运动解决方案，增加了专业化定制化内容，衔接线上课程+线下指导，并发展出自己的线下运动空间Keepland和智能硬件，来为用户提供更完善的运动健康服务。\n\n![](/download/attachments/91152332/%E5%9B%BE%E7%89%872.png?version=1&modificationDate=1672289396769&api=v2)\n\n图4.1 keep应用下载量遥遥领先\n\n产品定位：  \n一站式运动解决方案  \n一款专为年轻人提供指引的线上运动类产品\n\n根据keep最新公布的数据，keep的用户中，女性用户占比58.5%，男性占比：41.5%，30岁以下用户占比76%，可以看到KEEP主要用户为年轻人。  \n现在年轻女性对身材、相貌有着较高的要求，以减肥和塑形为主要的目的。在keep上，可以看到精心为女性准备的健身教程，列如：早安瑜伽、气质瑜伽、理疗瑜伽、燃脂翘臀骑行、时尚热舞、晚安瑜伽等课程，除了健身课程外，还有相应的饮食套餐和运动健身辅助食品等。  \n现在的年轻男性也开始最自己的身材，相貌有所追求，为了练就八块腹肌，也是加倍努力。KEEP在app里为针对男性用户做了，暴汗搏击、腹肌撕裂、消灭肚腩等增肌课程\n\n商业模式：  \n·kepp会员：通过售卖会员的形式解锁用户权益，提升用户粘性和活跃度。  \n·自营产品：售卖keep自营的运动消费品已经成为keep商业化的新引擎  \n·知识付费：提供运动解决方案，通过售卖线上课程，线下团课，及直播付费形式，让用户线上能够随时深度学习  \n·售卖广告：在产品内插入广告，目前有两种形式，一种是固定的广告位，还有一种动态随机性的广告\n\n总结：  \nKeep目前在健身领域一枝独秀，很多运动类用户最终都只安装了keep这一款运动类App，足以证明Keep的产品实力。  \nKeep优质的健身课程体验，帮助很多用户实现了自己的减脂目标；社区内容也是正能量满满，帮助用户分享知识，交流运动心得。  \n但是运动本身作为一件反人性的事，不可避免的存在很多用户难以坚持的情况，Keep除了提供优质的教学课程，还正在建立建立良好的激励措施，比如更全面的数据量化和展示的方式，给予及时反馈，帮助用户更容易养成健身习惯。\n\n4.2任天堂——健身环大冒险\n--------------\n\n健身环大冒险的虽说是Switch上的一款体感类游戏,但本质上不是游戏,它是一款健身锻炼的辅助工具。  \n传统的锻炼方式新手在每次锻炼之后除了累之外很难体验到运动乐趣，锻炼运动中更多的是感到无聊和难以坚持。  \n健身环大冒险通过丰富有趣的关卡、冒险、收集金币、打败Boss、打开宝箱等一系列游戏设让锻炼这个漫长而无聊的过程变得丰富吸引人。  \n截止2022年8月，《健身环大冒险》销量超过1454万份，做到真正的一环难求。\n\n![](/download/attachments/91152332/%E5%9B%BE%E7%89%873.png?version=1&modificationDate=1672289481870&api=v2)\n\n总结：  \n健身环大冒险在运动健身领域的成功告诉我们，想要引领全民运动、全民健身可以换个角度出发。在众多运动领域公司都无法做到的情况下，任天堂作为一家游戏公司，从游戏的角度出发做产品，其轻松活泼的氛围一样实现了破壁，同样业极大的推动了全民运动健身的发展，扩大到更广泛的群体。\n\n  \n\n  \n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}