{
	"title": "关于健康顾问调研报告-2022/12/21",
	"author": "王宇",
	"publishTime": "十二月21,2022",
	"readTime": "12s",
	"tags": "[\"周引凤\"]",
	"description": "周引凤",
	"article": "根据网络上能找到的一些信息和文献查阅，了解到更多关于健康顾问方面的知识。\n\n1 健康背景\n======\n\n1.1 大健康\n-------\n\n       健康产业意味着医疗产品、保健用品、营养产品以及健康管理等，但随着消费者认知中健康诉求的变化，更日常的一些产品品类也可以归入泛化的健康产业，即“大健康”。这主要是由两方面因素决定的：一方面是提高生活品质的意识，另一方面是对健康隐患与环境问题的日益关注。  \n除了以医疗器械、药品为主的医疗医药工业之外，还包括以保健食品、药妆、功能性食品、日用品等为主的相关产业，以及以个性化健康检测评估、咨询服务、疾病康复等为主的健康管理服务产业。总的来说，中国大健康产业由六大基本产业群构成：\n\n• 以医疗服务、药品、器械以及其他耗材产销、应用为主的医疗产业  \n• 以健康理疗、康复调理、生殖护理、美容化妆为主的非跨医疗产业  \n• 以保健食品、功能性食品、健康用品产销为主体的保健品、食品饮料产业  \n• 以个性化健康检测评估、咨询顾问、体育休闲、中介服务、保障促进和养生文化机构等为主体的健康管理产业  \n• 以消杀产品、环保防疫、健康家居、有机农业为主体的新型健康产业  \n• 以医药健康产业终端化为核心驱动而崛起的中转流通、专业物流配送为主体的新型健康产业\n\n       总的来说，健康涉及到的方面很多很广，对于健康的需求也多种多样。作为能够实现难易程度，网络上具有较多的开放数据平台，可以进行以医疗产业为主的健康问答。当然，医药健康最终还是要进行到个性化服务，对健康前端的疾病预防与健康后端的病后护理方面我国仍然有很多的不足。\n\n1.2 老龄化人口加剧推动健康产业\n-----------------\n\n        我国人口老龄化现象不断加剧，第七次全国人口普查数据显示，我国60岁及以上人口的比重达到18.7%，其中65岁及以上人口比重达到13.5%，人口老龄化主要呈现四方面特点：\n\n• 老年人口规模庞大。我国60岁及以上人口有2.6亿人，其中，65岁及以上人口1.9亿人。  \n• 老龄化进程明显加快。2010年-2020年，60岁及以上人口比重上升了5.44个百分点，65岁及以上人口上升了4.63个百分点。与上个十年相比，上升幅度分别提高了2.51和2.72个百分点。  \n• 老龄化水平城乡差异明显。  \n• 老年人口质量不断提高。\n\n         老年群体是大健康产业中的一大消费群体，老龄化不断加重促使国家、社会等各个方面对老年人的健康更加关注，相应的健康服务也必须不断实施与完善。大规模老龄人口的增加在医疗健康领域带来的重大变化是——健康需求的急剧增加。\n\n第一个重大变化：疾病谱结构将发生变化，原来的急性感染性疾病比重逐步下降，慢病占比会逐渐上升，慢病和肿瘤治疗的需求会大幅增长。  \n第二个重大变化：疾病诊疗以外的其它健康需求的增加，包括疾病预防、健康监测和管理、养生保健、临终关怀等方面的需求可能会出现爆发式增长。  \n第三个变化：中国的人均可支配收入快速增长，医疗健康消费升级，人们对医疗诊疗的效果、过程体验等提出了更高的要求，更看重“品质”\n\n1.3 生活慢性病增加健康需求\n---------------\n\n        生活方式的改变，慢性病、老年病、肥胖症以及亚健康等趋于增多，中国的人口亚健康情况日渐凸显，依据世界卫生组织标准，目前中国符合健康定义的人群仅占总人口的约15%，而亚健康人群的比例则高达70%左右。中国城市白领健康状况白皮书中曾显示，在城市白领人群中，有76%属于亚健康状态，过度疲劳、超重、心脑血管问题、睡眠问题等是亚健康状态的典型表现。个人不健康的生活方式以及人口寿命延长，慢性病患者的生存期不断延长，慢性病对健康的影响不断升级，且呈年轻化趋势，成为我国大健康产业需求端爆发的主要因素。因此，养生风潮兴起，越来越多的人开始追求适合自己的养生方式，包括改善身体状况、保持健康状态在内的消费意愿明显提升。\n\n2 健康顾问\n======\n\n2.1健康顾问概念\n---------\n\n        健康顾问是对患者、亚健康群体、健康群体、家庭成员或特定社会团体所面临的健康风险或影响健康的危险因素进行全面监测、分析和评估，制定健康计划、进行健康教育、提升健康意识，定期进行健康引导与健康促进，以规范其健康行为、防范和减少健康风险。  \n健康顾问师：指提供营养健康（营养师）、运动健康（体重管理师）、心理健康（心理咨询师、情感顾问）和安全健康、休闲健康、健康咨询及健康管理等顾问服务。\n\n2.2健康顾问的作用\n----------\n\n• 全面监测、分析和评估客户所面临的健康风险或影响健康的危险因素  \n• 帮助客户制定健康计划，开展健康教育，提升健康意识，定期进行健康引导与健康促进活动，督导客户养成良好的饮食、运动与生活习惯  \n• 建立客户档案，维护良好的客情关系  \n• 了解客户的生活方式，舒适区域以及个人需求和需求，以便最好地评估他们的状况并就如何改进提出建议。以鼓励和非判断的方式进行沟通。  \n• 在健康和保健咨询方面有专业知识。例如有些人专注于顺势疗法，改变自然的生活方式，有些人则专注于健身和锻炼，有些人则主要关注营养。\n\n2.3 虚拟健康顾问-相关竞品\n---------------\n\n### 2.3.1 竹间\n\n        说明书设置一个入口，即为“虚拟医药健康顾问”，让用户可以通过对话来了解药品的相关信息，做一些用药时间提醒。“虚拟医药健康顾问”仅通过对话就可以提升患者的医嘱遵从度，随时随地应答患者的药品科普与健康管理相关咨询，实现医生患者非接触地远程诊疗互动，进而提升患者的愈后水平与生活质量。作为患者来说，这位“顾问”可以提供周到的私人服务。  \n       并且它在延伸医患触点同时也在积累循证医学数据，为老龄化社会减负，为未来的医药健康大平台积累经验。同时有助于供应商精准洞察客户之声与绘制客户画像，将复购与主动服务的触点前置。  \n       竹间通过虚拟医药健康顾问将患者和药品做了连接，更连接了患者与医生，患者与医院，把整个医疗过程的链路打通，覆盖整个医疗全过程，其价值已经远远超出了一纸说明书。  \n      在平台中其中一些功能并没有看到很好的实现，本质是将说明书通过有声化输出给用户，形成健康顾问。并没有很好的实现咨询能力，\n\n### 2.3.2 众安保险\n\n        众安保险推出的“AI健康顾问\"，发力医疗前端预防保健、疾病早筛等服务和后端患教问答、康复管理等服务，并逐步提升其众安精灵的“保险管家”能力，探索在线智能核保新方向，针对不同人群包括“慢病”人群、“未病”人群提供个性化风险解决方案和配套医疗服务。  \n        从“治已病”到“治未病”、“治慢病”，众安智能健康管理顾问发力，用户可登录众安保险APP，进入“健康频道”——“私人健康顾问”板块进行AI疾病自查，辅以体脂秤、运动手环、睡眠纽扣等智能设备和基因检测、HPV筛查等服务，全方位健康量化评估和细分风险人群，并针对有风险人群和慢病人群实施科学干预。这种筛查-评估-干预-监测也是目前国内最成熟的健康管理路径之一，而在这个过程中，基于AI智能技术的健康管理模型起到了非常重要的作用。   \n       对于众安保险这个平台，其本质是通过辅助健康问答形式，和互联网医疗进行连接，但是有工作时间限制，必须在工作日时间进行咨询，不能24小时进行咨询服务，因此也有一定的局限性。\n\n3 医学健康数据库平台\n===========\n\n通过对相关的虚拟健康顾问有了一定得了解之后，在搭建自己平台的虚拟健康顾问的时候，与医学健康相关的数据库至关重要，因此查找了一些相关平台进行介绍。\n\n3.1左手医生\n-------\n\n       医学知识库内容主要来源于医学专业书籍、药品说明书，融合左手医生行业领先的医学知识图谱，满足用户医疗健康类咨询需求，如药物、疾病知识及健康建议等，可实现多场景覆盖。它有一个demo，就是可以进行相关问答，通过文字输入，实现简单的问答情况，demo如图3.1所示。\n\n![](/download/attachments/91149080/1671588012838_E2C0C840-34BD-4bb1-99FE-D5E2BC95E414.png?version=1&modificationDate=1671607525165&api=v2)\n\n图3.1：左手医生的数据开放平台智能问答  \n       \n\n        可以与平台进行合作，结合虚拟人的语音转文字功能，对于输入具体的症状，它会显示出疾病的介绍，发病的原因，推荐就诊的科室，临床的表现，鉴别的一些易混淆的疾病，并且推荐疾病的治疗，生活护理，以及疾病的预防等方面。\n\n3.2 C.health数据开放平台\n------------------\n\n        为了解决数据共享难题，联通医院、药企、科研、诊疗、保健、医疗健康资讯、个人健康资料获取等多场景应用，由易联众个人健康云团队研发的“C.health数据开放平台”应运而生。该平台旨在为医疗健康行业从业者与开发者提供一站式、标准化、规模化的数据开放能力服务，依托易联众二十多年来在数字民生领域的经验与知识沉淀，为各个医疗健康服务端打造“面向不同层面用户、多样化数据开放方式、安全模式下应用数据”的数据共享平台，支持医疗健康数据知识库分享、数据标准转换、数据服务的整合，让数据资产发挥更大的价值。\n\n3.3 国家人口健康科学数据中心\n----------------\n\n        国家人口健康科学数据中心（简称NCMI）是国家科技部和财政部认定20个的国家科学数据中心之一，集成涉及基础医学、临床医学、药学、公共卫生、中医药学、人口与生殖健康等多方面的科学数据资源，还建立了16项特色专题服务，如农村三级医疗卫生专题服务、国民体质与健康专题服务、面向国际肿瘤转化医学专题服务、热点传染病预警与追踪专题服务等。例如其中的青少年健康主题数据库 (DYH) 主要是对青少年健康进行长期研究，采用现场测试，调查问卷、资料收集方法获取青少年健康资源数据，DYH 提供的数据可为青少年 (初中生和高中生) 体适能、精神与心理、营养膳食、生命质量、社会健康、危险行为、运动行为等领域研究提供数据支持，为教育管理部门与政府决策提供数据支撑。 \n\n  \n\n  \n\n  \n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}