{
	"title": "1、产品思维",
	"author": "王宇",
	"publishTime": "二月23,2023",
	"readTime": "12s",
	"tags": "[\"产品相关知识\"]",
	"description": "产品相关知识",
	"article": "  \n\n  \n\n![](/download/thumbnails/95559186/image2023-2-15_17-59-3.png?version=1&modificationDate=1676455143511&api=v2)![](/download/attachments/95559186/image2023-2-15_17-58-26.png?version=1&modificationDate=1676455107007&api=v2)\n\n  \n\n*   1[1\\. 同理心](#id-1、产品思维-同理心)\n    *   1.1[1.1. 同理心训练：怎样理解愉悦与不爽](#id-1、产品思维-同理心训练：怎样理解愉悦与不爽)\n    *   1.2[1.2. 同理心训练：怎样理解愤怒与恐惧](#id-1、产品思维-同理心训练：怎样理解愤怒与恐惧)\n    *   1.3[1.3. 同理心训练：产品要顺应用户潜意识](#id-1、产品思维-同理心训练：产品要顺应用户潜意识)\n    *   1.4[1.4. 认清人的本性，理解角色化生存](#id-1、产品思维-认清人的本性，理解角色化生存)\n    *   1.5[1.5. 自我与自律，哪一种更贴切产品精神？](#id-1、产品思维-自我与自律，哪一种更贴切产品精神？)\n*   2[2\\. 机会判断](#id-1、产品思维-机会判断)\n    *   2.1[2.1. 点线面的战略选择](#id-1、产品思维-点线面的战略选择)\n    *   2.2[2.2. 怎么找到有势能的趋势](#id-1、产品思维-怎么找到有势能的趋势)\n    *   2.3[2.3. 痛点痒点爽点都是产品机会](#id-1、产品思维-痛点痒点爽点都是产品机会)\n\n1\\. 同理心\n=======\n\n1.1. **同理心训练：怎样理解愉悦与不爽**\n------------------------\n\n如果把人想象成一部手机，情绪就是底层的操作系统，你后天学习的知识技能，都是安装在底层操作系统上的一个个APP。  \n我们后天学习的东西，都是理性，理性是把人往回拉的力量。但是驱动一个人的，其实是他的内在感受、他的情绪、他的底层操作系统。  \n生物性情绪：所有生物都一致的底层情绪\n\n*   愉悦就是被满足。我们人类不仅需要生存条件被满足，我们还需要在社会关系中被确认。\n*   需求被满足，这种感觉叫愉悦。\n*   爽：一种绷了很久的需求，突然间被满足了，这种感觉叫“爽”。如俄罗斯快到顶上时突然掉下一个长条消掉了几行，这种感觉就是爽。\n*   拉动你玩游戏的，就是微小的愉悦感，和绷了很久的需求，突然被满足的爽感。加在一起，这种确定性的满足就会成瘾。\n*   如果我没有满足预期，或者我本来在一个满足状态，突然被剥夺了，这也是**不爽**。\n\n案例：春节微信红包和支付宝红包\n\n*   做产品，是通过产品建立与人的关系，通过产品来服务人，本质就是用户是否通过你的服务得到了满足。  \n    我们看到优秀的人才会有几个特性：敏感、不能忍、有动手优化的能力。  \n    小结：我们讲了三个重要的词：“ “满足”“愉悦”“不爽”，三个词很普通，但是我希望你能够发现很普通的词的深意：  \n    1.你可以量度，一个产品到位不到位；\n*   当你做一个产品，自己有没有被满足。\n\n2.你可以量度，你和一个人的关系；\n\n*   双方能否懂得满足与不爽。\n\n3.你还可以看到，自己的天分和命运。\n\n*   你会对某些东西感到愉悦，这个东西持续给你满足感，你可以一直花时间在这里，不厌其烦。你不厌其烦的地方，就是你的天分所在。\n\n1.2. **同理心训练：怎样理解愤怒与恐惧**\n------------------------\n\n[同理心训练：怎样理解愤怒与恐惧](https://note.youdao.com/s/rL5Pqkm)\n\n1.3. **同理心训练：产品要顺应用户潜意识**\n-------------------------\n\n案例：索尼推出黄色/黑色音响，和消费者开会定色，大家说黄色，在会后可以免费带走一个时大家却选择了黑色。  \n[产品要顺应用户意识](https://note.youdao.com/s/4JkHiIwm)  \n小结：\n\n*   与人交往，或者做一个产品让别人用，怎么能够突破防御，让对方接受你，说服别人、驱动别人，其实都是一回事。\n*   人做一个动作，也许是意识判断，但是70%是潜意识的选择。\n*   基于意识与人交流，其实是高防御模式。基于意识清醒的交流，达成交易的唯一方式，就是让对方清晰地感觉到一点——“我占了便宜”。 所以小米手机重复性价比的宣传口径，是一个基于意识判断的沟通策略。但更多的时候，在意识没有启动之前，人已经基于潜意识建立了判断，并做出了行动准备。\n*   所以，如果你不能用持续高压灌输、高频重复的方法，改变对方的潜意识，那么就要放下自己的主观愿望和判断，放下显示自己高明、教育用户、说服用户的念头。\n*   作为一个产品经理，要做的事就是不让用户启动防御。主观愿望过强的产品经理，非常容易犯想当然的错误。\n*   如果要做一个拥有大用户量的产品经理， 你会看到的是“人欲即天理”，要尊重人欲。\n*   所谓的用户调研，就是清空自己，接纳别人的世界观。\n\n1.4. **认清人的本性，理解角色化生存**\n-----------------------\n\n*   寄居蟹、皇帝都一样，死了又有其他寄居蟹进来或者有其他皇帝穿上龙袍，至于是谁都一样，我们认识的只是角色。\n*   当你初步去接触一个人或一群人时，你一开始看到的只是他们的角色，集体就是一堆角色。\n*   人是因为训练和压力才成为角色的，而集体就是角色的凝聚。、\n\n集体人格是怎么形成的？我们是怎么训练角色、被教育的过程？  \n1、**确定目标** 教育或培训的目标，要树立的观念。  \n2、**建立恐惧的边界** 没有做到就会被训斥或惩罚  \n3、**放入清晰的标的** 正确的方式应该是怎么样的  \n4、**给予红利，让其产生依赖**  \n5、**不断重复** 重复可以树立榜样\n\n*   如果你想做一个好的产品经理，那么首先要学习的就是通过“去角色化”来研究真实的用户，而不是用一堆“应该”来臆测用户的行为。\n*   如果你的产品的使用对象是一个“个体”，那你必须要抛开对个体角色化的刻板想象，而把对方当成一个完整的、鲜活的人，去做用户研究。\n*   如果你是在给一个特定的集体做产品，那么其实你应该充分研究这个集体的集体人格、共同记忆和核心观念。\n*   如果你希望用户在很放松的情况下，毫无压力地、自然地使用你的产品，或者你想找到在生活中可以放松惬意相处的伴侣，那么你就要放弃对人的理想化、角色化预期，去认识并接纳那个在“寄居蟹的壳”下面真实的人。\n*   角色化生存就是我们真实的生存处境，但是只有去角色化地认识、沟通、交互，你才能够得到真正的感情。\n\n1.5. **自我与自律，哪一种更贴切产品精神？**\n--------------------------\n\n良好的产品思维是现在最稀缺的职业能力。  \n做产品经理的人善于感知，能在已经有结论的地方建立新观点。而做其他管理地人更善于逻辑推理和总结归纳。  \n人们把善于观察、发散的思维叫做右脑思维，把善于逻辑归纳的思维叫做左脑思维。  \n自我的人更适合做产品经理\n\n*   因为创造力是自我的延伸，而控制力是自律的延伸\n*   创造力要求对自我有极深的体察和释放，但控制力是自律的体现，是社会化的产物，是对别人的体谅与迁就。\n*   自我的人长期关注的就是自己，所以必然自私；\n*   自律的人，长期关注的是外部的边界和规则，所以这类人有克己奉公的精神。\n\n有人会问：我应该自我呢？还是应该自律呢？\n\n*   当你问出这个问题的时候，本质上你关注的就是规则与边界，其实你就是个挺自律的人。\n*   但是，我们可能每个人都是在这种自律的、集体主义的氛围中长大。所以即使再自我的人，可能都得有一部分学会自律。\n\n你可能还会问：未来我应该释放哪一方面的能力呢？\n\n*   靠愉悦驱动的人，往往自我。\n*   靠恐惧驱动的人，往往自律。\n\n这两者，都会催生非常优秀、非常成功的人。每个希望成大事的人，都需要想办法接纳与自己完全相反的那个人，让他成为你亲密的合作伙伴。\n\n2\\. 机会判断\n========\n\n2.1. **点线面的战略选择**\n-----------------\n\n1、普通人和富人的区别\n\n*   普通人勤恳努力、斤斤计较，他在意的是每一个当下的点，而任何一个点都不会产生过多的收益。\n*   如果要成为中产，至少要获得一次线性周期的收益。\n*   那么如何成为富人呢？就要借助面和体的崛起。\n\n2、点线面的战略选择十分重要\n\n*   你再怎么优化产品、提升效率，一旦点线面体选错了，都是白搭。\n\n3、当你做一个产品时，入手的只能是一个点\n\n*   但是要想清楚他附着在哪个面上\n*   这个面在和谁竞争？他能如何开展？\n*   这个面在哪个经济体上\n*   这个经经济体是在快速崛起还是在沉沦？\n\n4、悲催的人生\n\n*   悲催的人生，就是在一个常态的面上，做一个勤奋的点。\n*   更悲催的人生，就是在一个看上去常态的面上，做一个勤奋的点，你每天都在想着未来，但其实这个面正在下沉。\n*   最悲催的人生，就是在一个看上去常态的面上，做一个勤奋的点，其实这个面附着的经济体正在下沉。\n\n5、如果一个人一生只能收到点状努力的计时收益，从来没有享受过一次，线性周期的成果回报，这就叫穷人勤奋的一生。\n\n2.2. **怎么找到有势能的趋势**\n-------------------\n\n案例：相亲。第一次见面，到底是应该平淡如水的来还是玩命的表现自己？  \n如果是追求短浅关系和片面接触，当然要玩命的展示自己，比如表演，比如做销售。  \n如果是长期关系，两个人认识相处的目的就是缔结婚姻，成为长期合作、伴侣关系，那么就应该平淡处理。因为每个人呈现的样子其实都是自己过往所有经历的累加，从稳定的点开始，作为一段长期关系的发端，有可能才是最靠谱的。  \n1、做产品也是如此，世上的机会千千万，应该从哪个“点”开始呢？\n\n*   从你能做到的、能稳定提供的那个“点”开始。\n*   不要憋大招，自古长考出臭棋。\n*   如果是需要卯足了劲跳起来才能够得到的一个“点”，其实很难持久。\n\n2、任何一个点都有它的来路，都有使它成为“今天”这个点的线、面、体。如果你对线、面、体完全无感，只想拥有一个点的当下，那基本上是守株待兔。\n\n*   在一个“点”上反复纠结，其实得不出本质的结论。 不如花时间，从这个“点”上跳出来，研究一下这个“点”下面的大框架——“线”、“面”、“体”。\n\n3、求之于势，不责于人\n\n*   “求之于势，不责于人”，是要自己去找有势能的“面”，而不能寄希望于员工的“点”。\n*   作为一个CEO，你不应该天天对自己的团队和员工不满意。你应该去找外部势能，为你的组织赋能。\n*   要强迫自己，离开牵动你情绪的“点”，去看到“线”的方向，去预测这条“线”的周期，并且明确你自己在周期的哪个位置，是哪个“面”在给你赋能。\n*   要明白外部的势能才是重要的，不要过于苛求那个跟随你的“点”，这才是决策的关键。\n\n4、人生的选择比努力重要\n\n*   你的选择应该是一条“线”、一个“面”，甚至是一个“体”的收益。你个人的努力，只是在“点”、“线”、“面”、“体”的既定框架内，作为一个“点”的挣扎而已。\n\n2.3. 痛点痒点爽点都是产品机会\n-----------------\n\n1、痛点是恐惧\n\n*   痛点，是做产品的抓手。另外一个做产品的抓手，是爽点。\n\n2、爽点\n\n*   人在满足时的状态叫愉悦，人不被满足就会难受，就会开始寻求。\n*   如果这个人在寻求中，能立刻得到即时满足，这种感觉就是爽。\n*   有需求，还能被即时满足，这就是爽。\n\n3、痒点\n\n*   痒点是满足虚拟自我，什么是虚拟自我？就是想象中那个理想的自己。\n\n**小结：**\n\n什么才是一个产品的入手点。\n\n痛点、爽点、痒点都是不错的点。这个就看产品经理自己对用户的哪个点感受最深、手感最准。\n\n比如说，饿了要吃东西。但是“吃饱了”和“吃得很满足”，这是两个概念。吃个馒头能饱，但是仅仅是满足了功能需求，不能支持好产品的概念。\n\n酣畅淋漓地吃一顿海底捞火锅，大汗淋漓，感觉爆爽。这就抓住了爽点，这是好产品。\n\n怕吃火锅长胖，抓住这一点的恐惧，抓住痛点，也有产品空间可以做。\n\n或者还可以做一个美美的网红餐厅，像雕爷做的薛蟠烤串。用户点一份干冰爆米花，吃一把，两个耳朵往外冒干冰的白气，人人都会拍张照然后发朋友圈，这是痒点。\n\n吃顿饭，其实也可以有痛点、爽点、痒点这些不同的切入点来做产品的。\n\n  \n\n  \n\n.......持续更新中\n\n  \n\n[![](/s/-vky9ok/8401/008d09724398b50e93468e30a239d4f6d750af9b/4.1.1/_/download/resources/com.atlassian.confluence.plugins.confluence-view-file-macro:view-file-macro-resources/images/placeholder-medium-file.png)20230214产品思维.xmind](/download/attachments/95559186/20230214%E4%BA%A7%E5%93%81%E6%80%9D%E7%BB%B4.xmind?version=1&modificationDate=1676455193510&api=v2)\n\n  \n\n  \n\n  \n\n  \n\n  \n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}