{
	"title": "产品运营学习lmx",
	"author": "王宇",
	"publishTime": "二月28,2023",
	"readTime": "12s",
	"tags": "[\"李明仙\"]",
	"description": "李明仙",
	"article": "  \n\n**产品运营学习--《产品经理实用手册：成为合格的产品人》谢星星 魏勇 李应玲编著**\n-------------------------------------------\n\n**必备工具：**原型设计工具（Axure RP和墨刀），思维导图工具（百度脑图、MindManager），交互设计工具（Sketch和Principle），数据挖掘和分析工具，办公应用工具等。\n\n**产品？**产品是指能够供给市场，被人们使用和消费，并能满足人们某种需求的事物，包括有形的物品，无形的服务、组织、观念，或它们的组合。\n\n**产品的五个层次？**\n\n1.核心产品是指向顾客提供的产品的基本效用或利益。从根本上说，每一种产品实质上都是为解决问题而提供的服务。\n\n2.形式产品是指核心产品借以实现的形式。它由五个特征构成，分别是：品质、样式、特征、商标及包装。\n\n3.期望产品是指购买者在购买产品时期望得到的与产品密切相关的一整套属性和条件。\n\n4.延伸产品是指顾客购买形式产品和期望产品时附带获得的各种利益的总和，包括产品说明书、保证、安装、维修、送货、技术培训等。\n\n5.潜在产品是指现有产品包括所有附加产品在内的、可能发展成为未来最终产品的潜在状态的产品，潜在产品体现了现有产品可能的演变趋势和前景。\n\n**互联网产品**是为满足用户需求而创建的用于运营的功能及服务，它是网站或App功能与服务的集成。\n\n**产品生命周期**是指产品从构想到消失的整个过程，产品生命周期可以分为四个阶段：引入期、成长期、成熟期和衰退期。\n\n![](/download/attachments/91159308/image2023-1-30_11-17-18.png?version=1&modificationDate=1675048639038&api=v2)\n\n**产品规划?**\n\n产品规划是指产品规划人员通过调查研究，在研究市场、探寻客户/消费者需求、分析竞争对手、衡量外在机会与风险，以及对市场和技术发展态势综合研究的基础上，根据公司自身的情况和发展方向，制定出可以把握市场机会，满足消费者需要的产品的远景目标（Vision）以及实施该远景目标的战略、战术的过程。\n\n“开发和管理产品需求”→“构建愿景”→“找准产品定位”→“明确用户价值”→“塑造产品价值”\n\n**开发和管理产品需求**:\n\n分析用户需求、定义产品需求、确认产品需求和跟踪需求。\n\n产品需求是产品所有功能的描述和规划。产品在开发时都有明确的需求规则，将这些规则清晰地描述出来，让开发工程师、测试工程师能够直观地明白这些规则，且没有产生歧义。\n\n**1.2 互联网产品的分类**  \n**互联网产品的分类**  \n按照服务对象分类、按照运行平台分类和按照用户需求分类。  \n1.面向个人用户（2C）产品---**该类产品需要更多地关注用户体验。**2C产品不仅需要满足用户的一般期望，同样需要满足用户痛点、爽点或痒点。  \n2.面向企业客户（2B）产品面向企业客户（2B）产品的客户通常是特定组织，主要包括企业和社团等组织。**必须以体现用户价值为核心，用户体验反而是第二要素。**对于该类产品的用户而言，能够切实解决问题，提升业务效益就是好的产品。  \n1.2.2 按照运行平台分类  \n1.PC端产品-即时性较低但信息量大，功能操作复杂的产品  \n2.移动端产品移动端产品在基于用户需求与使用情景基础上，发挥了智能手机的各类特性，可以使用户更加便捷地操作相应功能模块，达成使用目的。  \n3.其他终端设备产品。主要通过其他平台产品兼容或功能简化的方式存在  \n按照用户需求分类  \n可将互联网产品细分为六类：交易、社交、内容、游戏、工具和平台  \n1.交易类产品是指为满足交易行为线上化所衍生的互联网产品形态。交易业务内容包括买卖实体商品、虚拟商品以及各类服务，业务模式有B2B、B2C、C2C以及衍生的O2O等模式。  \n2.社交类产品在该类产品中，用户与用户之间可相互建立联系社交类产品又分为关系型产品和内容型产品  \n3.内容类产品该类产品提供持续可打发时间或有价值的信息，和工具类产品有些类似，和用户的关系比较简单。如新闻门户、网站、视频网站、微博。  \n4.游戏类产品该类产品比较特殊，一般内部都会融合社交、交易等元素。如网页游戏、手机游戏、社交游戏  \n5.工具类产品该类产品主要是解决用户在某种特定环境下的即时性需求，因而往往需求很明确，产品逻辑也相对简单。  \n6.平台类产品该类产品比较复杂，它打造了一个生态圈，是一个综合体，在该类型产品中，可以包含多种类型产品。  \n1.3 互联网产品的盈利模式  \n**互联网产品的盈利模式**  \n盈利模式是企业通过自身以及相关利益者资源的整合形成的一种实现价值创造、价值获取、利益分配的组织机制及商业架构。  \n可分为三种：电商模式、广告模式和增值服务模式。简单来说就是将传统的线下卖东西的模式搬到线上。电商模式类型如·电子商务、互联网金融、O2O。广告模式的优点一是覆盖面更为广泛，二是能承载的广告形式更为丰富，三是广告可以精准定向，投放效益更高。增值服务模式增值服务模式是指根据客户需要，为客户提供超出常规服务范围的服务，简单来说就是提供特权服务。  \n1.4 **什么是产品规划**  \n产品规划是指产品规划人员通过调查研究，在研究市场、探寻客户/消费者需求、分析竞争对手、衡量外在机会与风险，以及对市场和技术发展态势综合研究的基础上，根据公司自身的情况和发展方向，制定出可以把握市场机会，满足消费者需要的产品的远景目标（Vision）以及实施该远景目标的战略、战术的过程。  \n“开发和管理产品需求”→“构建愿景”→“找准产品定位”→“明确用户价值”→“塑造产品价值”  \n开发和管理产品需求。产品需求是产品所有功能的描述和规划。产品在开发时都有明确的需求规则，将这些规则清晰地描述出来，让开发工程师、测试工程师能够直观地明白这些规则，且没有产生歧义。分析用户需求、定义产品需求、确认产品需求和跟踪需求。  \n构建愿景。产品愿景是指产品经理对产品未来前景和方向的一个高度概括描述，它应符合公司或组织的战略目标  \n找准产品定位。产品定位是给产品自身打造的鲜明的独立特征  \n**如何找准产品定位？**分析所处行业→分析市场的竞争局面→定位市场的竞争局面→寻找切入点→从切入点找到产品定位。  \n**如何明确用户价值？**用户价值即产品能够为用户做什么，需要满足用户一定的需求。  \n**如何塑造产品价值？**产品经理必须聚焦在顾客想要的价值上，越具体越好。挖掘和塑造用户价值的方法包括：  \n1）提供从无到有的产品服务  \n2）解决用户痛点：用户痛点来源于用户的真实需求  \n3）节约用户获取价值的时间和精力成本  \n4）提供信息发布的方式  \n5）提升用户痒点  \n6）制造用户爽点  \n1.5 什么是产品设计  \n**什么是产品设计**\n\n**互联网产品设计是指通过用户研究和分析进行的整套服务体系和价值体系的设计过程。**  \n主要包括：产品架构设计、产品原型设计、产品视觉设计、产品交互设计、产品UI设计、产品平面设计和用户体验设计七个部分  \n产品架构设计中的信息架构设计，产品UI设计、产品原型设计和产品交互设计是需要重点关注的部分。  \n信息架构设计  \n信息架构作为一个产品的骨架，是产品设计非常重要的组成部分，它决定了产品的整体布局、未来的发展方向，以及用户对该产品的最初印象和整体体验。  \n产品UI设计产品UI（User Interface，用户界面）设计是指对产品的人机交互、操作逻辑、界面外观的整体设计。  \n产品原型设计产品原型设计可以概括地说是产品面市之前的框架设计  \n产品交互设计  \n产品交互设计的方法来自工业设计领域以用户为中心的设计方法，并加以发展，更多地面向行为和过程。  \n强调过程性思考能力，业务流程图、状态转换图和故事板  \n1.6 **产品开发都做些什么？**  \n产品开发阶段。产品开发是指企业改进老产品或开发新产品，使其具有新的特征或用途，能继续满足客户的需要，产品开发不仅指开发全新产品，还可以是指迭代开发原有产品  \n产品经理是配合角色，主要角色是开发经理、开发工程师、测试工程师和质量工程师  \n品经理主要负责市场调查，并根据用户的需求和开发团队共同确定选择何种开发技术、架构模式，并推动相应产品开发团队的组建。  \n需要对测试经理和测试工程师制定的测试方案和测试用例等展开讨论，要根据产品的生命周期，协调研发、测试、设计、营销和运营等相关人员，确定和组织实施相应的产品策略，以及其他一系列相关的产品管理活动。  \n1.7 **什么是产品发布**  \n产品发布本质上就是产品的迭代升级，产品迭代是指产品快速地适应不断变化的需求，不断推出新的版本满足或引领需求，永远快于对手一步。  \n进行互联网产品发布可分七步走。1）规划发布的产品版本的介绍素材、风格和发布时间。2）确定产品上线的渠道，以及发布的先后顺序。3）确定产品升级的相关规则。4）确定发布前的数据统计维度。5）确定各渠道的安装包里渠道号的设置规则。6）因iOS客户端的不同，需要独立确定应对策略。7）规划产品发布的应急筹备和回滚机制。  \n1.8 产品运营都做些什么  \n互联网产品运营要对用户群体进行有目的的组织和管理，增加用户黏性、用户贡献和用户忠诚度，有针对性地开展用户活动，增加用户积极性和参与度，并配合市场运营进行活动方案策划。  \n  \n第2章 明确定位——产品经理是干什么的  \n产品经理就是以解决问题为核心，整合和管理各种人力、物力等资源，高效地将解决方案变成实际产品输出的领导者。  \n2.1 何谓产品经理  \n产品经理（Product Manager，简称PM）是企业中专门负责产品管理的岗位，产品经理负责市场调查并根据产品、市场及用户的需求，确定开发何种产品，选择何种业务模式、商业模式，并推动相应产品的开发组织，还需要根据产品的生命周期，协调开发、测试、体验设计师、交互设计师、营销、运营和运维等人员，确定和组织实施相应的产品策略，以及其他一系列相关的产品管理活动。负责产品功能的定义、规划和设计；做各种产品决策，保证团队顺利开展工作  \n产品经理的分类  \n按照用户类型分类、按照产品属性分类、按照职业阶段分类、按照项目类型分类和按照技能优势分类。To B产品经理一般要求有缜密的逻辑思维和比较深刻的业务理解能力。  \n3.按职业阶段分类  \n按照资历由浅到深可分为以下5类。  \n1）产品实习生。2）产品助理。3）产品经理。4）高级产品经理。5）产品总监。  \n2.2 产品经理——产品团队中的关键角色  \n在一个产品团队中，包括：产品经理、项目经理、交互设计师、开发工程师、用户体验设计师、测试工程师、运营人员、配置工程师、质量工程师、运维工程师、数据库管理员、产品营销人员等角色。  \n产品经理产品经理作为产品团队的核心人物统筹产品管理工作，主要职责包括：1）进行市场调查，掌握用户的需求，评估产品机会。2）定义产品，确定开发何种产品，选择何种技术、商业模式。3）推动产品开发团队的组建。4）根据产品的生命周期，协调开发、测试、设计、营销、运营和运维等人员。5）确定和组织实施相应的产品策略，以及相关的产品管理活动等。  \n项目经理。项目经理的主要职责包括：1）制定开发计划。2）跟踪开发进度。3）保证开发质量。4）评估开发过程中的各项风险，并采取相应的措施规避风险。5）负责开发过程中的协调工作。6）解决技术难题，或者调用其他资源解决技术难题。7）项目管理：包括项目整合管理、项目范围管理、项目时间管理、项目成本管理、项目质量管理、项目人力资源管理、项目沟通管理、项目风险管理、项目采购管理及项目干系人管理十大领域  \n交互设计师。交互设计师的主要职责包括：1）梳理信息导航结构和页面操作流程。2）设计详细的交互原型。3）进行原型演示，收集原型反馈的问题，负责问题的跟进，进行原型和文档的修订工作。  \n用户体验设计师。用户体验设计包括多种设计，如：UI（用户界面）设计、交互设计、视觉设计、听觉设计，甚至工业设计，所以通常UI设计师、交互设计师也称之为广义上的用户体验设计师，但在技能上，用户体验设计师又高于UI设计师、交互设计师的标准。用户体验设计师的主要职责包括：1）负责完成产品的概念原型设计及细化的交互设计，配合进行用户测试及分析工作。2）绘制原型，参与产品整个生命周期的开发工作。3）从产品的可用性、易用性角度出发，为整个产品生命周期提供可持续性的用户体验设计并跟踪执行。  \n开发工程师。开发工程师按照具体的需求和设计文档，遵循项目管理人员制定的开发计划开发产品，并完成产品的迭代工作。  \n测试工程师。测试工程师的主要职责包括：1）根据需求文档，制定测试计划、测试方案，编写测试用例。2）执行测试工作，进行产品的功能测试、压力测试等。3）当测试过程中发现产品问题时，将缺陷单给到开发工程师或产品经理，在修改后进行回归测试，直到问题被解决。4）提交测试报告。  \n运营人员。产品运营人员的主要工作在产品上线后，需要和用户走得很近，其主要职责包括：1）在产品上线前进行运营规划，确定运营方案和运营目标。2）进行产品上线后的需求收集工作。3）开展产品培训、数据跟踪分析等工作。4）开展运营活动，进行用户获取、用户维护，提升网站流量、用户量、用户活跃度等指标。5）进行渠道管理，建立多种推广合作渠道提高网站流量，优化投放效果。  \n**2.5 产品经理的工作内容及工作流程**  \n产品经理的工作内容产品经理的工作内容一般包括如下几方面。1）负责收集产品需求，并进行需求分析，分析需求可行性、合理性，根据产品规划、外部需求、内部需求、功能、性能、安全特点，定义产品，并编写产品需求规格说明书。2）进行竞品分析，关注竞争对手情况，对市场变化做出反应。3）负责产品界面和交互的全局及细节设计，推动产品交互体验持续提升。4）负责产品文档的编写，与研发人员一起完成系统设计，合理规划产品发展规划与功能规划，协调推动产品功能的实现。5）负责与测试工程师进行沟通，确定产品缺陷的修改方案。6）负责与运营人员沟通，协助制定产品的营销策略或运营策略，进行产品推广，关注产品的运营数据、用户调研与用户反馈等，持续优化产品。7）协同内部相关部门，负责制定新产品的开发计划及现有产品的改进、维护计划，监督产品的研发进程，保证需求充分实现，推动项目的技术实现，完成项目的跟踪控制，把控项目实施质量和效率。8）对产品的长期发展战略提出建设性意见，进行相关市场调查，为公司决策层提供相应依据。9）跟踪产品的运营情况，并据此提出产品进一步改进的方案。10）对相关人员进行产品培训，并协助市场运营部门进行产品售前工作。  \n产品经理通常的工作流程为：**评估产品机会→市场调研→用户分析→产品分析→产品原型设计→产品验证→开发和测试→产品迭代**  \n**1.评估产品机会**  \n**（1）用户价值**  \n**需要思考产品要解决什么问题？**\n\n（1）要求产品解决的问题应该是具有可持续性的，如果无法保持可持续性，造就的将是一个短命产品。  \n（2）目标市场需要思考为谁解决这个问题？即思考目标客户人群是谁？种子用户是谁？年龄几何？处于什么社会阶层？这些用户具有哪些标签？  \n（3）市场规模需要思考产品成功的机会有多大，即目标市场的前景如何？  \n（4）度量指标和收益指标需要确定由哪些度量指标和收益指标来最终确定产品成功与否？例如新增用户数量、人均启动次数、人均使用时长、人均单日启动次数、人均单日使用时长、搜索指数、每日活跃用户、月收益或年收益等。  \n（5）竞争格局需要思考该产品有哪些同类产品？  \n（6）竞争优势需要思考为什么自己的公司最适合做这个产品？  \n（7）市场时机需要思考产品推出市场的时机合适吗？很多项目未来的前景很光明，但是，推出时间太早，用户还难以接受。  \n（8）营销组合策略需要思考如何将产品推向市场？如何宣传产品、拓展市场销售渠道和组织线上线下营销活动？  \n（9）解决方案要满足的条件需要思考成功的必要条件是什么？  \n2.**市场调研**  \n（1）市场调研的作用通过市场调研，可以掌握如下信息。1）市场趋势：通过各类市场报告了解行业趋势、产品发展前景等内容。2）目标客户信息：了解目标客户是谁，目标客户的特点、数量、分布情况，会怎么使用产品，为什么会使用这款产品，希望如何改进产品。3）竞争对手情况：包括竞争对手的数量与规模、分布和构成，竞争对手的优缺点及营销策略，做到心中有数，有的放矢地选择竞争策略。4）市场销售策略：重点调查了解目前市场上某种产品或某种服务项目的促销手段、营销策略和销售方式主要有哪些。  \n**3\\. 用户分析**\n\n用户分析一般都需要分析以下内容。（1）用户群体分析分析用户属于哪一类用户群体，例如是企业用户还是个人用户，或是卖家还是买家等。（2）用户画像分析用户的兴趣类别、年龄、性别、用户的语言及地理位置、新老用户的对比、用户的学历及收入（如22～25岁的毕业生、收入5000～10000元等）、用户的浏览器与操作系统、用户的设备信息。（3）用户场景了解用户对产品的使用过程，了解目标用户群的使用场景和过程，总结用户的问题和流程，并提出最合理的解决方案。  \n**4.产品分析一般的产品分析包括以下内容：**\n\n（1）产品定位分析确定产品的定位，例如神州租车的产品定位：出行方便，快速抵达，多种出行方式可供选择，满足多样的出行需求。\n\n（2）产品结构分析主要分析产品的功能结构、逻辑结构和信息架构。功能结构图以多层级的方式表现，用于梳理各种功能之间的层级和逻辑关系，通常用思维导图或Visio等工具绘制。信息架构对应着产品前端的表现层架构，也就是产品呈现给用户的最终内容。逻辑架构关注的是功能层面，既包含用户直接可见的功能，还包含系统中隐含的功能。一个项目分为表现层、业务逻辑层、数据访问层这样经典的“三层架构”。  \n（3）产品核心功能分析产品核心功能分析是分析产品的核心功能是否合理和易用  \n（4）产品体验分析产品体验分析一般在产品上线后不定期进行，主要分析用户评价等信息  \n（5）产品数据分析产品数据分析一般在产品上线后不定期进行，分析内容包括iOS下载量、人均启动次数、人均使用时长、人均单日启动次数、人均单日使用时长、活跃用户数、新增用户数、总用户数、搜索指数和热门内容（如文章、商品、电影、书籍等）。  \n（6）产品盈利模式分析产品盈利模式分析是分析产品的盈利模式  \n（7）产品优缺点分析产品优缺点分析是将产品与同类产品对比，分析本产品具有哪些优势和劣势。  \n**5.产品原型设计**  \n产品原型设计就是将页面的模块、元素、人机交互的形式，利用线框图进行描述的方法，可以将产品更加具体、生动地表达出来。  \n**6.产品验证**\n\n产品验证就是对产品实现过程形成的有形产品和无形产品，通过技术手段进行观察、试验、测量后所获得的客观证据，证实产品是否满足规定要求。产品验证主要包括产品的价值测试、**可行性测试和可用性测试。**  \n（1）价值测试在评估产品机会时通过价值测试确定用户价值。在进行价值测试时，需要知道用户是否觉得这个产品有用？是否愿意付费？  \n（2）可行性测试可行性测试通过一个真实互动的过程，在用户基础之上发现产品问题，从而达到优化产品的目标。  \n（3）可用性测试可用性测试是让一群具有代表性的用户对产品进行典型操作，同时观察员和开发人员在一旁观察、聆听，并进行记录。  \n**7.产品开发和测试**\n\n产品开发就是企业改进老产品或开发新产品，使其具有新的特征或用途，以满足顾客的需要。  \n产品测试就是让测试人员或消费者使用产品，并产生评价结果。通常产品测试的目的是根据被测试产品的发展或生命周期的不同阶段而确定的，产品测试的主要目的如下。1）发现现有产品的缺点或缺陷。2）评价产品的商业前景。3）发现产品对各个细分市场的吸引力。4）识别竞争产品的优势和劣势。5）确认改进后的产品是否真的比改进前好。6）确认顾客能否区分改进前后产品的区别。  \n3.1 产品经理的技能构成  \n产品经理的技能构成  \n产品经理需要具备产品设计、产品管理、团队管理、项目管理等方面的技能，同时需要熟悉工作过程中常用的工具软件  \n3.1.1 产品设计能力\n\n**产品设计能力是产品经理最核心的能力，包括五部分：市场调研能力、产品规划能力、竞品分析能力、产品设计能力和数据分析能力。**\n\n1.市场调研能力  \n产品经理需要掌握的市场调研工具包括：App Annie、友盟+、百度统计、谷歌分析、Alexa和站长工具等  \n产品规划能力  \n产品经理制定产品规划的方法，五部曲包括：开发和管理用户需求、构建愿景、找准产品定位、明确用户价值和塑造用户价值。  \n竞品分析能力竞品分析能力是指产品经理具备对竞争对手的产品进行比较分析，寻找和研究竞品的优缺点，从而为自身产品找到准确定位的能力。  \n产品设计能力产品设计能力是产品经理最为重要的核心能力之一。产品经理需要通过产品设计将Idea和产品规划的内容加以细化和可视化。  \n数据分析能力在产品上线后的运营阶段，由产品运营团队开展活动运营、内容运营、用户运营和数据运营工作，起到拉新、留存和促活的作用。  \n产品管理能力产品管理能力主要包括需求管理能力、产品文档管理能力和品牌建设管理能力三项能力。  \n1.需求管理能力  \n需求管理是产品经理的必备技能，需求管理包括需求采集和整理、需求分析、需求分类、需求定义、确定需求优先级、需求池管理、需求评审、需求变更管理和需求跟踪等。  \n2.产品文档管理能力\n\n在产品的规划和设计过程中，会产生大量的产品文档，例如商业需求文档、市场需求文档、产品需求文档、竞品分析文档、产品上市文档和产品结项文档等，产品经理既要学会编写这些文档，还需要对这些文档进行有效的管理。产品各个阶段的开始和完成，往往由相关产品文档来推动。  \n在产品设计过程中，主要包括以下四类文档。\n\n1）商业需求文档商业需求文档（Business Requirement Document，简称BRD）是指基于商业目标或价值所描述的产品需求内容文档（报告），其核心用途是在产品投入研发之前，供企业高层作为决策评估的重要依据。\n\n2）市场需求文档市场需求文档（Market Requirement Document，简称MRD）是描述具有什么样的功能和特点的产品（包含产品版本）可以在市场上取得成功。  \n3）产品需求文档产品需求文档（Product Requirement Document，简称PRD）是产品项目由“概念化”阶段进入“图纸化”阶段的最主要的文档，其作用是对MRD中的内容进行细化，这个文档的质量好坏直接影响产品能否顺利实施。  \n4）竞品分析文档竞品分析，是指对竞争对手的产品进行比较分析，寻找和研究竞品的优缺点，以便产品经理规划和设计自己的产品，定义产品的功能和价值。\n\n3.**品牌建设管理能力**\n\n品牌建设管理能力包括品牌建设管理，以及品牌的后续维护能力，包括前期的品牌命名、品牌符号，以及品牌形象的打造，和后续品牌形象的维护和运营。  \n  \n**4、产品经理的常用工具软件**  \n产品经理常用的工具软件主要包括**原型设计、思维导图、交互设计、数据挖掘和分析、办公应用**五类。  \n产品经理可以学习使用Python进行数据爬取、数据处理、数据分析、数据可视化、机器学习以及深度学习，还可以通过Python设计一些产品规划和设计过程中的实用小工具。产品经理学习Python的好处如下。1）Python使用人数众多。2）Python相比其他编程语言更简单，更容易入门，代码也更容易阅读。3）Python可以开发爬虫，能够帮助产品经理更方便地获取数据。4）用Python进行数据分析非常简单，甚至几行代码即可输出可视化图表报告。  \n  \n5.办公应用工具\n\n产品经理需要编写需求文档、数据分析文档、流程图、项目计划和项目汇报文档等，需要产品经理熟悉Office系列的办公软件，包括Word、Excel、PowerPoint，还需要熟悉Visio和Project。  \n4.1 获取市场信息  \n获取市场信息俗话说得好，“没有调查就没有发言权”，通过市场调研，要获取如下信息。1.市场趋势通过各类市场报告可以了解行业趋势和产品发展前景。2.目标客户信息目标客户信息包括：目标客户是谁，目标客户的特点、数量、分布情况，会怎么使用产品，为什么会使用这款产品，希望如何改进产品。3.竞争对手情况竞争对手情况包括竞争对手的数量与规模，竞争对手的优缺点及其营销策略，了解这些信息才能做到心中有数，有的放矢地采取相应的竞争策略。\n\n  \n4.市场销售策略\n\n市场销售策略是指目前市场上的产品的促销手段、营销策略和销售方式。  \n（1）用户拜访用户拜访是指前往用户使用产品的场所进行实地考察  \n（2）用户调查用户调查可通过网络等方式发放用户调研表进行，这样可以提高获取产品使用信息的效率，降低信息收集成本。  \n（3）竞品分析“知己知彼，百战不殆”，在市场竞争日趋白热化的当下，不了解竞争对手的情况，就意味着没有胜算。  \n  \n4.2 进行竞品分析  \n进行竞品分析\n\n4.2.1 竞品分析的九个维度  \n竞品分析的九个维度：**1.用户价值 2.目标市场 3.市场规模 4.度量指标和收益指标 5.竞争格局 6.竞争优势 7.市场时机 8.营销组合策略 9.解决方案要满足的条件**  \n4.3 进行用户分析  \n3.用户生命周期  \n**用户生命周期是用户从开始接触产品到离开产品的过程，产品生命周期则是一款产品从创意概念到研发上市最后到退出市场的过程。**  \n可将用户生命周期分为以下五个阶段。\n\n1）引入期：用户获取阶段，将市场中的潜在用户转化为平台用户。\n\n2）成长期：用户注册登录并进行激活操作，已经开始体验产品的相关服务或功能。\n\n3）成熟期：用户深入使用产品的功能或服务，贡献较多的活跃时长、广告营收或发生付费操作等。\n\n4）休眠期：一段时间内未产生有价值行为的成熟用户。\n\n5）流失期：超过一段时间未登录和访问产品的用户。  \n  \n**用户画像**\n\n用户画像是指用户的兴趣类别、年龄、性别、语言及地理位置、新老用户的对比、用户的其余标签（如22～25岁的毕业生、收入5000～10000元等）、用户的浏览器与操作系统、用户的设备信息等信息。  \n1）人口属性：用户的文化程度、年龄、性别和所在城市等。2）商业属性：用户所属行业、职业、个人收入情况、家庭收入情况、消费金额和消费习惯等。3）消费意向：购买护肤品、服饰箱包、汽车、房产、快消品、电子产品、图书等的消费意向。4）生活方式：用户的生活习惯（例如习惯熬夜或习惯早起）、娱乐爱好（电影、电视剧、音乐、综艺等）和社交爱好（社交达人、喜欢独处）等。5）用户行为：用户使用产品的规律，包括用户活跃频率、使用时间、使用功能、消费习惯。\n\n**5.用户场景**\n\n用户场景指目标用户群使用产品过程中的场景，包括在场景中用户的已有行为、内心活动和用户需求。1）用户的已有行为：在用户场景中，分析用户的已有行为是否能够跟产品需求所吻合。2）用户的内心活动：通过用户场景的设计，在每一步的操作上都应该分析用户此时的内心活动，判断该操作是否会影响用户的心情和体验。3）用户需求：通过当前用户场景设想出其他的场景，来挖掘用户的真实需求。  \n生成用户分析报告通过对用户群体、用户心理、用户生命周期、用户画像、用户场景的分析，可以输出一份用户分析报告。  \n7.非功能性需求（1）用户界面需求对于用户界面需求的描述，包括风格、布局、色调、图片、控件、提示等。（2）软/硬件环境需求。（3）产品质量需求记录用户对产品质量的需求，一般包括产品性能、易用性、安全性、稳定性、可靠性、扩展性、兼容性、可移植性等方面的需求。  \n4.4 常用的市场调研工具  \n常用的市场调研工具市场调研工具种类繁多，例如，App Annie、友盟+、谷歌分析、Alexa和各大搜索引擎站长平台等，各有特点，侧重点也有不同。\n\n  \n**5.1 开发和管理产品需求**  \n  \n产品需求是产品所有功能的描述和规划。基于经过明确定义、并经过产品团队及相关领导和管理部门确认的产品需求  \n1.需求判断产品经理先要判断这个用户需求是否“靠谱”，判断的标准就是此项用户需求是否有“价值”：1）用户价值 2）商业价值 3）社会价值  \n需求判断的方法包括：商业模式画布、KANO模型、收益预测和PEST模型等。  \n需求跟踪的目的是建立与维护“需求”→“设计”→“编程”→“测试”之间的一致性  \n典型的需求风险包括：1）技术风险2）法律和政策风险3）易变性风险4）性能风险5）安全风险6）数据库完整性风险7）开发过程风险  \n  \n**5.2 构建产品愿景**  \n1.帮助产品团队统一思想  \n2.平衡短期利益和长期利益  \n愿景、使命和价值观愿景、使命和价值观的关系和区别如下。1）愿景：指产品在未来所能实现的目标。希望产品在未来发展成什么样子，在哪些领域希望有什么样的成就和地位。愿景具有阶段性。2）使命：产品存在的理由。产品存在的目的是什么，产品能为谁解决哪些问题，产品存在的意义是什么。3）价值观：指基于共同的产品愿景使命，对所预期的未来持有的共同观念。包括整个团队需要遵守的、倡导的、反对的行为准则、底线和信条。  \n  \n**5.3 找准产品定位**  \n找准产品定位  \n产品定位的目的是给产品自身打造最鲜明的独立特征，而这些特征一定是建立在某一聚焦型刚需的基础上。  \n5.7 产品规划实践案例  \n竞品分析和用户分析  \n《竞品分析报告》和《用户需求说明书》  \n用户需求变成产品需求，并形成《产品需求规格说明书》和《需求跟踪矩阵》，《产品需求规格说明书》重要的组成部分就是功能结构图和核心业务流程  \n建立用户需求→产品需求→概要设计→详细设计→测试用例→源代码的关联关系  \n利用Visio流程图工具绘制核心业务流程图  \n  \n**6.1 产品架构设计**  \n产品架构是经过市场调研和产品规划之后，对整个产品的业务、产品和信息这三个方面的架构设计，业务架构决定产品架构，产品架构决定信息架构。  \n**6.1.1 设计产品业务架构**  \n业务架构包含产品的商业模式和业务流程的设计。  \n设计产品的业务架构，需要考虑到用户、业务和企业这三个方面，这三者形成了利益价值链  \n设计产品的信息架构，应该考虑到用户、信息、用户与信息的访问路径这三个方面。  \n设计信息架构时需要注意以下几点。  \n1）根据功能模块的主次和使用频率来排序。2）避免出现相似功能的入口。3）不要把不同类型的内容合并在一个模块。4）切记不可随意删除功能或者增加功能。5）路径层级结构不可过多。6）考虑产品以后的扩展性。  \n**6.1.3 设计产品架构**  \n产品架构介于业务架构和信息架构之间，是对业务架构的具体呈现方式，决定了产品的功能层次结构、功能边界问题、数据和信息的流转。考虑到业务、功能、功能层级和用户角色这四个方面。  \n1.用户感知层用户感知层考虑的是用户体验，实际也对应着信息架构的部分。2.业务功能层业务功能层从用户角色出发，分别列出与之相对应的功能，然后对照业务流程，将所有的类似功能都放置在一起，以模块的形式呈现；同一组产品功能设定在同一层级。3.数据处理层数据处理层，需要考虑数据的获取和数据的流向问题，也就是所有业务功能问题的集合，可以清晰地描绘出数据在业务逻辑上的流转。  \n  \n**6.2 产品原型设计**  \n产品原型是产品团队各角色之间沟通交流的介质，是产品或者创意的最初模型，可以让用户提前体验产品、交流设计构想和展示复杂交互。  \n2.原型说明规范接触过产品需求规格说明书的产品经理，都知道在需求文档里，要有版本信息、变更记录、适用范围和需求描述约定等说明。  \n（1）变更记录跟需求文档的变更记录类似，每次修改了产品原型，都需要详细记录变更内容、变更人、版本号、变更日期和批准人这些信息。\n\n（2）版本规划版本规划也是对应着需求文档的项目背景、产品介绍和产品功能列表，产品功能列表需要标明功能对应的版本号、功能编号、目标页面和优先级等。\n\n（3）适用范围适用范围是说明该产品原型适用于项目的哪些参与人员，哪些人员需要重点查阅本原型，哪些人员可选择性查阅本原型。  \n（4）业务流程业务流程也对应着需求文档中的业务流程小节。项目的业务流程包括了全局业务流程和部分核心业务流程。\n\n（5）功能结构功能结构对应着需求文档中的功能架构或者功能拓扑图，有些产品经理也喜欢使用思维导图呈现，只要能够直观地显示产品功能即可。  \n（6）交互说明一个产品的各个功能模块之间会存在很多交互，所以对于产品原型需要制定全局交互说明。全局交互指的是操作过程中相同的交互设计，例如弹框、加载样式、报404、报403、报500、操作成功或失败的提示等。交互说明包括：事件名称、触发条件、适用范围、交互流程和示例展示。  \n（7）参考尺寸说明因为产品原型有其特定的尺寸，所以需要写明该原型的参考尺寸，并且要分别说明PC端、手机端和iPad端的参考尺寸。产品原型的移动端尺寸参考“6.2.4Android和iOS设计规范”一节。  \n（8）元素说明元素说明包括配色方案、标题字体样式、文本字体样式、图片样式和按钮样式等，目的是为了保证产品原型的设计风格一致性。\n\n3.页面设计规范页面结构规范和原型说明规范是完成整个产品原型设计的基石。页面设计需要遵循以下七大原则。  \n（1）对齐原则对齐原则是最基本的原则，元件和内容可以利用辅助线对齐，保证页面的美观。  \n（2）一致性原则整个产品的所有页面的风格、字体、图标、form表单、控件、提示信息、弹框和表格等都应该保持一致，这也是在原型说明中标注的原因之一。  \n（3）留白原则注意页面的需要留白的地方，排版和内容不要过于密集。元素和元素之间的空隙留白。  \n（4）简洁原则界面忌颜色过多、文字过多和图片过多，要保持简洁易操作，这样用户获取有效信息会更快。\n\n（5）对比原则对于重要的板块，需要重点凸显，可以对这些重要的板块加大或者加深颜色，形成视觉差异。  \n（6）亲密原则相似的内容模块在布局的位置上距离要相近，不同的内容模块要划分成几个区域，距离应相对远一些。  \n（7）易用性原则我们所设计的页面肯定是存在相同的部分，例如菜单、页面头部、页面底部和版权信息，这些几乎每个页面都会使用到，所以需要创建母版来设计这些相同的部分，不管后期的修改，还是其他人员接手原型，都能更好地继续设计。  \n  \n交互设计是产品某个功能界面与用户行为之间的交互，交互设计规范可供产品开发技术团队参考。交互设计规范包括以下内容。\n\n（1）用例描述用例设计遵循MECE原则（Mutually Exclusive Collectively Exhaustive，相互独立完全穷尽原则），意思是，要考虑到所有可能出现的情况，做到不重叠，不遗漏，存在多个用例时，一定要对用例进行命名。  \n（2）需求说明在实现一个功能的交互时，必要时一定要写需求说明。  \n（3）弹窗和提示说明弹框和提示在整个产品中要保持一致，包括动态效果。  \n（4）加载设计说明设计加载样式，是为了在请求服务时出现延迟，避免用户等待产生焦虑。  \n  \n6.2.3 **常用产品原型设计工具**\n\n产品原型设计工具很多，比较知名的如Axure RP、墨刀、Mockplus、Justinmind、Balsamiq Mockups、Sketch和Principle等，各有千秋。  \n在进行产品设计时，比如Web产品或者App产品，产品经理往往需要知道一些运行产品的移动端设备（Android设备或者iOS设备）的尺寸，以确保产品在这些设备上运行的时候能够正常显示。了解不同设备字体、逻辑分辨率、竖屏分辨率、Asset、竖屏点、PPI、状态栏高度、导航栏高度和标签栏高度等设计规范。\n\n  \n\n**6.3 产品视觉设计**  \n**6.3.1 用户浏览习惯**\n\n用户在浏览一个互联网产品的时候，眼睛往往是快速地浏览页面，看不到自己关注的信息就会很快切换至下一个页面或者产品  \n1.网页F形浏览模式。F形浏览模式，就是用户在浏览界面时，首先是水平方向浏览，接着视线移动一段小距离，再次水平方向浏览，最后，直接在界面的左侧，垂直浏览。  \n2.移动端界面用户浏览习惯对于移动端网页，用户都是以垂直方向浏览；对于移动App界面，用户除了垂直方向浏览，还习惯向右切换浏览。  \n3.关注点始于左上角用户的关注点大多数都是从左上角开始的，从左至右，从上到下，跟F形浏览模式相对应，所以Logo一般都是在左上角，重点内容都是在Logo下面的区域。  \n4.停留时间不多于7秒用户在访问网页的时候，如果未找到自己想要的信息，停留时间是不会超过7秒钟，并且用户注意力都在明显的文字或者标题上，如果页面所呈现的内容信息过多，会造成用户的视觉负担。  \n5.文字比图像更能吸引用户的注意力  \n6.更倾向于简单易用的页面  \n  \n6.3.2 产品视觉设计规范  \n1.规范说明\n\n（1）变更记录规范并不是一成不变的，是需要根据需求的变化而变化的，所以规范中变更记录是必不可少的，包括详细记录变更内容、变更人、版本号、变更日期和批准人。\n\n（2）适用范围适用范围是说明该规范适用于项目的哪些参与人员，哪些人员需要重点查看本规范，哪些人员可选择性查看本规范。\n\n（3）参考尺寸在规范的最开始，需要说明该规范适用于什么设备，设备尺寸是多少。\n\n2.规范内容\n\n（1）标准色标准色标明产品的配色方案，包括重要信息、一般信息、次要信息的色号和使用场景，通常主题色和辅助色3～5种  \n（2）标准字标准字包括重要信息、一般信息、次要信息的字号大小、行距以及使用场景  \n（3）图标图标包括功能性图标和非功能性图标（不可点击）。  \n（4）图片需要标明图片示例、图片大小、圆角弧度、图片比例，以及使用场景  \n（5）控件控件包括顶部导航、底部导航、二级导航、标题栏、列表、表格、输入框、按钮、弹窗、toast提示和加载状态等顶部导航、二级导航、标题栏、弹窗、toast提示的规范需要指明尺寸大小、字体各状态样式、间距和图标占用大小等。按钮需要标明大小，默认、鼠标悬停、鼠标选中的样式，以及使用场景。输入框需要标明大小，默认、焦点、输入错误、输入成功的样式，以及使用场景。列表、表格需要标明排版、字体样式、示例，以及使用场景。加载需要标明使用场景。  \n（6）布局排版布局不单单指的是一个页面的布局，一个产品是会有多种布局规范，需要根据功能模块一一标明。还应标注字体的样式、图片的样式和图标的样式等  \n  \n6.4 **产品交互设计**\n\n产品交互指用户与用户之间，或者用户与产品、机器之间相互交流与互动。  \n**1.操作更倾向于使用移动端**  \n**2.用户会忽略引导**  \n**3.给出选择比输入内容更方便**  \n**4.移动端习惯左右滑动切换**  \n**5.更喜欢短而精悍**  \n  \n6.4.2 **产品交互设计规范**\n\n在了解了用户的行为习惯之后，交互设计师需要制定相应的产品交互设计规范，通过易操作、交互流畅、吸引人的结构和流程设计，让用户更方便、更有效率地完成目标任务，并获得良好的产品体验。  \n1.规范内容一个完整的交互设计组件规范内容包括页面布局类、导航类、基础组件类、表单类、数据展示类、提示组件类和异常处理类。  \n（2）导航类导航类包括顶部导航、底部标签栏、列表式导航、面包屑导航、抽屉式导航、平铺式导航、tab标签、分页导航和步骤条等。  \n（4）表单类表单类包括输入框、单选按钮、复选框、文件上传、图片上传、图片查看、日期选择器、级联选择器、滑动开关和校验规则。  \n（5）数据展示类数据展示类包括表格、图标、列表和树形控件。  \n（6）提示组件类提示组件类包括警告提示、toast提示、标签和对话框提示。  \n（7）异常处理类异常处理类包括报错、404/403/500等错误提示的设计。\n\n（8）业务组件类根据当前产品业务的需求而设计的组件。\n\n  \n\n2.规范标准产品交互设计规范的标准有以下一些。\n\n（1）用户引导提供合理的入口引导，可采用弹窗、箭头和提示语文案等方式。  \n（2）提示准确针对系统的提示一定要准确，并且简便，易理解。例如，用户的账号在其他客户端登录，当前客户端下线，产品给出的提示需要标明什么时间点，在什么设备登录。  \n（3）入口清晰用户能够快捷地找到操作入口。  \n（4）交互路径产品交互路径从开始到结束，应减少不必要的跳转，整个过程最好能以可视化方式表现让用户容易明白。  \n（5）减少输入应尽量减少用户的输入操作，能设置为选择项的尽量设置为选择。  \n（6）及时反馈用户操作完成后，不论成功还是失败，都需要产品及时给予反馈，最好以toast的方式提示。  \n（7）层级主次产品的功能主次明显，应突出主要功能的操作流程，弱化次级功能。  \n  \n**7.交互方案**\n\n**交互方案是交互文档的重中之重，交互方案呈现了设计师的设计思路。**  \n1）页面线框图：线框图可以看出产品页面的整体布局。2）手势操作：包括单击、双击、左滑、右滑、长按、拖拽、上滑和下滑等。3）反馈结果：用户与界面之间发生互动的反馈操作。4）页面跳转：标明操作完成需要跳转到的界面。5）加载状态：包括正在加载时、加载完成时、失败状态，内容的加载，何时加载、何时显示和何时刷新。\n\n  \n**6.5 UI和平面设计**  \nUI设计和平面设计：是两项重要的产品设计工作。在部分互联网企业中，UI设计包含了用户界面和交互的设计，部分企业中UI设计仅指用户界面的设计  \n6.5.1 何谓UI和平面设计  \nUI设计（User Interface Design，用户界面设计），偏向于网页、软件等产品的界面设计，包括界面中的控件、面板、菜单和图标等的设计。\n\n平面设计（Graphic Design），偏向于图像、文字、图形、色彩和版式等的设计，更注重视觉呈现，基本包括企业VI、LOGO设计、名片、画册、折页设计、易拉宝、海报设计、宣传单、包装设计和网页设计等。  \n6.5.2 UI和平面设计规范因为互联网产品是面向多种客户端的，客户端的尺寸和界面并不不同，所以UI设计师需要根据客户端的不同设计多个版本。  \n6.6 **用户体验设计**  \n用户体验（User Experience，UE/UX），是用户在使用产品之前、使用期间和使用之后的全部感受，包括情感、信仰、喜好、认知印象、生理和心理反应、行为和成就等各个方面。  \n6.6.1 **用户体验设计的概念**\n\n用户体验以用户为中心，在产品设计的每个阶段，都需要考虑用户在各个方面使用产品的体验感，包括对产品的界面、功能、信息、内容、交互和服务等方面的体验，根据用户的习惯，进行相应设计。  \n  \n6.7 **10个产品设计技巧**  \n1.善用对比度。通过设置对比度可以突出重点信息、提高文字可读性、增加视觉吸引力。对比度包括文字大小、颜色、粗细的对比度，文字与图片的对比度，色彩强化对比度和视觉距离的对比度等。  \n2.合理留白留白指的是留出页面元素与元素、元素与元素之间的平面空间位置。留白可以提升传达重要信息的视觉体验，避免元素之间过渡拥挤，造成用户在视觉上压迫、不舒适的感觉。  \n3.颜色搭配需要考虑产品的定位和用户群体确定了产品的定位和用户群体后，要选择产品的主色和辅助色，切记色彩种类不可超过5种。应了解不同的主色调颜色代表怎样的风格或状态。  \n4.表单中能调取到的数据，一定让系统自动输入表单中的某些数据能从后台数据库调取到，这些数据一定要自动填入，不要让用户重复手动输入。能实现选择的就直接让用户选择，能用图像识别的，就让系统识别，例如银行卡和地址等。  \n5.加入新手引导页，提供“跳过”功能新手引导页是新用户第一次使用产品的引导页面，也是让新用户熟悉产品的第一步。  \n7.提升提示语的亲和力应根据产品的特性、不同的用户群体和不同的场景，设置带有亲和力和交互性的提示语。不要小看提示语，提示语其实是用户和产品互动的一个媒介，用户根据它的提示，会潜移默化地影响自己的行为习惯  \n  \n第7章 **相辅相成——产品经理需要了解产品运营**  \n好的互联网产品有两个特性：**首先它要能在一个点上打动用户。第二，它一定是一个靠持续改进、持续运营出来的东西。**  \n7.1 **什么是产品运营**  \n产品运营的概念产品运营是指从内容建设、用户维护和活动策略三个层面对产品进行管理，从而产生产品价值和商业价值的一种营销手段。  \n7.1.2 **产品运营的分类**  \n产品运营通常包括内容运营、活动运营、用户运营  \n1.内容运营内容运营是指通过创造、编辑、组织和呈现网站内容、App内容或小程序内容，从而提高互联网产品的内容价值，提升产品的黏性、用户活跃度、用户的消费欲。  \n2.活动运营活动运营是指针对不同目的、不同性质的活动进行的运营，包括策划、准备、实施和复盘四个阶段。  \n3.用户运营用户运营是指通过运营手段提升用户活跃度和忠诚度。  \n1）推送策略：定期给用户推送优质内容、平台通知公告和升级改版通知等内容。  \n2）社群策略：通过QQ群、微信群等方式进行用户的集中运营  \n3）活动策略：通过策划各类活动提高用户的参与度和归属感。  \n  \n产品运营人员需要对用户群体进行细分，并进行有目的的组织和管理，增加用户黏性、用户贡献和用户忠诚度，需要和市场运营人员一起，有策略、有组织、有针对性地开展线上线下用户活动，以此增加用户积极性和用户参与度。  \n产品运营人员的工作主要分为三方面：内容运营、用户运营和产品运营。  \n1）收集和整理运营团队需求：搭建起产品设计与运营的桥梁，负责收集和整理运营团队对产品的需求，组织撰写产品需求文档。  \n2）收集产品的用户反馈：收集使用产品过程中的问题及反馈，对运营数据加以统计分析，形成对产品运营和设计有价值的文档。  \n3）进行活动策划、确定运营方案，并跟进执行：基于对用户和产品的深刻了解，提出产品的活动策划方案及产品运营的方案，并与产品经理、开发工程师沟通确认，跟进执行。\n\n4）进行数据分析，并提出应对策略：定期收集和分析产品运营数据，并以此为依据，制定产品运营方案和策略，并对产品存在的问题提出应对策略。\n\n5）提升产品核心指标：通过产品运营策略带动产品核心指标的提升，例如用户活跃度、平台收入、用户规模等，制定帮助用户成长与帮助用户推广的运营方案，提升用户的成长空间。6）制订有效的推广计划：对产品功能等进行包装，编写产品包装策划方案，确定推广渠道，制订有效的产品推广计划。  \n  \n**产品运营关注的指标**  \n1）PV：页面浏览量或点击量，衡量网站用户访问的网页数量；在一定统计周期内用户每打开或刷新一个页面就记录1次，多次打开或刷新同一页面则浏览量累计。  \n2）UV：独立访客，统计1天内访问某站点的用户数（以Cookie为依据），访问网站的一台电脑客户端为一个访客。  \n3）IP：独立IP数，是指1天内多少个独立的IP浏览了页面，即统计不同的IP浏览用户数量。  \n4）PU：付费用户，指有付费行为的用户。该指标弱化了统计周期的背景，所以在数据统计中不常采用。\n\n5）CR：付费转换率。新增用户中，有付费行为的新用户/总新增用户数。此公式与电商网购中的支付转化率指标类似。\n\n6）DAU：日活跃用户数量，即每日登录过产品的用户数。\n\n7）MAU：月活跃用户数，即截至当日，最近一个月（含当日的30天）登录过游戏的用户数，一般按照自然月计算。  \n8）ARPU：每用户平均收入。在一定时间内，ARPU=总收入/用户数，一般计算长期的ARPU更有意义，如平均每月每用户收入。  \n9）用户流失率：用户流失率=总流失用户数/总用户数，流失用户数依产品而定，并且有各自的不同标准。  \n10）注册用户量：注册用户数量。  \n  \n7.2 **产品经理与产品运营**\n\n产品经理的目的是创造有价值的产品，产品运营人员的目的是让产品能有效地发挥出它应有的价值。\n\n  \n7.3 **产品运营的四大要点**  \n产品运营包括四大要点，分别为：**拉新、留存、促活和数据分析。**  \n拉新就是为产品引流，发展新用户。  \n1.线上拉新手段（1）活动营销拉新（2）内容营销拉新（3）事件营销拉新（4）渠道推广拉新  \n2.线下拉新手段（1）广告投放拉新。在机场、火车站、公交车站、地铁、电梯和路牌等投放广告，或赞助商业活动。（2）地推或陌生客户拜访拉新。（3）行业交流会拉新\n\n留存。留存是在拉新的基础上，通过产品运营确保用户愿意持续关注和使用产品。留存的运营指标叫作留存率。\n\n促活。促活是产品运营通过各种各样的营销活动，让用户在产品内与平台或其他用户的互动更加频繁，好的活动能使得将用户转化率提高，能够让产品收益进一步地提升，而这便是产品运营中促活的根本目的。  \n  \n7.4 **产品运营的过程**  \n产品运营过程贯穿产品需求分析、设计、上线和上线后的各个阶段，需要通过运营策略的持续优化和各种运营手段达到想要的运营效果。  \n  \n1.参与前期调研和评审产品设计人员和产品运营人员共同进行产品所处行业分析，开展需求调研工作，确定产品定位，并确定产品的核心价值，圈定目标群体，确定产品战略，运营人员在此阶段还需要对应明确运营指标。  \n2.建立运营体系为实现产品价值，实现产品目标，需要由产品运营人员建立运营体系。  \n3.配置初始数据配置初始数据工作由产品人员和运营人员配合开展，包括：1）基础配置：例如App需要准备好欢迎页、启动页面和新手引导页等。2）准备初始内容：提前建立初始内容。3）用户部分：提前导入种子用户或特权用户。4）活动部分：策划上线时的引爆点及运营活动。\n\n9.客户运营由客服部门和运营部门共同开展客户运营工作，充当客服分类记录新需求、Bug、交互体验等，进行新版本的业务培训。\n\n10.活动运营由运营人员主导，和产品人员共同开展。\n\n11.内容运营由运营人员主导，和产品人员共同开展。\n\n12.用户运营由运营人员主导，和产品人员共同开展。\n\n13.数据运营由运营人员主导，和产品人员共同开展。1\n\n4.完成运营分析报告由运营人员和产品人员共同完成运营分析报告。  \n15.确定召回机制为了让流失用户回归，需要确定召回机制，召回的方法包括：短信召回、邮件召回和电话回访等。  \n  \n7.5 **产品运营的常用工具**  \n搜索工具可以研究关键词搜索趋势、洞察网民兴趣和需求、监测舆情动向、确定受众特征。  \n7.5.1 **数据统计分析工具**  \n1.百度指数网址：[http://index.baidu.com/v2/index.html#/。](http://index.baidu.com/v2/index.html#/。)  \n2.百度搜索风云榜网址：[http://top.baidu.com/。](http://top.baidu.com/。)  \n3.360搜索指数网址：[https://trends.so.com/?src=index.haosou.com。](https://trends.so.com/?src=index.haosou.com。)  \n4.搜狗指数网址：[http://zhishu.sogou.com/。](http://zhishu.sogou.com/。)  \n5.头条指数网址：[https://index.toutiao.com/。](https://index.toutiao.com/。)  \n6.微报告网址：[https://data.weibo.com/。](https://data.weibo.com/。)  \n7.新榜网址：[https://www.newrank.cn/。](https://www.newrank.cn/。)  \n8.中国互联网数据平台网址：[http://www.cnidp.cn/。](http://www.cnidp.cn/。)1）了解中国互联网以及细分领域的宏观发展状况和市场格局。2）了解自身和竞争对手的访问情况和用户特征。3）了解特定人群的互联网行为特征。4）制定网络广告投放计划。  \n9.百度统计流量研究院网址：[https://tongji.baidu.com/research/site。](https://tongji.baidu.com/research/site。)  \n10.数据挖掘：5118站长工具网址：[https://www.5118.com/。](https://www.5118.com/。)  \n11.数据魔方网址：[http://data.tf56.com/。](http://data.tf56.com/。)  \n12.IBBD数据雷达：淘宝数据分析软件网址：[http://www.ibbd.net/。数据雷达是一个外部数据分析平台，帮助商家掌握行业趋势，了解竞争对手的状况等。](http://www.ibbd.net/。数据雷达是一个外部数据分析平台，帮助商家掌握行业趋势，了解竞争对手的状况等。)  \n13.FineBI（商业分析）网址：[https://www.finebi.com/。FineBI是帆软软件有限公司推出的一款商业智能（Business](https://www.finebi.com/。FineBI是帆软软件有限公司推出的一款商业智能（Business) Intelligence）产品。  \n  \n7.5.2 **数据可视化工具**  \n1.Echarts网址：[https://www.echartsjs.com/examples/zh/index.html。](https://www.echartsjs.com/examples/zh/index.html。)  \n2.BDP个人版网址：[https://me.bdp.cn/home.html。](https://me.bdp.cn/home.html。)  \n  \n**7.5.3** **在线问卷调查工具**  \n产品运营人员常用的在线问卷调查工具包括以下几种。\n\n1.问卷星网址：[https://www.wjx.cn/。](https://www.wjx.cn/。)  \n2.问卷网网址：[https://www.wenjuan.com/。](https://www.wenjuan.com/。)  \n3.腾讯问卷网址：[https://wj.qq.com/。](https://wj.qq.com/。)  \n4.调查派网址：[https://www.diaochapai.com/](https://www.diaochapai.com/)  \n  \n**7.5.4 活动发布工具。**\n\n产品运营人员需要不定期地进行线上线下运营活动，或者召开行业会议、发布会等，并且还需要进行活动推广，此时，可以借助活动发布工具来快速创建、发布、推广和分析活动。常用的活动发布工具包括以下几种。\n\n1.活动行网址：[https://www.huodongxing.com/。](https://www.huodongxing.com/。)  \n2.活动家网址：[https://www.huodongjia.com/。](https://www.huodongjia.com/。)活动家是一个会议门票交易和会议经纪交易平台。  \n  \n**7.5.5 创意设计工具。**\n\n运营人员在设计相关运营活动时，也可以借助创意设计网站表达自己的想法，常见的创意设计工具主要包括以下几种。\n\n1.花瓣网网址：[https://huaban.com/。花瓣网可以帮用户可以将网上看见的一切信息都保存下来，简单上手，玩味无限。](https://huaban.com/。花瓣网可以帮用户可以将网上看见的一切信息都保存下来，简单上手，玩味无限。)  \n2.站酷网址：[https://www.zcool.com.cn/。站酷是一个中国设计师互动平台。](https://www.zcool.com.cn/。站酷是一个中国设计师互动平台。)  \n3.Reeoo网址：[http://reeoo.com/。Reeoo收集最新的时尚潮流的网页设计，为设计人员提供设计灵感，为设计提供类似可供参考的成功案例。](http://reeoo.com/。Reeoo收集最新的时尚潮流的网页设计，为设计人员提供设计灵感，为设计提供类似可供参考的成功案例。)  \n4.黄蜂网网址：[https://woofeng.cn/。黄蜂网专注于网页、UI和平面设计。](https://woofeng.cn/。黄蜂网专注于网页、UI和平面设计。)  \n  \n7**.5.6 推送服务工具**\n\n在进行用户运营时，为了更快地触达用户，获得更大的用户量，可以通过推送服务工具进行消息推送。常用的推送服务工具包括以下几种。\n\n1.百度云推送网址：[http://push.baidu.com/。](http://push.baidu.com/。)  \n2.极光推送网址：[https://www.jiguang.cn/。](https://www.jiguang.cn/。)  \n3.个推网址：[https://www.getui.com/。](https://www.getui.com/。)  \n  \n**7.5.7 HTML5编辑器工具。**\n\n产品运营人员往往需要制作运营活动海报，而这类海报经常以HTML5页面展现，可以借助于HTML5编辑器工具快速设计制作美观的海报。常用的HTML5编辑器工具包括以下几种。\n\n1.秀米网址：[https://xiumi.us/#/。](https://xiumi.us/#/。)  \n2.MAKA网址：[http://maka.im/。](http://maka.im/。)  \n  \n**7.5.8 二维码生成器工具。**\n\n在活动海报等页面，为了引导到信息提交的动态页面，或者引导到详情页面，需要放置对应二维码或小程序码，此时，可以借助二维码在线生成器快捷生成。常用的二维码生成器工具包括以下几种。\n\n1.草料二维码网址：[https://cli.im/。](https://cli.im/。)  \n2.微微二维码网址：[http://www.wwei.cn/。](http://www.wwei.cn/。)  \n  \n**7.5.9 互联网数据分析报告网站**  \n为了对产业链上下游、行业趋势、竞争企业和竞品产品有深刻的了解，产品经理和产品运营人员都需要关注各大互联网分析报告网站的关键报告。常用互联网数据分析报告查询网站包括以下几种。\n\n1.友盟网址：[https://www.umeng.com/reports.html?spm=0.0.0.0.eIY17Q&from=hp。](https://www.umeng.com/reports.html?spm=0.0.0.0.eIY17Q&from=hp。)  \n2.艾瑞网网址：[http://report.iresearch.cn/。](http://report.iresearch.cn/。)  \n3.中文互联网数据资讯网网址：[http://www.199it.com/。](http://www.199it.com/。)  \n4.腾讯大数据网址：[https://data.qq.com/。](https://data.qq.com/。)  \n5.阿里研究院网址：[http://www.aliresearch.com/blog/index/lists/tag/3831.html。](http://www.aliresearch.com/blog/index/lists/tag/3831.html。)  \n6.易观网址：[https://www.analysys.cn/article#analysis。](https://www.analysys.cn/article#analysis。)  \n7.企鹅智酷网址：[https://tech.qq.com/biznext/list.html。](https://tech.qq.com/biznext/list.html。)  \n  \n**7.5.10 广告投放渠道**\n\n“酒香也怕巷子深”，一个新发布的产品，或一个籍籍无名的产品，要想获得用户的关注，首先需要得到种子用户的关注，产品运营人员可以借助于付费的广告投放渠道进行推广，以此提高品牌影响力，吸引更多的用户。广告投放渠道主要包括以下几种。\n\n1.百度营销网址：[https://cas.baidu.com/?tpl=www2。](https://cas.baidu.com/?tpl=www2。)  \n2.360点睛营销平台网址：[https://e.360.cn/。](https://e.360.cn/。)  \n3.搜狗竞价网址：[https://auth.p4p.sogou.com/login?service=http://xuri.p4p.sogou.com。](https://auth.p4p.sogou.com/login?service=http://xuri.p4p.sogou.com。)  \n4.腾讯广告网址：[https://e.qq.com/ads/。](https://e.qq.com/ads/。)  \n  \n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}