{
	"title": "2.1、语音交互设计基础知识",
	"author": "王宇",
	"publishTime": "六月25,2023",
	"readTime": "12s",
	"tags": "[\"2、语音交互设计知识\"]",
	"description": "2、语音交互设计知识",
	"article": "*   1[第三章 语音交互设计](#id-2.1、语音交互设计基础知识-第三章语音交互设计)\n    *   1.1[3.1 声音的构成和作用](#id-2.1、语音交互设计基础知识-3.1声音的构成和作用)\n    *   1.2[3.2 语音交互的特点](#id-2.1、语音交互设计基础知识-3.2语音交互的特点)\n    *   1.3[3.3 创造一位智能语音助手](#id-2.1、语音交互设计基础知识-3.3创造一位智能语音助手)\n        *   1.3.1[寻找合适的音色](#id-2.1、语音交互设计基础知识-寻找合适的音色)\n        *   1.3.2[确定智能语音助手和用户的关系](#id-2.1、语音交互设计基础知识-确定智能语音助手和用户的关系)\n        *   1.3.3[构建智能语音助手的用户画像](#id-2.1、语音交互设计基础知识-构建智能语音助手的用户画像)\n        *   1.3.4[设计合理的唤醒词](#id-2.1、语音交互设计基础知识-设计合理的唤醒词)\n\n第三章 语音交互设计\n==========\n\n· 语音交互，也被称为VUI（Voice User Interface），是多模交互中的一种交互方式。\n\n· 诞生于20世纪70年代的交互式语音应答（Interactive Voice Response，IVR）系统，是VUI的第一个重要时期的代表，通过电话理解人们的语言，并执行相应的任务——用户只要用电话拨打移动运营商所指定的号码，就可以根据语音提示收听、点播或发送所需的语音信息，甚至聊天、交友等。\n\n· VUI的第二个重要时期的代表是2011年苹果公司发布的智能语音助手Siri。\n\n3.1 声音的构成和作用\n------------\n\n· 声音可以传达大量关于环境的信息，一般来说，声音由语言、音乐和音效三个因素构成，其中语言与语音交互的关系探索的最多。\n\n· 不同的语言有自己独特的词汇和语法风格。同时，声音的起伏变化是人类情感的符号表达，因此，一句话的表达除了词汇和语法外，还与语气、语调、语速、节奏等因素相关。\n\n*   **语气**可以理解为人在什么样的情绪下说什么样的话，语气可以由语调和语速来决定，比如人在发怒时语调高亢、语速快，在悲伤的时候语调低沉、语速慢且时断时续。\n*   **语调**是指说话时声音高低的变化，不同的语调会直接影响情绪的输出及听众心理的变化。目前语音交互主要通过三种方法来实现语调变化：\n\n*   直接调整TTS合成的音调参数，比如百度AI开放平台提供了语音合成的语速、音调和音量三个可调节参数。另外还有一些TTS技术可以通过“？”等简单的标点符号自动调节音调的变化。\n*   寻找声优，提前录制相应内容，但声优录音和语音合成音频差别大，且使用起来复杂且成本较高。\n*   通过神经网络技术合成TTS，DeepMind公司的WaveNet技术能分析原始声波，使用深度学习技术加以修正。\n\n*   **语速**是指在播音或朗诵时每个音节的长短及音节之间连接的紧松。一般情况下，人们说话的语速大约是每分钟240个音节，专业新闻播报人员的语速可以达到每分钟300个音节。以下是各大语音交互系统的中文播报速度。\n*   **节奏**是指语言在流动过程中呈现出来的规律和变化。人在说话时会产生抑扬顿挫、轻重缓急的感觉，且在说话过程中会插入“嗯”“啊”“呃”等内容，这些无意义的发音和重复、纠正，在聆听过程中会被人类自动过滤掉，但用眼睛看转成的文字时则会不由自主的将这些内容放到上下文理解中——对话时的停顿不会体现在转译结果上，但这些无意义内容和错误的标点符号会破坏整个阅读的节奏。说话节奏时自然语言理解技术的瓶颈之一。\n*   **隐喻**是人类说话时常用的修辞手段，话语的隐喻含义背后有很多复杂因素需要考虑。\n*   **音色**传递说话者的身份，帮助人们辨认说话者是谁。音色还是影响人们对语音吸引力主观评价的主要因素，智能语音产品可以通过音色建立品牌形象。从技术角度，音色和声纹有关。\n\n![](/download/attachments/105255108/image2023-5-4_16-55-59.png?version=1&modificationDate=1687656546167&api=v2)\n\n· 音乐是通过有组织的乐音（人耳感觉舒适的音）所形成的艺术形象来表达思想情感的艺术，它的传播优势在于具有很强的感染力，听到音乐，即便无法用明确的语言来表达，还是可以和我们内心的某种情绪相关联。但音乐很少用在用户产品上，因为用户产品不需要唤起用户强烈的情感，而是多用于视频、广告或运营活动上。在语音交互中，可以适当地考虑结合文字和背景音乐强化情感。\n\n· 音响是指除人的语言、音乐外的其他声响，包括自然环境的声响、动物的声音、机器的音效、人的动作发出的各种声音等。这些声音并不会完全吸引我们的注意力，但是能够帮助我们了解周围发生着什么。\n\n· 被使用或经过设计的音响被称为音效，可以用来传递信息。音效可以强化互动的操作感，确保用户知晓操作的结果。大多数的音效设计都集中使用声音信号（Earcon）和听觉图标（Auditory Icon）。声音信号是基于音乐的声音，可以以结构化的组合来创建听觉信息，比如经典的Windows XP系统开机音效。听觉图标反应我们日常生活中的许多声音，比如雨声和鸟鸣。\n\n· 在语音交互中，音效主要有三个作用：\n\n（1）引起用户注意：音效可以提供感官反馈。当系统自主发起语音交互时，可以考虑音效作为开场白，同时相同的音效又可以加强用户的认知和记忆，用户就知道这时智能助手要和自己对话了。  \n（2）提升信息传递的效率：很多情况下，音效提示远比语言提示高效和醒目，比如在界面反馈中，打开文件夹的音效反馈比“打开了”的语言反馈要更轻量和简短。  \n（3）表达情感或个性：音效跟音乐一样能表达情感。\n\n· 太多的音效会降低有效度，对于凭空设计的音效，用户不一定能理解它们的含义，会加重用户的认知负担。在很多产品中，音效和用户界面一样，是产品体验和品牌形象的重要一环。谷歌在Material Design的音效设计种提出了三点原则：  \n\n1.  音效应该直观、实用且易于理解；\n2.  音效需要真实地传达品牌的个性与美学；\n3.  音效需要营造舒适感和安全感，仅在需要时才提示用户。\n\n· 《交互式系统设计：HCI、UX和交互设计指南》种作者David Benyon针对音效设计给出了如下建议：  \n\n*   音色：使用合成乐器的音色。尽可能使用多谐波的音色，这样有助于感知并能够避免被屏蔽。\n*   音高：除非音效之间的使用有非常大的差异，否则不要使用固有的音高，建议最大5kHz、最小125~130Hz。\n*   音区：三个或三个以上的八度音节差异能带来更好的识别率。\n*   节奏：让节奏尽可能不同，短的音符很容易被忽视，不要使用小于八分或四分的音符。\n*   音强：建议音强的最大值是阈值以上20dB、最小值是阈值以上10dB。总声级要在系统用户控制下。\n*   和声：当一个接一个地播放声音信号时，要在之间设置一定的间距，让用户知道上一个结束了，同时开始下一个，0.1s的延时就够了。\n\n3.2 语音交互的特点\n-----------\n\n· 语音交互的**优势**：\n\n（1）学习门槛低：对于小孩和老人来说尤其方便。  \n（2）当用户不方便使用图形用户界面时，提供另一种交互手段：当用户的双眼和注意力被其他事物占据时（比如驾驶）、当用户的双手被占用时（比如烹饪、游戏），语音交互更安全也更高效（减少多任务间切换）。同时，对于残疾人尤其是视障人士来说是他们获取外界信息最有效的交互手段。  \n（3）一种高效的输入方式：相比于传统的键盘输入，语音输入方式在速度及准确率方面更具优势。同时，语音交互不需要频繁的跨场景交互，还能够一次性下达多条指令，系统自动分别执行。\n\n· 搜索场景，人们在使用语音输入和文本输入进行搜索时，语音输入的问题要比文本输入长，因为用户使用语音搜索问题大多是以对话形式出现的，而文本输入更多的是通过关键词进行检索，搜索质量比前者高。\n\n· 语音交互的**不足**：\n\n（1）抗噪能力有待提高：人类听觉系统具有“鸡尾酒会效应”——在嘈杂的环境中可以将注意力集中在某个特定的人身上，然后再心理上“屏蔽掉”其他的声音，但是机器很难做到，嘈杂的环境会影响到语音识别率。一般电子设备会利用多麦克风阵列来提高语音识别的准确率，通过有效分离人声和噪声、不同人声来提高信噪比。  \n（2）自然语言理解技术仍不成熟：主要有三个问题：①中国用户有着各种方言和口音；②用户的说话习惯和节奏会影响语音识别，在语音速录和翻译任务中尤为突出；③对重音、同音字、不寻常的词汇、中英混合、中文和数字混合的语音识别准确率会骤降。除此之外，上下文理解也是自然语言理解里最难突破的瓶颈之一。  \n（3）输入和输出的信息量由时间决定：接受听觉信息只能由时间维度决定，是单向线性的，因此只能听完一句再听下一句，没法像视觉那样瞬间完成视觉认知和加工，也不能在文本之间扫描跳过（无法重听前几秒）。除此之外，语音信息的输出效率是极其有限的，说话速度越快，接受完整信息的准确率就越低。  \n（4）机制影响用户获取信息的容量：工作记忆是一种人类记忆模型，是一个具有有限容量的认知系统，负责临时保存可用于处理的信息。语音交互过程中会涉及语言理解、推理和计划等认知能力，这些都属于工作记忆范畴，短时记忆不涉及这部分内容。下图为Alan Baddeley提出的工作记忆模型理论，工作记忆能与长时记忆不断传递、检索和转移信息，以便理解新的信息。  \n![](/download/attachments/105255108/image2023-5-4_16-56-17.png?version=1&modificationDate=1687656546245&api=v2)  \n（5）需要学习和记住命令：根据第二个不足，当前用户无法自由地使用自然语言与机器进行对话，因此用户需要掌握与机器对话的技巧，降低学习成本需要看语音系统的泛化能力和意图设计。  \n（6）工作、公共场景下不适合使用：语音交互至少需要满足**噪音低**和**私密**两项要求，在众多的场景中，车内和家里是满足要求的。\n\n· 语音交互的**五大特性**：在设计语音交互体验时应该要关注以下特性。\n\n（1）线性结构：声音是线性不可逆的，且人与人对话没有“返回”“关闭”等界面术语，所以语音交互和图形界面不太一样，流程上没有可视化的分支结构，更没有返回逻辑，意味着语音交互每次只能完成一次对话或指令，多轮对话里只能一直向前推进。  \n（2）不适合复杂任务：语音交互没有界面和文字引导，加上用户工作记忆的限制（一般人维持的时间约为10~15秒），导致用户接收信息是有限的，过长的对话会影响用户对内容的理解和判断。  \n（3）随时打断和跳转：用户具有发散性思维，导致行为可能很随意，会随时随地打断当前任务并跳到其他流程上。  \n（4）可以影响用户情感：对话是情感交流的一种形式，也是人类社交的重要途径，可以帮助一些想社交但孤独的人群（如独居老人、留守儿童等）。  \n（5）一句话等于一个或多个任务：体现语音交互高效率的重要特性。一般来说用图形界面完成一项任务需要分几个步骤，而用语音交互可以一句话完成。\n\n3.3 创造一位智能语音助手\n--------------\n\n· 在设计语音交互时，需要考虑通过声音和对话内容让用户在使用过程中产生好感，并获得用户的信任。\n\n· 当人们听到声音时，会自动地、无意识地给它分配个性形象。所以，在设计声音前需要考虑智能语音助手的人物设定，一般包括性别、年龄、性格、外貌特征和称呼。人物设定越具体，人物形象就越具象。\n\n#### 寻找合适的音色\n\n· 音色主要影响用户对智能助手的性别、年龄甚至性格的认知判断。在挑选声音时，要考虑与整体“人设”定位的匹配度。\n\n*   关于音色偏好的性别差异：对于女声，男性用户和女性用户都喜欢年轻女声，其中男性用户更看重音色的“甜美”和“有力”两个特征，女性用户更喜欢音色“纯净”“清亮”；对于男声，女性用户喜欢的男声比男性用户喜欢的更为年轻，且更关注音色的“平稳”“浑厚”，男性用户更喜欢音色“圆润”“温和”。\n*   关于音色偏好的年龄差异：20~39岁的用户更喜欢“纯净”的女声；10~19岁和40~59岁对男女声没有明显偏好，前者更喜欢音色接近和自己同龄的的女声和男声，后者更喜欢音色“有力”“清亮”的女声，和“成熟”“稳重”的男声。\n\n#### 确定智能语音助手和用户的关系\n\n· 要考虑服务的用户群体是谁，也要考虑智能语音助手是服务哪些场景的。\n\n· Michael Braun对智能语音助手的性格特征进行设置，在**专业程度**和**主导等级**两方面分别设计了“随便/正规”“对等/从属”两个维度的概念，设计出4种个性化人物，与默认性格在现实驾驶场景下进行对比实验。\n\n1.  朋友：对话方式随意，性格风趣幽默。\n2.  仰慕者：对话方式随意，服从于用户，对用户的大多数决定表示肯定和赞扬。\n3.  姑妈：对用户非常亲切，做事认真，非常关心用户的健康。\n4.  管家：服从用户，尊重事实并执行用户的命令。\n5.  默认人格助手：行为正常但不够熟练，不会表现得像朋友或下属。\n\n最后得出以下结论：\n\n*   智能语音助手的性格与用户个性的正确匹配至关重要，正确匹配时，智能语音助手的个性化性格比默认性格获得更高的信任度和喜爱度；反之，不匹配时，接受度小于默认性格，且容易引起用户不满。\n*   在特殊驾驶场景下，个性化性格更受欢迎；在于安全相关的驾驶场景下，默认性格更受欢迎。\n\n· 百度AI交互设计院也曾做过人设相关调研，结果发现：能够帮助用户解决实际问题的“助手”关系最受欢迎，既没有“专家”的权威也没有“仆人”的服从性；另一个受欢迎的是满足心里陪伴的“朋友”关系。\n\n#### 构建智能语音助手的用户画像\n\n· 有了上述基础设计后，可以考虑智能语音助手的性格有哪些关键词，这些关键词是我们希望用户在和智能语音助手对话时所感知到的品质或特点，例如友好的、天然呆、全能助手等。\n\n#### 设计合理的唤醒词\n\n· 唤醒效果的好坏直接影响用户的第一体验，设计唤醒词时有以下几点注意：\n\n*   唤醒词字数为3~5个字。\n*   避免使用口语化的词汇，日常使用频率太高易误唤醒。\n*   唤醒词发音应选择易开口、响度大、发音清晰、易分辨的词。\n*   唤醒词的音节覆盖应尽量多和差异大，避免使用多音字、叠字和连续使用零声母的词语。\n\n![](/download/attachments/105255108/image2023-5-4_16-56-30.png?version=1&modificationDate=1687656546290&api=v2)\n\n· 如果考虑采用朋友关系，建议使用“Hi+名字”或“Hey+名字”结构；如果采用助手关系，建议使用“名字”或“名字+名字”结构。\n\n![](/download/attachments/105255108/image2023-5-4_16-56-38.png?version=1&modificationDate=1687656546351&api=v2)\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}