{
	"title": "第四十八周、四十九周读书笔记",
	"author": "王宇",
	"publishTime": "十二月02,2022",
	"readTime": "12s",
	"tags": "[\"邹正清\"]",
	"description": "邹正清",
	"article": "智能商业读书笔记\n========\n\n一、智能商业\n======\n\n（一）名词定义\n-------\n\n三浪叠加：1.0，传统零售产业；2.0，对传统零售的升级，苏宁、国美；3.0，利用互联网的电子商务\n\n双螺旋：数据智能、网络协同\n\n网络协同：指的是通过大规模、多角色的实时互动来解决特定问题\n\n数据智能：数据智能的本质就是机器取代人直接做决策（想要让机器取代人做决策，需要几个重要的前提条件：云计算、大数据和算法。大数据和算法是机器学习的本质。机器学习都基于反馈闭环。）\n\n数据化：本质上是将一种现象转变为可量化形式的过程\n\n算法：按照设定程序运行以获得理想结果的一套指令\n\n“云端”：“端”指产品，即与用户完成个性化、实时、海量、低成本互动的端口。“云”是数据聚合、算法计算的平台；\n\n活数据：需要数据在线，实时记录而不是主动采集；要不断更新，随时可用来产生洞察；需要在实际业务场景中被灵活使用，驱动下一个决策的产生。\n\n黑洞效应：智能商业的优势源泉。源自于：网络效应、学习效应\n\n数据压强：每天都会产生极为庞大的数据量，称之为“数据压强”\n\n精确：在极度颗粒化的场景下，满足用户个性化需求\n\n（二）内容简述\n-------\n\n第一部门其实主要讲述了何为之智能商业以及如何创建之智能商业？并在1-1、1-2给出解释：\n\n![](/download/attachments/91140677/image2022-12-2_16-28-30.png?version=1&modificationDate=1669969713283&api=v2)\n\n1、何为智能商业：曾鸣教授描述的实现“在线化”“智能化”“网络化”特征的互联网企业，他们都以下特点：\n\n    低成本，实时服务海量用户；  \n    满足每一个用户的个性化需求；  \n    服务自我更新与提升的速度；\n\n  \n2、如何创建智能商业：依靠智能商业三要素：数据化、产品化、算法化，通过产品化，持续迭代与用户互动，多维度的收集用户的数据，反馈到云端，云端通过算法优化后，在反馈给用户。整个过程闭环，相互促进。即图上展示的：网络协同与数据智能的双螺旋。\n\n（三）个人思考\n-------\n\nQ:在零售行业，曾鸣博士定义传统零售为1.0，国美、苏宁为2.0，淘宝为3.0模式。从2008年这个时间点看，3个模式的特点分别是什么？本质区别是什么？扬翔的各个产品分别处于什么阶段？\n\nA：1.0（传统零售）特点:供小于求，以产定销，层层分销，没有品牌概念。媒介：报纸和广播\n\n2.0（现代零售）特点：供大于求，供应链水平得到提升，品牌时代（受益于城市化水平提高）媒介：电视机\n\n3.0（电商零售）特点：商品丰富度远超想象、信息化水平极大提升（即网络协同和数据智能，所有信息都是联网的）、个性化与差异化需求是根源媒介：pc、手机\n\n1.0、2.0、3.0的发展其实也有一定预见性，分别是城市化水平提高、互联网的快速普及带来的必然结果，本质区别是：低成本、高效率（表现为获客的边际成本低）、多样化\n\n扬翔种猪、扬翔饲料处1.0（依靠线下的渠道和推销，效率低下。\n\n秀博猪精处2.0（扬翔+小程序将传统的买卖搬到线上，绝对避免坏账，且秀博有一定的品牌效应，但服务和销售还是很依靠线下）\n\n二、商业模式变革\n========\n\n（一）名词定义\n-------\n\nC2B：customer to business,就是消费者提出要求，制造者据此设计消费品、装备品\n\nS2B2C：S指供应平台，重构了大的供应平台，需要大幅提升供应端的效率。b指的是一个大平台接入的万级甚至更高级别的小b，帮助它们完成针对客户的服务。小b的核心价值是完成对客户实时的低成本互动。S和小b之间是赋能关系，并不是传统的加盟关系。\n\n（二）内容简述\n-------\n\n曾鸣教授阐述传统的三大商业模式，B2B、B2C、C2C，分析出目前的商业模式，用户还是处于被动的阶段，从而引出了未来商业的模式C2B,从用户到商家，用户按照自己的个性，私人定制，随意发挥，从之前的被动选择和接收，转变为主动的定制，这才是未来商业的核心价值体现。\n\nS2B：通往C2B的路径 绝大部分的大B很难把自己建成“大中台、小前端”这样更先进的组织方式。也就是说，“大B2C”虽然有很多对自己运营模式和组织形式的优化，但是它们很难在根本上完成自己的业务升级、内部组织的重构和原有管理逻辑的根本改变 。\n\n三、战略变革与组织变革\n===========\n\n（一）名词定义\n-------\n\n点 线 面 体：“面”指的是平台或者生态型企业 “点”是指在“面”上存点——线——面——体： 面 指的是平台或者生态型企业， 点 是指在 面 上存在的各种各样的新角色，“点”和“面”是共生共荣。线则是指连接了“点”、“面”和最终的客户。“面”是“体”最根本的组成要素，足够多的面日趋完善成“体”。\n\n赋能： 意为赋予更大的做事的可能性空间。（百度百科解释）\n\n中台：互联网术语，搭建一个灵活快速应对变化的架构，快速实现前端提的需求，避免重复建设，达到提高工作效率目的。中台是指让创新以最小的代价、最高的效率得以实现。\n\n（二）内容简述\n-------\n\n1、未来的战略变革：\n\n（1）新战略：高效反馈闭环。  \n“看十年，做一年”，远见和行动的快速迭代，需要在其中反馈闭环，帮助完成两个目标：第一，帮助修正你的产业终局判断；第二，帮助修正你下一步的行动。\n\n（2）新定位：点——线——面——体\n\n![](/download/attachments/91140677/image2022-12-2_16-43-36.png?version=1&modificationDate=1669970619338&api=v2)\n\n图1.3以淘宝为例最好展示点——线——面——体之间的关系，淘宝相关于一个最基础的面，点是电商对顾客的需求满足，线则是由卖家链接起来的，最终构成了电商零售的体。而单纯像滴滴这种平台会比较难，相当于把规模效应搬到了线上，缺少点线面体的关联。\n\n2、未来的组织变革：过去的组织变革经历过三大革命：工业革命、生产力革命、管理革命。而随着人工智能的发展，未来第四次的革命将会是创造力革命。创造力革命的本质是通过人工智能释放和激发人的创新力。\n\n四、案例分析及互联网未来\n============\n\n（一）重要词汇\n-------\n\n社区属性：社区中（非传统意义上的社区）所具有相同的性质，一定的对外性\n\n互联网+：“互联网+”就是要利用互联网的平台和信息通信技术，把互联网和包括传统行业在内的各行各业结合起来，在新的领域创造一种新的生态。\n\n互联网x：“互联网×”是“互联网+”概念的进阶化概念，强调互联网对传统企业的作用不应该仅仅局限于辅助作用，互联网对传统企业的作用应该是成倍数增长的。\n\n（二）内容简述\n-------\n\n互联网的核心价值是互动而不仅仅是连接。“互动”是互联网x的形态，链接是\"互联网+\"形态的。在未来，大多数企业都会是互联网+形态的，即把传统业务搬到线上，所以基于就在于谁能把链接转变为互动，利用起互联网的高效反馈闭环。（由这个描述其实可以推断出未来其实在互联网领域会强者恒强，垄断是必然的，双螺旋不断向上，但其中我觉得对企业有必然的要求：拥抱变化（正好是阿里巴巴的核心价值观））\n\n  \n\n虚拟机器人调研笔记\n=========\n\n[![](/s/-vky9ok/8401/008d09724398b50e93468e30a239d4f6d750af9b/4.1.1/_/download/resources/com.atlassian.confluence.plugins.confluence-view-file-macro:view-file-macro-resources/images/placeholder-medium-pdf.png)1202虚拟机器人学习记录\\_邹正清.pdf](/download/attachments/91140677/1202%E8%99%9A%E6%8B%9F%E6%9C%BA%E5%99%A8%E4%BA%BA%E5%AD%A6%E4%B9%A0%E8%AE%B0%E5%BD%95_%E9%82%B9%E6%AD%A3%E6%B8%85.pdf?version=1&modificationDate=1669966273076&api=v2)\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}