{
	"title": "典型任务型对话实现功能总结",
	"author": "王宇",
	"publishTime": "十一月11,2023",
	"readTime": "12s",
	"tags": "[\"黄婷\"]",
	"description": "黄婷",
	"article": "百度UNIT提供了两种方案管理对话流（TASKFLOW和技能分发），两者属于不同的机器人，均可配置多类对话（任务型）和问答技能；但技能分发下的对话技能通过填槽的方案实现，而TASKFLOW下的对话技能则通过有限状态机的方案实现。本文主要对百度taskflow的能力支持情况做一个总结：\n\n1.  **词槽收集节点：** \n    1.  一个节点只能收集一个词槽信息；\n    2.  支持部分词槽必填；\n    3.  支持打断后恢复及设置恢复话术。\n2.  **连线节点：**支持对用户Query输入内容（关键词）、意图、词槽（当前轮\\-技能下的词槽、上下轮\\-机器人下的词槽）、全局变量（机器人下某一变量值，支持列表、字典等复杂结构）等多种条件进行判断（同一个结点可设置多个进入条件，也可以有多个走向。除开始结点的连线外可不设置条件，无条件进入）；支持设置连线优先级，当多条连线的条件被同时命中时，选择优先级高的连线执行对话流程。不同类型可用的条件判断有：\n    1.  关键词：等于、不等于、包含、不包含\n    2.  意图：为空、不为空、等于、不等于\n    3.  词槽：已填充、未填充、等于、不等于、包含、不包含\n    4.  全局变量：等于、不等于\n3.  **对话答复节点：**\n    1.  支持打断后恢复及设置恢复话术；\n    2.  支持将变量或词槽（原始值和归一化值）直接配置到机器人回复话术当中；\n    3.  支持设置重置对话状态；\n    4.  支持设置是否等待用户输入；\n    5.  支持使用技能应答（放在开始结点后，在对话流程中可随时跳入对应技能意图，并在完成任务后恢复到主流程）。\n4.  **资源调用节点：**无需任何代码即可调用外部资源（添加API地址和入参），获取结果在流程中使用。（支持调用业务系统访问接口，并根据返回的数据判断流程分支）\n5.  **肯定否定节点：**对同一问题，根据用户肯定、否定或其他形式的三种回复（获取关键词变量），进入不同的对话流程。\n6.  **选择节点：**根据用户的选择执行不同的结果。比如商品推荐，根据用户的选择，调出不同的商品内容。选一个的判断可不用编程，但全选或不选需要额外编程。选择话术有一定的泛化能力，支持序数、关键词和相似词。\n7.  **变量控制节点：**词槽控制与变量控制，可在对话中进行词槽的增加、修改、删除和变量的新增、删除。\n    1.  修改词槽值：将已识别的词槽词典值更改为其他值。\n    2.  新增词槽值：选择某一词槽并填充词典值。\n    3.  清空词槽值：清空已识别的某个词槽的词典值。\n    4.  新增变量：新增一个变量。比如后新增的变量可以在后面的答复节点使用，配置多样化的答复内容。\n    5.  删除变量：删除一个变量。\n8.  **整体功能：**\n    1.  一个机器人只能配置一个对话流\n    2.  支持配置通用流程：在未识别到意图时，配置通用答复，保证了流程的连贯性和用户的对话体验。\n    3.  支持编程模式：连线、对话答复节点、资源调用节点、自定义节点。\n    4.  支持对话流保存、测试、发布、导入、导出。\n\n阿里智能对话机器人使用对话流实现多轮对话，一个机器人下只能有一个多轮对话模块（内部称为：对话工厂），但一个模块下可以配置多个对话流程，每一个对话流程均可以配置对应的意图、实体和变量。支持的能力情况总结如下：\n\n1.  **填槽节点：**\n    1.  一个节点可以收集多个词槽信息；（同一个填槽节点里面有两个槽位使用了相同识别方式时（比如出发地和目的地），可以用填槽模板干预填槽效果。）\n    2.  支持部分词槽必填；\n    3.  支持打断后恢复及设置恢复话术。\n2.  **节点条件（用户输入节点、判断节点、开始节点）：**支持意图、实体、变量（全局变量和外部传入的环境变量）、表达式等多种条件进行判断（同一个结点可设置多个条件，也可以无条件）。\n3.  **回复节点（普通节点）：**\n    1.  支持打断后恢复及设置恢复话术；\n    2.  支持将变量（内部、外部）或词槽（原始值和归一化值）直接配置到机器人回复话术当中；\n    3.  支持指定条件回复及异常处理（超时、拒识）。\n    4.  支持引用FAQ回复及拉回。\n    5.  支持完结标识。\n    6.  支持语音功能配置（播报打断、超时设定、转人工配置、发短信配置等）。\n    7.  支持设置并引用全局话术模板。\n4.  **服务调用节点（函数节点）：**无需任何代码即可调用外部资源（添加API地址和入参），获取结果在流程中使用。（支持调用业务系统访问接口，并根据返回的数据判断流程分支）。支持注册机器人通用函数；支持设置模拟数据进行模拟测试。\n5.  **赋值节点：**可以将函数或api返回值赋值给全局变量，方便其他节点使用。\n6.  **整体功能：**\n    1.  支持配置通用流程：在未识别到意图时，配置通用答复。\n    2.  支持编程模式：自定义函数节点。\n    3.  支持节点复制：支持流程内节点及其配置数据的复制及跨流程节点和部分流程的复制。\n    4.  支持对话流保存、测试、发布、下线、删除。\n\n参考：\n\n1.  [智能对话定制与服务平台 UNIT-百度](https://ai.baidu.com/ai-doc/UNIT/Vkipmkmsn)\n2.  [智能对话机器人-阿里](https://help.aliyun.com/zh/beebot/user-guide/overview?spm=a2c4g.11186623.0.0.d7d838ffckH8cT)\n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}