{
	"title": "智能商业学习笔记-2022/12/02",
	"author": "王宇",
	"publishTime": "十二月16,2022",
	"readTime": "12s",
	"tags": "[\"黄婷\"]",
	"description": "黄婷",
	"article": "**第一部分** **智能商业**\n\n**01**\n\n**智能商业大变革**\n\n如今最成功的互联网企业都是在在线化的基础之上， 在网络化和智能化方面取得了重大突破。\n\n**第一，** **在线化。** 你连上了互联网， 所有的优势才能为你所用； 如果你跟互联网完全没有关系， 这个世界只会离你越来越远。IoT（物联网） 毫无疑问是下一轮在线化的巨大机会。\n\n**第二，** **智能化。** 数据和算法， 构成了智能的基本要素。 智能服务的两个核心产品：搜索和推荐。\n\n**第三，** **网络化。**指的是社交网络化，构建高效生态系统。\n\n  \n\n**智能商业****几个非常典型的特征****：**\n\n**未来****10****年****智能商业的发展依然要靠三条主线的突破：在线广告、** **在线零售和在线社交**\n\n1.  低成本， 实时服务海量用户：基础\n2.  满足每一个用户的个性化需求：重要特征\n3.  服务自我更新与提升的速度：直接依赖机器提供服务，且拥有强大的学习能力\n\n  \n\n**智能商业的构成：双螺旋构成：** **网络协同****+****数据智能**\n\n网络协同和数据智能成为智能商业双螺旋的组成部分， 网络协同会推动数据智能的发展， 数据智能反过来也会驱动网络协同的扩张。\n\n**网络协同**： 指的是通过大规模、 多角色的实时互动来解决特定问题。 淘宝之所以能够创造这么多奇迹， 很重要的一个原因是淘宝演化成了一个社会化协同的大平台。\n\n**数据智能：**数据智能的本质就是机器取代人直接做决策。\n\n  \n\n**几乎每个行业都会经历一个从传统的、** **封闭的、 线性的供应链， 走****向开放的、** **价值协同网的完整过程， 这中间有巨大的商机。**\n\n第一个趋势是现有的智能生态会持续“爆炸”， 多元物种会蓬勃发展。\n\n第二个趋势是颠覆式的技术形成新的黑洞。\n\n  \n\n**02**\n\n**互联网的本质**\n\n**联：** **改变物理世界的底层技术革命****。**\n\n连接， 是指物理世界与Internet（因特网） 的世界连在一起， 也可以称之为“在线”。\n\n*   连接1.0时代： PC互联网\n*   连接2.0时代： 移动互联网\n*   连接3.0时代： 万物互联网\n\n**互：** **让交流沟通具备无限可能**\n\n互联网最大的价值在于能够支撑无数人同时互动。\n\n互动的前提是连接， 正是因为拥有物理性质的因特网将人和物都连接在了同一个网络里， 才让大家可以用以前不可能实现的方式进行多对多的实时互动。\n\n*   互动1.0时代： 一对多的门户广播模式（内容实现在线化，几乎没有用户能够和门户主体进行互动）\n*   互动2.0时代： 以关注为典型代表的创新型互动（以分享、 社区为核心）\n*   互动3.0时代： 社交网络服务\n\n**网：** **互联网给商业社会带来的颠覆性改变**\n\n网指的是结网， 意为人类社会的分工与合作开始用网络的方式加以实现。\n\n  \n\n**03**\n\n**智能商业双螺旋之一：** **网络协同**\n\n**开放、** **协同、 共享、 共建的****网状结构**， 它们已经开始取代封闭、 线性、 管理、 控制的工业时代线性结构。 这就是新经济范式的革命。\n\n没有网络协同效应， 单靠规模经济无法形成垄断。如果在需求端没有网络协同效应， 即使供给端的规模效应再强大， 用户的转移成本也依然很低。 也就是说， **规模经济的壁垒比网络协同效应的壁垒要低得多**， 可以用海量资本进行密集轰炸以便攻克。\n\n优步能够如此快速地扩张， 根本原因之一是打车作为一个用户场景相对简单， 从一个简单的点切入， 可以带来快速发展。 其实， 这样一个简单的场景也制约了优步发展出更加复杂的多边市场和更有生命力的生态潜力。\n\n  \n\n**0****4**\n\n**智能商业双螺旋之二：** **数据智能**\n\n无数据， 不智能； 无智能， 不商业。\n\n对于当下的商业而言， 智能化指的是商业决策会越来越多地依赖机器学习， 依赖人工智能。 机器将逐步取代人， 在越来越多的商业决策上扮演非常重要的角色。\n\n要想把**数据智能融入具体商业，** **要做好三件事： 数据化、 算法化和产品化。**\n\n*   **数据化：** **商业创新的基础**\n\n本质上， 就如同蒸汽机是我们进入工业文明的第一步、 电是我们迈入电气化的现代工业的第一步， **数据化毫****无疑问是我们进入以数据智能为核心的智能商业世界的第一步，** 也是我们这个时代最重要的创造之一。\n\n案例：**蚂蚁小贷**能做到这些， 主要归功于互联网。 它能够分享潜在客户的诸多数据， 比如这些淘宝卖家正在卖哪些商品、 生意好不好、 经营店铺是否勤快、 之前是否有过不诚信行为， 甚至还有他是否喜欢玩网游、 卖家朋友的信用度是否高等。 这些数据的丰富度、 准确度， 远高于传统银行能采集到的贷款者的信息。如果我们更全面地检视蚂蚁小贷的业务， 就会发现它做了三件关键的事： 特定商业场景的数据化、 忠实于商业逻辑的算法及其迭代优化，以及将数据智能与商业场景无缝融合的产品。 这三件事融会贯通、 相互包含， 在反馈闭环中共同演化， 这就是未来智能商业的样貌。\n\n*   **算法化：** **智能商业的“引擎”， 而非“工具”**\n\n算法是按照设定程序运行以获得理想结果的一套指令。\n\n搜索是第一个数据和算法驱动的互联网产品。DT（data technology）时代的数据价值就是商业价值，数据的价值要靠算法来发掘。\n\n数据时代的智能商业对算法提出了全新的要求： 算法的迭代方向、参数工程等， 都必须与商业逻辑、 机制设计， 甚至价值观融合为一。\n\n*   **产品化：** **数据智能和商业场景的最终载体**\n\n产品和数据、 算法的互补作用可以形象地比喻成“端+云”。 “端”就是产品， 是与用户完成个性化、 实时、 海量、 低成本互动的端口， 它不仅直接完成用户体验，同时使数据记录和用户反馈闭环得以发生， 和“云”互动； 而“云”则是数据聚合、 算法计算的平台， 它通过算法优化，更好地揣摩用户需求、 提升用户体验。 **作为“端”的产品， 具备以下三大****关键作用。**\n\n  \n\n*   **产品设计直接影响用户体验：产品的功能是否齐全、 界面是否友好以及交换是否自然， 都是产品能否取得成功的关键因素。**\n\n*   上传： 将“端”的行为数据向“云”反馈：产品是用户通过行为数据向“云”上的数据智能进行反馈、 实现数据增值和算法优化的通道。\n\n*   下达： 将“云”的数据智能传递到“端”：产品是将“云”上的数据智能传递给用户、 为用户带来价值的通道。\n\n  \n\n智能商业的成功， 最关键的一步往往是一个极富想象力的创新产品： 针对某个用户问题， 定义了全新的用户体验方式， 同时启动了数据智能的引擎， 持续提升用户体验。\n\n数据化、 算法化和产品化就是在**反馈闭环**（不可或缺）中完成了智能商业的“三位一体”的。\n\n  \n\n**活数据：** **让反馈成为闭环**\n\n  \n\n*   **数据是“活”的**\n\n  \n\n“活数据”一定是始终在线（实时记录而不是主动采集）且不断更新的， 可以随时被使用。\n\n  \n\n*   **数据需要被灵活使用**\n\n  \n\n“活数据”在不断地被消化、 处理， 产生增值服务， 同时又能产生更多的数据， 形成数据回流。\n\n**“****活数据”的三大重要特征**\n\n1.  全本记录， 而非样本抽查\n2.  先有数据， 后有洞察：我们重视的是相关性， 而不是因果性。\n3.  数据就是决策\n\n 数据智能的引擎机器要能够直接做决策\n\n**企业智能化****\\=****（核心业务）****在线化****+****（业务环节）****自动化**\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}