{
	"title": "《产品思维》",
	"author": "王宇",
	"publishTime": "三月30,2023",
	"readTime": "12s",
	"tags": "[\"2023三月学习笔记\"]",
	"description": "2023三月学习笔记",
	"article": "03 同理心训练：怎样理解愉悦与不爽\n==================\n\n学会读懂用户情绪  \n底层情绪——生物性情绪  \n四种最基本的生物性情绪：愉悦、不爽、愤怒、恐惧  \n“满足”：愉悦就是需求被满足，不爽就是需求没被满足，或者我本来在一个满足状态，突然被剥夺了.  \n优秀的人才会有几个特性：敏感、不能忍、有动手优化的能力。  \n“满足”“愉悦”“不爽”：  \n1.你可以量度，一个产品到位不到位；  \n2.你可以量度，你和一个人的关系；  \n3.你还可以看到，自己的天分和命运。\n\n  \n04 同理心训练：怎样理解愤怒与恐惧\n=====================\n\n  \n就好像愉悦与难受是一对感觉，满足就愉悦，得不到满足就难受。  \n愤怒和恐惧也是同生的一对感觉，都是来自于被侵犯。但是因为个体不同，对侵犯者的体量判断不同。所以，有时是愤怒，有时是恐惧。  \n要么做一个让人愉悦到爆爽的产品，要么做一个可以帮人抵御恐惧的产品。如果做一个看上去可以某种程度帮人不再难受，而在“爽”和“恐惧”无所作为的产品，那就是一个不痛不痒的产品，也许也有人会买单，但绝不会大火。  \n每个人的痛点都是他的恐惧，恐惧是痛点。\n\n  \n05 同理心训练：产品要顺应用户潜意识\n======================\n\n  \n体会各种人的情绪与潜意识；不被一个人基于角色化交流而说出的言辞所迷惑；看到人基于潜意识流露的真实选择。只有当你能做到以上几点，你才有了做一个好产品经理的开端。  \n说了这么多潜意识，潜意识是心理学里非常重要的词，有志于做产品的同学一定需要花时间去研究。  \n所以如果你为一个集体做产品，需要研究集体人格。  \n作为一个产品经理，要做的事就是不让用户启动防御。\n\n  \n06 认清人的本性，理解角色化生存\n====================\n\n  \n如果你想做一个好的产品经理，那么首先要学习的就是通过“去角色化”来研究真实的用户，而不是用一堆“应该”来臆测用户的行为。\n\n09 机会判断：怎样找到有势能的趋势\n==================\n\n  \n你要强迫自己，离开牵动你情绪的“点”，去看到“线”的方向，去预测这条“线”的周期，并且明确你自己在周期的哪个位置，是哪个“面”在给你赋能。你要明白外部的势能才是重要的，不要过于苛求那个跟随你的“点”，这才是决策的关键。\n\n  \n10 痛点、痒点、爽点都是产品机会\n====================\n\n  \n痛点是恐惧。爽点是即时满足。  \n痛点，是做产品的抓手。另外一个做产品的抓手，是爽点  \n痒点是什么？这也是我自己定义的，痒点满足的是人的虚拟自我。  \n总结一下，什么才是一个产品的入手点。  \n痛点、爽点、痒点都是不错的点。这个就看产品经理自己对用户的哪个点感受最深、手感最准。  \n比如说，饿了要吃东西。但是“吃饱了”和“吃得很满足”，这是两个概念。吃个馒头能饱，但是仅仅是满足了功能需求，不能支持好产品的概念。酣畅淋漓地吃一顿海底捞火锅，大汗淋漓，感觉爆爽。这就抓住了爽点，这是好产品。\n\n  \n11 两套经典的用户画像’\n================\n\n  \n本讲小结  \n讲完了大明、笨笨、小闲，你就会发现，互联网的BAT就是服务这三类经典用户涨起来的。  \n百度服务大明，你要什么说清楚，我帮你找；  \n淘宝服务笨笨，没什么事你就上来逛吧，有层出不穷的东西给你看；  \n腾讯服务小闲，闲着没事的时候，打开腾讯的任何一个产品打发时间。  \n这三个用户和上面那个草地与羊的关系是什么呢？  \n不管大明、笨笨和小闲其实都是羊，你想服务具体哪种羊，你就要按照大明羊、笨笨羊、小闲羊，三种不  \n同羊的需求，来管理你的草地，制作你的产品。  \n所以具体到痛点、痒点、爽点，你得让大明羊、笨笨羊、小闲羊按照他的心理预期，来吃一口你的草，如  \n果吃得开心就再也离不开了。\n\n  \n12 设计产品时要包括产品的场景\n===================\n\n  \n我们刚才一直在谈场景这个词，那场景到底是怎么定义？  \n要把场景拆开，场和景。“场”是时间和空间的概念，一个场就是时间加空间。用户可以在这个空间里停留和消费，如果一个人不能在某个空间去停留、消费，这个场就是不存在的。  \n“景”是什么意思？景就是情景和互动。当用户停留在这个空间的时间里，要有情景和互动让用户的情绪触发，并且裹挟用户的意见，这就是场景。  \n只有能触发用户情绪的场景才是真正的流量入口。  \n你要规划一个产品，需要问自己七个问题：  \n第一，我的产品解决了什么问题？是痛点、痒点，还是爽点？  \n第二，我在为谁解决这个问题？他得到即刻满足了吗？这是用户画像的问题。  \n第三，有多少人需要解决这个问题呢？这是市场规模的问题。  \n第四，目前人们是怎么解决这个问题的呢？这是竞争分析的问题。  \n第五，我的竞争方案为什么能够在市场竞争中胜出？你不要简单地看单点的竞争力，而是要看点线面体，谁给你赋能。  \n第六，用户会在什么样的场景触发情绪？需要马上去解决问题，这是场景问题。  \n第七，当用户遇到问题的时候，他会想到哪个名字呢？\n\n  \n13 怎样用系统能力给人提供确定性\n====================\n\n  \n本讲小结  \n如果回到第二模块讲的点线面体，你从“面”看回“点”的价值，这时候你就会发现，今天的手机支付越来越普及，我们对现金已经没什么需求了。  \n所以对于ATM机这个“点”，我们基于上述的考虑，ATM机已经走向没落了，所以基于它的技术开发和优化，可以整体降低投入了。  \n所以当你准备做一个产品的时候，你可以把ATM机这个最简单的产品拿出来对照一下：  \n第一，你的产品在“点线面体”的什么位置？  \n第二，你提供的是一个什么样的确定性？  \n第三，为了保证确定性的稳定提供，你需要的系统能力都要包括哪些环节？你有足够的资本和能力来支撑所有的环节吗？  \n很多创业企业其实死在这里，你想提供取现服务，知道一台ATM机价格是20万，但是没有把它要用到的资金成本，以及它的七个岗位的运营成本和能力充分地计算在内。  \n用我们的话来讲叫“老鼠尾巴”，就是你抓了一个很小的东西，你以为这就是全貌，但往前走一走，你才发现好大的一块还在后面，这是你完全不能够覆盖的，这样去做产品其实是很危险的。\n\n  \n15 系统世界观：微信、米聊、陌陌\n====================\n\n  \n本讲小结  \n是去连接广阔的陌生人，还是提升与熟人沟通的效率，这是微信与米聊的区别。  \n微信的3.5版本，与陌陌也拉开了差距。3.5版本的微信先做了功能前置，加了“扫描二维码”；3.6版本的微信加了“微信公众号”。  \n从3.6版本开始，微信与陌陌开始走向不同的道路。陌陌继续连接陌生人，而微信选择去连接线下更多的内容与商业，去连接广阔的物理世界。  \n3.6版本的微信，赢了米聊与陌陌，但依然是一个通讯工具。但微信没有止步于此，它继续迭代和蜕变。  \n这节课就到这里，下节课我们继续讲微信的迭代。\n\n  \n16 系统迭代：微信红包的意外与刻意\n=====================\n\n  \n本讲小结  \n到这里，6.0版本之后的微信就是咱们今天熟悉的样子，它就成了我们今天移动生活的场景。  \n我们简单地讲了微信的六次大版本的迭代，它过去一共迭代了几百次。从最早是一个通讯工具，到社交平  \n台，到现在的移动生活场景，甚至是移动商业帝国。  \n它自己从一个“点”变成了一个“面”，最后形成了一个巨大的经济体，无数企业和个人，从生活到财富，光荣与梦想，都能够在微信里得到支  \n撑，甚至在微信上完成闭环。  \n腾讯的强大是这家公司的系统能力，它能够孕育出一批小马化腾，不断在腾讯的土壤中产生像QQ、QQ空间、微信、王者荣耀这一类奇迹级的产品。  \n微信肯定已经成为了一个经济体，但它也只是腾讯公司的一个产品。  \n腾讯当然是这个数字时代的一个巨大经济体，腾讯同时也是深圳市的一个企业，只是深圳的350个上市公司之一。  \n深圳有350个上市公司，这个城市不过只有37岁，比我们今天很多得到App的用户还要年轻。  \n罗马不是一天建成的。不管我们今天看到的是微信这个我们每天都要依赖的产品，还是腾讯这家公司，抑或是深圳这座城市，都是迭代的产物。我们自己的人生也是迭代的产物。  \n从一个最好的内核开始，一个一个动作地持续迭代和一次一次微小的选择，就会成就你的产品以及你的人生。  \n微信不过就是7年，深圳市也不过就是37年。  \n今天你在一个什么样的点位上没有那么重要，重要的是在未来的几年里，你会用什么样的方式持续迭代。\n\n  \n17 系统生死线：猎豹和它的关键任务\n=====================\n\n  \n本章小结  \n第三模块系统能力就大致介绍完毕了，我在这里把第三模块简单总结一下。  \n所有的产品都是某个系统能力的结果，你要的不是做一个产品，而是建设一套系统能力，然后为你的用户提供确定性。  \n系统能力的效率优势、系统的迭代能力，都不是最后你呈现的产品表面能看得出来的，但是你的系统能力是你的产品能否存在的本质。  \n如果生于和平年代，也许按照项目管理，把项目做好上线运营就好了。  \n但机会、资本、野心、人才云集的今天，几乎每一块蓝海，都会转瞬变为红海。  \n你需要的是像摩西一样的领导力，甄别关键任务，动员众人，劈开红海，带领大家穿越生死。  \n只要你在创业，终有一天会面临跨越生死。那个时候，副总裁、总监通通都帮不了你。这时能够支撑你的，是你对关键任务的甄别，你内心的确认感和你真正的兄弟。\n\n  \n18 用户体验的五个层次\n===============\n\n  \n本讲小结  \n没有完美的产品，也没有完美的关系。  \n做一个产品，就是我要做一个东西，让它成为某些人生活中、工作中可以确定性依赖的存在。  \n看一个人，则是我知道对方想成为一个什么样的存在，我是不是认同他想要的存在感。并且站在这个人的立场，接纳这个人的瑕疵，帮他，成就他。  \n乔布斯说自己要成为伟人，荷西说他没什么追求，你是不是认同他要的存在感？  \n回顾一下，本节课，密度有点大，概念词有五个：  \n战略存在、能力圈、资源结构、角色框架和感知层。\n\n  \n19 怎样绘制用户体验的地图\n=================\n\n  \n本讲小结  \n总结一下，我们谈了一个概念叫用户体验地图和两个核心观点。  \n第一个观点：故事比数据更重要。  \n第二个观点：一个好产品，从一个好故事开始。\n\n  \n20 服务蓝图的核心要素：峰值、终值\n=====================\n\n  \n与其更好，不如不同  \n本讲小结  \n我们有了用户视角的用户体验地图概念之后，需要对应做服务蓝图，来安排我们的资源，以及配置每个接触点的角色，用来完成服务。  \n但是企业的资源是有限的，你不可能在所有点都达到用户预期。  \n所以，你需要做的是，在服务蓝图上配置你的资源来制造用户体验，使用户拥有一个美好的峰值和令人回味的终值，并且全程不突破用户的底线。\n\n  \n21 上瘾机制：用户激励系统\n=================\n\n  \n首先，人会上瘾，是对确定性满足感的依赖。  \n其实，上瘾机制的设计，就是对用户激励机制的设计。  \n激励用户，你需要考虑如何用外在激励和内在激励来交替地持续激励他。设计你的激励系统，设置一系列用户的受激励点给用户成就感，定义他的获得能力，并降低门槛。\n\n  \n22 名字是你的文化资产\n===============\n\n  \n本章小结  \n第四模块用户体验告一段落，下面总结一下：\n\n1.  从甄别自己的感觉，理解他人感受开始。\n2.  我们学习价值判断，用户研究，建设系统能力。一个产品是一个系统能力的输出结果。\n3.  用户体验的要素有五个层次，就你的存在战略来规划积累自己的能力圈、资源，通过角色框架完成用户能够感知的服务。\n4.  设计用户体验的峰值和终值，不断倾听，不断优化，设置用户激励系统。\n5.  最后，给它一个名字，把它召唤出来，成为这个世界的一部分，与这个世界建立连接。\n6.  到这里，怎么从无到有定义并做出一个产品就讲完了\n\n  \n\n23 用“用户价值公式”衡量创新\n================\n\n  \n本讲小结  \n用户价值 = ( 新体验 - 旧体验 ) - 替换成本  \n存量市场，小企业正面仰攻，新体验做到80分，用户体验为零分。增量市场，在用户体验为零的地方，你只要做60 分，用户就结结实实地觉得可以用了。  \n俞军说：“当你找到蓝海，找到一块用户体验为零的领域，你需要做的是什么？你需要把用户体验做到100分再发布，还是做到60分就快速铺开市场？当然是产品做到60分就赶紧上。”  \n速度第一，快速感染用户铺开市场，让最多的用户体验到你。这就是给后来者的壁垒，这就是蓝海的意义。\n\n  \n25 怎样从新要素到新物种\n================\n\n  \n本讲小结  \n总结一下，新产品一定要有新要素，否则没有竞争力。  \n新要素有两种：  \n第一种，在现有体验的基础上，运用最新科技等新要素，提升用户体验，或者改变成本结构。  \n第二种，用整个社会经济升级、产业升级所产生的其他领域新要素，变革内在的商业逻辑。也许用户的前端体验，依然是那个产品、那个服务，但公司背后的商业运作，已经成为了完全不同的新物种。\n\n  \n26 三级火箭：深度讲解互联网降维打击\n======================\n\n  \n这节课就到这里，总结一下，商业模式的三级火箭：  \n第一级，搭建高频头部流量；  \n第二级，沉淀用户的商业场景；  \n第三级，完成商业闭环。\n\n  \n27 颠覆式创新：成败价值网\n=================\n\n  \n本章小节  \n我们的创新模块就到此结束了。总结一下：  \n第一节课，我们谈了用户价值公式。用户价值＝新体验－旧体验－用户迁移成本，存量市场的打法就是拼体量，创业公司唯一的机会就是创新、去增量市场。  \n第二节课，我们谈了未来已来，只是分布得不均匀。根据小鸡孵化器，可以做出人类婴儿的恒温箱。其实我们需要的很多解决方案，就在你旁边已经出现了，需要的是你的思考和洞察。  \n第三节课，我们谈了新要素、新物种。所有的新产品，都会有些新要素，有些是产品本身的升级，有些是把整个社会升级的新能力纳入企业，使企业看上去在提供原来的服务，但它的内在商业运作机理已经非常不同，甚至已经变成了一个新物种。  \n第四节课，我们谈了互联网圈很爱使用的三级火箭模型。第一级火箭是头部流量，第二级火箭是沉淀用户的商业场景，第三级火箭是交易变现。  \n最后这节课，我们讲创新模式的帝王术——颠覆式创新，开启新的价值网。\n\n  \n28 看产品的微观、中观与宏观视角\n====================\n\n  \n本讲小结  \n练好套路，在大公司做到中层没问题。要想自己为结果负责，开门立户创业，必须有长在自己身上的微观体感。  \n没有微观体感，靠套路判断，就是自欺欺人。但打大仗，做顶级高手，其实宏观能力也要强。\n\n  \n29 人生逻辑大于商业逻辑\n================\n\n  \n本讲小结  \n所以，为什么会有很多企业家，很多事看上去可以做、应该做，但没有做，这就是 “非不为也，是不能也”。成功学给出的逻辑虽都很对，但是我实在是干不来。  \n其实正确的做法就是，自己真实能做到的。  \n商业是以利润为中心，人生是以意义为中心。  \n商业并非人生的全部。人死前盘点自己的一生，其实没有人看这一生赚了多少利润。  \n做你有内心确定感的事，人生逻辑大于商业逻辑。\n\n  \n\n[Filter table data](#)[Create a pivot table](#)[Create a chart from data series](#)\n\n[Configure buttons visibility](/users/tfac-settings.action)"
}